{
    "abstracts": [
        " Work fluctuations and work probability distributions are fundamentally different in systems with short- ranged versus long-ranged correlations. Specifically, in systems with long-ranged correlations the work distribution is extraordinarily broad compared to systems with shortranged correlations. This difference profoundly affects the possible applicability of fluctuation theorems like the Jarzynski fluctuation theorem. The Heisenberg ferromagnet , well below its Curie temperature, is a system with long-ranged correlations in very low magnetic fields due to the presence of Goldstone modes. As the magnetic field is increased the correlations gradually become short-ranged. Hence, such a ferromagnet is an ideal system for elucidating the changes of the work probability distribution as one goes from a domain with long-ranged correlations to a domain with short-ranged correlations by tuning the magnetic field. A quantitative analysis of this crossover behaviour of the work probability distribution and the associated fluctuations is presented. ",
        " It is predicted that III-V diluted magnetic semiconductors can exhibit stripe-like modulations of magnetization and carrier concentration. This inhomogeneity results from the strong dependence of the magnetization on the carrier concentration. Within Landau theory, a characteristic temperature T* below the Curie temperature is found so that below T* the equilibrium magnetization shows modulations, which are strongly anharmonic. Wavelength and amplitude of the modulation rise for decreasing temperature, starting from zero at T*. Above T* the equilibrium state is homogeneous, but the coupling between charge and magnetization leads to the appearance of an electrically charged layer in domain walls. ",
        " In laboratory experiments, we heated chondritic material up to 1400K in a hydrogen atmosphere. Moessbauer spectroscopy and magnetometry reveal that, at high temperatures, metallic iron forms from silicates. The transition temperature is about 1200K after 1 h of tempering, likely decreasing to about 1000K for longer tempering. This implies that in a region of high temperatures within protoplanetary disks, inward drifting solids will generally be a reservoir of metallic iron. Magnetic aggregation of iron-rich matter then occurs within the magnetic field of the disk. However, the Curie temperature of iron, 1041 K, is a rather sharp discriminator that separates the disk into a region of strong magnetic interactions of ferromagnetic particles and a region of weak paramagnetic properties. We call this position in the disk the Curie line. Magnetic aggregation will be turned on and off here. On the outer, ferromagnetic side of the Curie line, large clusters of iron-rich particles grow and might be prone to streaming instabilities. To the inside of the Curie line, these clusters dissolve, but that generates a large number density that might also be beneficial for planetesimal formation by gravitational instability. One way or the other, the Curie line may define a preferred region for the formation of iron-rich bodies. ",
        " We developed a method for measuring the similarity between materials, focusing on specific physical properties. The obtained information can be utilized to understand the underlying mechanisms and to support the prediction of the physical properties of materials. The method consists of three steps: variable evaluation based on non-linear regression, regression-based clustering, and similarity measurement with a committee machine constructed from the clustering results. Three datasets of well-characterized crystalline materials represented by critical atomic predicting variables are used as test beds. Herein, we focus on the formation energy, lattice parameter, and Curie temperature of the examined materials. Based on the information obtained on the similarities between the materials, a hierarchical clustering technique is applied to learn the cluster structures of the materials that facilitate interpreting the mechanism, and an improvement of regression models is introduced for predicting the physical properties of the materials. Our experiments show that rational and meaningful group structures can be obtained and that the prediction accuracy of the materials physical properties can be significantly increased, confirming the rationality of the proposed similarity measure. ",
        " The influence of magnitoelastic (ME) interaction on the stabilization of long-range magnetic order (LMO) in the two-dimensional easy-plane ferromagnetic is investigated in this work. The account of ME exchange results in the root dispersion law of magnons and appearance of ME gap in the spectra of elementary excitations. Such a behavior of the spectra testifies to the stabilization of LMO and finite Curie's temperature. ",
        " The last two decades have witnessed various experiments reporting very unusual magnetic properties of ensembles of gold nanoparticles surrounded by organic ligands, including ferromagnetic, paramagnetic, or (large) diamagnetic responses. These behaviors are at odds with the small diamagnetic response of macroscopic gold samples. Here we theoretically investigate the possibility that the observed unusual magnetism in capped gold nanoparticles is of orbital origin. Employing semiclassical techniques, we calculate the orbital component to the zero-field susceptibility of individual as well as ensembles of metallic nanoparticles. While the result for the orbital response of individual nanoparticles can exceed by orders of magnitude the bulk Landau susceptibility in absolute value, and can be either diamagnetic or paramagnetic depending on nanoparticle size, we show that the magnetic susceptibility of a noninteracting ensemble of nanoparticles with a smooth size distribution is always paramagnetic at low magnetic fields. In particular, we predict that the zero-field susceptibility follows a Curie-type law for small nanoparticle sizes and/or low temperatures. The calculated field-dependent magnetization of an ensemble of diluted nanoparticles is shown to be in good agreement with existing experiments that yielded a large paramagnetic response. The width of the size distribution of the nanoparticles is identified as a key element for the quantitative determination of the orbital response. ",
        " For already a decade the field of diluted magnetic semiconductors (DMS) is one of the hottest. In spite of the great success of material specific Density Functional Theory (DFT) to provide accurately critical Curie temperatures (T_{C}) in various III-V based materials, the ultimate search for a unifying model/theory was still an open issue. Many crucial questions were still without answer, as for example: Why, after one decade, does GaMnAs still exhibit the highest T_{C}? Is there any intrinsic limitations or any hope to reach room temperature? How to explain in a unique theory the proximity of GaMnAs to the metal-insulator transition, and the change from RKKY couplings in II-VI materials to the double exchange regime in GaMnN? The aim of the present work is to provide this missing theory. We will show that the key parameter is the position of the Mn level acceptor and that GaMnAs has the highest T_{C} among III-V DMS. Our theory (i) provides an overall understanding, (ii) is quantitatively consistent with existing DFT based studies, (iii) able to explain both transport and magnetic properties in a broad variety of DMS and (iv) reproduces the T_{C} obtained from first principle studies for many materials including both GaMnN and GaMnAs. The model also reproduces accurately recent experimental data of the optical conductivity of GaMnAs and predicts those of other materials. ",
        " The mechanism behind ferromagnetic exchange interaction in GdN is not well understood. It has been argued that it can be due to fourth order cross process of textit{d-f} mixing and textit{d-f} exchange. An alternative explanation suggests an anti- ferromagnetic interaction between Gd textit{d} and N textit{p} induced moments on the rock salt structure which aligns the nearest neighbor Gd textit{f} moments ferromagnetically through the textit{d-f} exchange. In this paper we present results of Curie temperature in GdN as a function of carrier density calculated within our multiband modified RKKY- like exchange interaction. It includes realistic bandstructure of the 5textit{d} conduction band as an input for single particle energies. We analyze the possibility of carrier- mediated ferromagnetism in GdN and also demonstrate a simple phenomenological model which justifies the role of charge carriers. ",
        " Hyperfine interactions between electron and nuclear spins in the quantum Hall regime provide powerful means for manipulation and detection of nuclear spins. In this work we demonstrate that significant changes in nuclear spin polarization can be created by applying an electric current in a 2-dimensional electron system at Landau level filling factor nu=1/2. Electron spin transitions at nu= 2/3 and 1/2 are utilized for the measurement of the nuclear spin polarization. Consistent results are obtained from these two different methods of nuclear magnetometry. The finite thickness of the electron wavefunction is found to be important even for a narrow quantum well. The current induced effect on nuclear spins can be attributed to electron heating and the efficient coupling between the nuclear and electron spin systems at nu=1/2. The electron temperature, elevated by the current, can be measured with a thermometer based on the measurement of the nuclear spin relaxation rate. The nuclear spin polarization follows a Curie law dependence on the electron temperature. This work also allows us to evaluate the electron g-factor in high magnetic fields as well as the polarization mass of composite fermions. ",
        " We propose that localized defects in magnetic semiconductors act as deep impurities and can be described by the Anderson model. Within this model, hybridization of d-orbitals and p-orbitals gives rise to a non-RKKY indirect exchange mechanism, when the localized d-electrons are exchanged through both conduction and valence bands. For semiconductors with indirect band gap the non-RKKY part of exchange integral is antiferromagnetic, which suppresses ferromagnetism. In case of direct band gap, this exchange mechanism can, under certain conditions, lead to enhancement of ferromagnetism. The indirect exchange intergral is much stronger than RKKY, and can be sufficiently long range. Thus, a potentially new class of high-temperature magnetic semiconductors emerges, where doped carriers are not necessary to mediate ferromagnetism. Curie temperatures in such magnetic semiconductors are determined mostly by the interaction between localized impurities, not Zener mechanism. This effect could also be responsible for unusually high Curie temperatures in some magnetic semiconductors with direct band gap, such as GaMnAs. ",
        " The quantum anomalous Hall effect has recently been observed experimentally in thin films of Cr doped (Bi,Sb)_2Te_3 at a low temperature (sim 30mK). In this work, we propose realizing the quantum anomalous Hall effect in more conventional diluted magnetic semiconductors with doped InAs/GaSb type II quantum wells. Based on a four band model, we find an enhancement of the Curie temperature of ferromagnetism due to band edge singularities in the inverted regime of InAs/GaSb quantum wells. Below the Curie temperature, the quantum anomalous Hall effect is confirmed by the direct calculation of Hall conductance. The parameter regime for the quantum anomalous Hall phase is identified based on the eight-band Kane model. The high sample quality and strong exchange coupling make magnetically doped InAs/GaSb quantum wells good candidates for realizing the quantum anomalous Hall insulator at a high temperature. ",
        " We searched for stable crystal structures of YFe_{12} using a crystal structure prediction technique based on a genetic algorithm and first-principles calculations. We obtained two monoclinic C2/m structures as metastable phases that are different from the well-known ThMn_{12} structure. These two phases have advantages in their magnetism over the ThMn_{12} structure: The total magnetization M is increased from 25.6 mu_{text{B}}/f.u. up to 26.8 mu_{text{B}}/f.u. by the transformations. We also calculated Curie temperature T_{text{C}} for these structures within the mean-field approximation and predicted the increase of T_{text{C}} from 792 K up to 940 K, which is mainly caused by the increase of intersite magnetic couplings within the distance of 2.3--3.1r{A}. The similar enhancements of M and T_{text{C}} are also obtained in the pseudo-binary system Y(Fe_{1-x}Co_{x})_{12} with x of 0--0.7. ",
        " The impact of magnetic anisotropy on the skyrmion lattice (SkL) state in cubic chiral magnets has been overlooked for long, partly because a semi-quantitative description of the thermodynamically stable SkL phase pocket forming near the Curie temperature could be achieved without invoking anisotropy effects. However, there has been a range of phenomena reported recently in these materials, such as the formation of low-temperature tilted conical and SkL states as well as temperature-induced transformations of lattice geometry in metastable SkL states, where anisotropy was suspected to play a key role. To settle this issue on experimental basis, we quantified the cubic anisotropy in a series of CoZnMn-type cubic chiral magnets. We found that the strength of anisotropy is highly enhanced towards low temperatures in all the compounds, moreover, not only the magnitude but also the character of cubic anisotropy drastically varies upon changing the Co/Mn ratio. We correlate these changes with temperature- and composition-induced variations of the helical modulation vectors, the anharmonicity and structural rearrangements of the metastable SkLs and the spin relaxation rates. Similar systematic studies on magnetic anisotropy may not only pave the way for a quantitative and unified description of the stable and metastable modulated spin textures in cubic chiral magnets but would also help exploring further topological spin textures in this large class of skyrmion hosts. ",
        " Emergent color centers with accessible spins hosted by van der Waals materials have attracted substantial interest in recent years due to their significant potential for implementing transformative quantum sensing technologies. Hexagonal boron nitride (hBN) is naturally relevant in this context due to its remarkable ease of integration into devices consisting of low-dimensional materials. Taking advantage of boron vacancy spin defects in hBN, we report nanoscale quantum imaging of low-dimensional ferromagnetism sustained in Fe3GeTe2/hBN van der Waals heterostructures. Exploiting spin relaxometry methods, we have further observed spatially varying magnetic fluctuations in the exfoliated Fe3GeTe2 flake, whose magnitude reaches a peak value around the Curie temperature. Our results demonstrate the capability of spin defects in hBN of investigating local magnetic properties of layered materials in an accessible and precise way, which can be extended readily to a broad range of miniaturized van der Waals heterostructure systems. ",
        " We present systematic temperature-dependent resistance noise measurements on a series of ferromagnetic Ga_{1-x}Mn_{x}As epitaxial thin films covering a large parameter space in terms of the Mn content x and other variations regarding sample fabrication. We infer that the electronic noise is dominated by switching processes related to impurities in the entire temperature range. While metallic compounds with x>2 % do not exhibit any significant change in the low-frequency resistance noise around the Curie temperature T_{C}, we find indications for an electronic phase separation in films with x<2 % in the vicinity of T_{C}, manifesting itself in a maximum in the noise power spectral density. These results are compared with noise measurements on an insulating Ga_{1-x}Mn_{x}P reference sample, for which the evidence for an electronic phase separation is even stronger and a possible percolation of bound magnetic polarons is discussed. Another aspect addressed in this work is the effect of ion-irradiation induced disorder on the electronic properties of Ga_{1-x}Mn_{x}As films and, in particular, whether any electronic inhomogeneities can be observed in this case. Finally, we put our findings into the context of the ongoing debate on the electronic structure and the development of spontaneous magnetization in these materials. ",
        " We have investigated the magnetic properties of Fe, Co, and Ni at finite temperatures on the basis of the first-principles dynamical coherent potential approximation (CPA) in order to clarify the role of the exchange interaction energy (J) screened by {it sp} electrons and its applicability to finite-temperature magnetism. With use of the atomic J, we obtained the Curie temperatures (T_{rm C}) 1930 K for Fe and 2550 K for fcc Co, which are overestimated by a factor of 1.8 as compared with the experimental values, while we obtained T_{rm C}=620 K for Ni being in good agreement with the experiment. Calculated effective Bohr magneton numbers also quantitatively agree with the experimental values. By comparing the results with those obtained by the screened J and by comparing them with the experiments, we found that the screened J, which are reduced by 30% as compared with the atomic ones, improve the ground-state magnetizations and densities of states at low temperatures in Fe and fcc Co, as well as T_{rm C} in fcc Co. But the screened J yield worse results for finite temperature properties of Fe and underestimate both the ground-state magnetization and T_{rm C} in case of Ni. We discuss possible origins for these inconsistencies. ",
        " A second order cross-linked network is applied onto the classical Husimi lattice, to investigate the role of a \"phantom\" non-neighboring interactions of mid- and long-range in Bethe-like lattices for the first time. Since antiferromagnetic Ising model on Husimi lattice has been exactly solved and successfully presented the melting and glass transition, the Phantom Cross-link Network (PCN) is introduced here to understand the relationship between glassy defect and long-range interactions in small molecule systems, and the concept is inspired from the classical rubber network theory (Flory, 1985). One random site out of four on the recursive unites with certain distance I (the net size) is selected to be linked onto the PCN. The solutions are still in the fashion of normal antiferromagnetic Ising model, with expected frustrations along with the net size I. Beside the common Curie transition, several interesting thermodynamics are observed in this toy model, and as the main found, PCN clearly introduces glassy portion into the system, identified by the supercooling behavior with lower TC, the metastable entropy curve and the Kauzmann paradox. ",
        " We have investigated the magnetic properties of carbon powders which consist of nanodisks, nanocones, and a small fraction of carbon-black particles. Magnetization measurements were carried out using a superconducting quantum interference device in magnetic fields -5<mu_{0}H<5:{T} for temperatures in the range 2leq T<350:{K}. Measurements of the magnetization M versus temperature T and magnetic field mu_{0}H for these carbon samples show diamagnetism and paramagetism with an additional ferromagnetic contribution. The ferromagnetic magnetization is in agreement with the calculated magnetization from Fe impurities as determined by the particle-induced x-ray emission method (<75:mu{g/g}). Magnetization measurements in weak magnetic fields show thermal hysteresis, and for strong fields the magnetization M decreases as Msim aT^{-alpha} with alpha<1, which is slower than the Curie law (alpha=1), when the temperature increases. The magnetization M versus magnetic field mu_{0}H shows paramagnetic free-spin S=frac{1}{2} and frac{3}{2} behaviors for temperatures T=2:{K} and 15leq Tleq50:{K}, respectively. A tendency for localization of electrons was found by electron spin resonance when the temperature T decreases (2<T<40:{K}). The magnetic properties in these carbon cone and disk powder samples are more complex than a free-spin model predicts, which is apparently valid only for the temperature T=2:{K}. ",
        " The RCo2Mn (R= Ho and Er) alloys, crystallizing in the cubic MgCu2-type structure, are isostructural to RCo2 compounds. The excess Mn occupies both the R and the Co atomic positions. Magnetic, electrical and heat capacity measurements have been done in these comounds. The Curie temperature is found to be 248 K and 222 K for HoCo2Mn and ErCo2Mn respectively, which are considerably higher than that of the corresponding RCo2 compounds. Saturation magnetization values calculated in these samples are less compared to that of the corresponding RCo2 compounds. Heat capacity data have been fitted with the nonmagnetic contribution with Debye temperature =250 K and electronic coefficient=26 mJ mol^-1K^-2. ",
        " We present an experimental study for polycrystalline samples of the diluted magnetic semiconductor Mn(x)Ga(1-x)N (x<0.04) in order to address some of the existing controversial issues. Different techniques were used to characterize the electronic, magnetic, and structural properties of the samples, and inelastic neutron scattering was employed to determine the magnetic excitations associated with Mn monomers and dimers. Our main conclusions are as follows: (i) The valence of the Mn ions is 2+. (ii) The Mn(2+) ions experience a substantial single-ion axial anisotropy with parameter D=0.027(3) meV. (iii) Nearest-neighbor Mn(2+) ions are coupled antiferromagnetically. The exchange parameter J= 0.140(7) meV is independent of the Mn content x, i.e., there is no evidence for hole-induced modifications of J towards a potentially high Curie temperature postulated in the literature. ",
        " The dynamics of magnetic moments in iron-chromium alloys with different levels of Cr clustering show unusual features resulting from the fact that even in a perfect body-centred cubic structure, magnetic moments experience geometric magnetic frustration resembling that of a spin glass. Due to the long range exchange coupling and configuration randomness, magnetic moments of Cr solutes remain non-collinear at all temperatures. To characterise magnetic properties of Fe-Cr alloys, we explore the temperature dependence of magnetisation, susceptibility, Curie temperature and spin-spin correlations with spatial resolution. The static and dynamic magnetic properties are correlated with the microstructure of Fe-Cr, where magnetisation and susceptibility are determined by the size of Cr precipitates at nominal Cr concentrations. The Curie temperature is always maximised when the solute concentration of Cr in the alpha phase is close to 5 to 6 at.%, and the susceptibility of Fe atoms is always enhanced at the boundary between a precipitate and solid solution. Interaction between Cr and Fe stimulates magnetic disorder, lowering the effective Curie temperature. Dynamic simulation of evolution of magnetic correlations shows that the spin-spin relaxation time in Fe-Cr alloys is in the 20 to 40 ps range. ",
        " In low-dimensional magnets, thermal agitation and spatial disorders generate strong spin fluctuations that suppress the long-range magnetic ordering. We develop an analytical equation for the equilibrium magnetization of two-dimensional magnets at finite temperatures in the presence of the random magnetic field. We find that the random field induces a first-order phase transition in addition to the reduced Curie temperature. The first-order phase transition persists even in the presence of the moderate external magnetic field. ",
        " A semiclassical approach that incorporates quantum mechanical behavior of heat capacity in direct caloric effect simulations is proposed. Application of this methodology to study electrocaloric effect in prototypical ferroelectrics { rm PbTiO_3 }, and { rm BaTiO_3 }, reveals severe underestimation of electrocaloric response at lowest temperatures by classical simulations. The discrepancy between semiclassical and classical results are found to be largest in ferroics with Debye temperature exceeding the Curie point. A route to enhance electrocaloric effect by tuning the Debye temperature in composite materials is proposed. ",
        " A new mononuclear Dysprosium based Coordination Polymer {Dy-CP} was investigated magnetically using dc and ac magnetic susceptibility. The dc magnetic susceptibility does not exhibit any long-range ordering down to 1.8 K and the negative value of Curie Constant (~ - 4 K) indicate the dominance of antiferromagnetic interactions between the Dy (III) spins. Ac susceptibility exhibits absence of single molecular magnet behavior at zero dc magnetic field and shows signal of quantum tunneling magnetization (QTM) below 8 K. However, on the superimposition of dc magnetic field (3 kOe), frequency dependent relaxation peak emerged at T_f = 5 K and QTM signal suppress at higher fields. The intermediate value of Mydosh parameter calculated from the shift in peak position (T_f) in ac susceptibility reflects the formation of superparamagnetic state. Further, the temperature dependence of Tf is analyzed with Arrhenius and Cole-Cole plot. The magnetic susceptibility analysis yields characteristics pre-relaxation factor 1.40x10^(-12) sec and energy barrier {Delta}E/k_B = 93.4 K, indicating the slow spin relaxation. The Cole-Cole fit to the ac susceptibility data shows further evidence for the single ion spin relaxation. Thus, the magnetic measurements support the single-molecule magnet behavior in Dy-CP under the application of dc magnetic field. ",
        " Submicron powder of CrO_2 was prepared by hydrothermal synthesis method from chromium trioxide. Particles obtained were of rounded form with mean diameter about 120 nm. The powder (stabilized with thin surface layer of beta-CrOOH) has been characterized by structural, X-ray and magnetic measurements. The powder (with Curie temperature about 385 K) was cold-pressed and its transport and magnetotransport properties have been measured in the temperature range 4--450 K in magnetic field up to 1.6 T. The samples studied is characterized by non-metallic temperature behavior of resistance and large negative magnetoresistance (MR) in low temperature range. At T=5 K the MR magnitude has been -17% at H=0.3 T and -20% at H=1.4 T. Its magnitude decreased fast with increase in temperature reducing to 0.3% and less for T>200 K. It is shown that this MR behavior is inherent for a system of magnetic grains with spin-dependent intergrain tunnelling. Some peculiarities of MR behavior in low-temperature range (below 40 K) can be associated with percolating character of tunnelling conductivity of this granular system under conditions of availability of only few conducting current paths through the sample. ",
        " Bare and surface-passivated Fe2N, Co2N, and Ni2N MXene were investigated by using density functional theory. Fe2N(OH)2, Fe2NO2, Co2NO2, Ni2NF2, Ni2N(OH)2, and Ni2NO2 are intrinsic half-metals, while other structures have antiferromagnetic ground states. The half-metallicity of Ni2NT2 (T = F, OH, and O) does not depend on the type of surface terminations and should be more realizable in experiments. The energy differences between the ferromagnetic and antiferromagnetic configurations of Ni2NT2 are several hundreds of meV per primitive cell. The Curie temperature should be above room temperature from the point of view of mean field approximation. ",
        " We report the epitaxial growth of CryGe1-y and CryMnxGe1-x-y(001) thin films on GaAs(001), describe the structural and transport properties, and compare the measured magnetic properties with those predicted by theory. The samples are strongly p-type, and hole densities increase with Cr concentration. The CryGe1-y system remains paramagnetic for the growth conditions and low Cr concentrations employed (y < 0.04), consistent with density functional theory predictions. Addition of Cr into the ferromagnetic semiconductor MnxGe1-x host systematically reduces the Curie temperature and total magnetization. ",
        " Cr2Ge2Te6 is a van der Waals ferromagnet with a Curie temperature at 66 K. Here we report a swift change in the magnetic ground state upon application of small DC electric current, a giant yet anisotropic magnetoelectric effect, and a sharp, lattice-driven quantum switching manifested in the I-V characteristic of the bulk single-crystal Cr2Ge2Te6. At the heart of these observed phenomena is a newly uncovered, strongly anisotropic magnetoelastic coupling that enables strongly anisotropic responses of the lattice to application of electric current and/or magnetic field, thus the exotic phenomena in Cr2Ge2Te6. Such a rare mechanical tunability in the magnetic semiconductors promises tantalizing prospects for unique functional materials and devices. ",
        " The electronic structure of Cr_{1/3}NbSe_2 is studied via optical spectroscopy. We observe two low-energy interband transitions in the paramagnetic phase, which split into four peaks as the compound enters the ferromagnetic state. The band structure calculation indicates the four peaks are interband transitions to the spin up Cr e_g states. We show that the peak splitting below the Curie temperature is emph{not} due to the exchange splitting of spin up and down bands, but directly reflects a band broadening effect in Cr-derived states upon the spontaneous ferromagnetic ordering. ",
        " We have used high-resolution Extended X-ray Absorption Fine-Structure and diffraction techniques to measure the local structure of strained La_{0.5}Sr_{0.5}CoO_3 films under compression and tension. The lattice mismatch strain in these compounds affects both the bond lengths and the bond angles, though the larger effect on the bandwidth is due to the bond length changes. The popular double exchange model for ferromagnetism in these compounds provides a correct qualitative description of the changes in Curie temperature T_C, but quantitatively underestimates the changes. A microscopic model for ferromagnetism that provides a much stronger dependence on the structural distortions is needed. ",
        " We derive a general formula for the paramagnetic NMR nuclear shielding tensor of an open-shell molecule in a pure spin state, subject to a zero-field splitting (ZFS). Our findings are in contradiction with a previous proposal. We present a simple application of the newly derived formula to the case of a triplet ground state split by an easy-plane ZFS spin Hamiltonian. When kT is much smaller than the ZFS gap, thus a single non-degenerate level is thermally populated, our approach correctly predicts a temperature-independent paramagnetic shift, while the previous theory leads to a Curie temperature dependence. ",
        " We investigate the interplay between the thermodynamic properties and spin-dependent transport in a mesoscopic device based on a magnetic multilayer (F/f/F), in which two strongly ferromagnetic layers (F) are exchange-coupled through a weakly ferromagnetic spacer (f) with the Curie temperature in the vicinity of room temperature. We show theoretically that the Joule heating produced by the spin-dependent current allows a spin-thermo-electronic control of the ferromagnetic-to-paramagnetic (f/N) transition in the spacer and, thereby, of the relative orientation of the outer F-layers in the device (spin-thermo-electric manipulation of nanomagnets). Supporting experimental evidence of such thermally controlled switching from parallel to antiparallel magnetization orientations in F/f(N)/F sandwiches is presented. Furthermore, we show theoretically that local Joule heating due to a high concentration of current in a magnetic point contact or a nanopillar can be used to reversibly drive the weakly ferromagnetic spacer through its Curie point and thereby exchange couple and decouple the two strongly ferromagnetic F-layers. For the devices designed to have an antiparallel ground state above the Curie point of the spacer, the associated spin-thermionic parallel-to-antiparallel switching causes magneto-resistance oscillations whose frequency can be controlled by proper biasing from essentially DC to GHz. We discuss in detail an experimental realization of a device that can operate as a thermo-magneto-resistive switch or oscillator. ",
        " We have synthesized Ga1-xMnxAs1-yPy and Ga1-xMnxP1-yNy by the combination of ion implantation and pulsed-laser melting. We find that the incorporation of isovalent impurities with smaller atomic radii leads to a realignment of the magnetic easy axis in Ga1-xMnxP1-yNy/GaP and Ga1-xMnxAs1-yPy/GaAs thin films from in-plane to out-of-plane. This tensile-strain-induced magnetic anisotropy is reminiscent of that observed in Ga1-xMnxAs grown on larger lattice constant (In,Ga)As buffer layers indicating that the role of strain in determining magnetic anisotropy is fundamental to III-Mn-V materials. In addition, we observe a decrease in the ferromagnetic Curie temperature in Ga1-xMnxAs1-yPy with increasing y from 0 to 0.028. Such a decrease may result from localization of holes as the P/As ratio on the Group V sublattice increases. ",
        " (Ga_{1-x},Fe_x)Sb is one of the promising ferromagnetic semiconductors for spintronic device applications because its Curie temperature (T_{rm C}) is above 300 K when the Fe concentration x is equal to or higher than ~0.20. However, the origin of the high T_{rm C} in (Ga,Fe)Sb remains to be elucidated. To address this issue, we use resonant photoemission spectroscopy (RPES) and first-principles calculations to investigate the x dependence of the Fe 3d states in (Ga_{1-x},Fe_x)Sb (x = 0.05, 0.15, and 0.25) thin films. The observed Fe 2p-3d RPES spectra reveal that the Fe-3d impurity band (IB) crossing the Fermi level becomes broader with increasing x, which is qualitatively consistent with the picture of double-exchange interaction. Comparison between the obtained Fe-3d partial density of states and the first-principles calculations suggests that the Fe-3d IB originates from the minority-spin (downarrow) e states. The results indicate that enhancement of the interaction between e_downarrow electrons with increasing x is the origin of the high T_{rm C} in (Ga,Fe)Sb. ",
        " We present the results of a thorough study of the specific heat and magnetocaloric properties of a ludwigite crystal Cu2MnBO5 over a temperature range of 60 - 350 K and in magnetic fields up to 18 kOe. It is found that at temperatures below the Curie temperature (92 K), capacity possesses a linear temperature-dependent behavior, which is associated with the predominance of two-dimensional antiferromagnetic interactions of magnons. The temperature independence of capacity is observed in the temperature range of 95 - 160 K, which can be attributed to the excitation of the Wigner glass phase. The magnetocaloric effect (i.e. the adiabatic temperature change) was assessed through a direct measurement or an indirect method using the capacity data. Owing to its strong magnetocrystalline anisotropy, an anisotropic MCE or the rotating MCE is observed in Cu2MnBO5. A deep minimum in the rotating MCE near the TC is observed and may be associated with the anisotropy of the paramagnetic susceptibility. ",
        " Repeated uniform switching of the magnetization of thin films of ferrimagnetic amorphous Gd_{x}(FeCo)_{1-x} in response to single fast laser pulses is well established. Here we report unusual toggle switching in thin films of sperimagnetic amorphous Dy_xCo_{1-x} and Tb_xCo_{1-x} with it{x} simeq 0.25 irradiated with single 200 fs pulses of 800 nm laser light. The samples have strong local random anisotropy due to the non-S state rare earth. The compensation temperature of the films is le 180 K and their Curie temperature is simeq 500 K. They are mostly switched by the first pulse, and subsequent pulses lead to partial re-switching of a decreasing amount of the irradiated area, with a granular structure of submicron regions of switched and unswitched material. Individual switched domains about 700 nm in size are observed around the edge of the irradiated spots where the fluence is at the threshold for switching. Results are discussed in terms of a random anisotropy model where the ratio of local anisotropy to exchange is temperature dependent and close to the threshold for strong pinning. ",
        " Based on the high-temperature organometallic route (Sun et al. Science 287, 1989 (2000)), we have synthesized powders containing CoPt_3 single crystals with mean diameters of 3.3(2) nm and 6.0(2) nm and small log-normal widths sigma=0.15(1). In the entire temperature range from 5 K to 400 K, the zero-field cooled susceptibility chi(T) displays significant deviations from ideal superparamagnetism. Approaching the Curie temperature of 450(10) K, the deviations arise from the (mean-field) type reduction of the ferromagnetic moments, while below the blocking temperature T_b, chi(T) is suppressed by the presence of energy barriers, the distributions of which scale with the particle volumes obtained from transmission electron microscopy (TEM). This indication for volume anisotropy is supported by scaling analyses of the shape of the magnetic absorption chi''(T,omega) which reveal distribution functions for the barriers being also consistent with the volume distributions observed by TEM. Above 200 K, the magnetization isotherms M(H,T) display Langevin behavior providing 2.5(1) mu_B per CoPt_3 in agreement with reports on bulk and thin film CoPt_3. The non-Langevin shape of the magnetization curves at lower temperatures is for the first time interpreted as anisotropic superparamagnetism by taking into account an anisotropy energy of the nanoparticles E_A(T). Using the magnitude and temperature variation of E_A(T), the mean energy barriers and 'unphysical' small switching times of the particles obtained from the analyses of chi''(T,omega) are explained. Below T_b hysteresis loops appear and are quantitatively described by a blocking model, which also ignores particle interactions, but takes the size distributions from TEM and the conventional field dependence of E_A into account. ",
        " Free magnetic moments usually manifest themselves in Curie Laws, where weak external magnetic fields produce magnetizations diverging as the reciprocal 1/T of the temperature. for a variety of materials that do not disply static magnetism, including doped semiconductors and certain rare earth intermetallics, the 1/T law is changed to a power law T^-a with a<1. We report here that a considerably simpler material, namely an insulating magneticsalt can also display such a power law, and show via comparison to specific heat data and numerical simulations that quantum mechanics is crucial for its formation. Two quantum mechanical phenomena are needed, namely level splitting - which affects the spectrum of excited states - and entanglement - where the wavefunction of a system with several degrees of freedom cannot be written as a product of wavefunctions for each degree of freedom. Entanglement effects become visible for remarkably small tunnelling terms, and are turned on well before tunnelling has visible effects on the spectrum. Our work is significant because it illustrates that entanglement is at the very heart of a very simple experimental observation for an insulating quantum spin system. ",
        " Two-dimensional (2D) ferromagnetic materials have been exhibiting promising potential in applications, such as spintronics devices. To grow epitaxial magnetic films on silicon substrate, in the single-layer limit, is practically important but challenging. In this study, we realized the epitaxial growth of MnSn monolayer on Si(111) substrate, with an atomically thin Sn/Si(111)-2sqrt{3}times2sqrt{3}- buffer layer, and controlled the MnSn thickness with atomic-layer precision. We discovered the ferromagnetism in MnSn monolayer with the Curie temperature (Tc) of ~54 K. As the MnSn film is grown to 4 monolayers, Tc increases accordingly to ~235 K. The lattice of the epitaxial MnSn monolayer as well as the Sn/Si(111)-2sqrt{3}times2sqrt{3} is perfectly compatible with silicon, and thus an sharp interface is formed between MnSn, Sn and Si. This system provides a new platform for exploring the 2D ferromagnetism, integrating magnetic monolayers into silicon-based technology, and engineering the spintronics heterostructures. ",
        " We show that the resistivity rho(T) of disordered ferromagnets near, and above, the Curie temperature T_c generically exhibits a stronger anomaly than the scaling-based Fisher-Langer prediction. Treating transport beyond the Boltzmann description, we find that within mean-field theory, drho/dT exhibits a |T-T_c|^{-1/2} singularity near T_c. Our results, being solely due to impurities, are relevant to ferromagnets with low T_c, such as SrRuO3 or diluted magnetic semiconductors, whose mobility near T_c is limited by disorder. ",
        " 95, 97Mo NMR experiments have been performed on a series of Sr2FeMoO6 and electron-doped Sr2-xLaxFeMoO6 ceramics. Detailed analysis of the NMR spectra from pristine Sr2FeMoO6 conclusively shows that the Mo hyperfine field is mainly due to atomic Mo magnetic moments. No contribution of transferred hyperfine field has been observed, confirming the absence of s-electrons in the conduction band. Upon La doping, the NMR frequency (hyperfine field) gradually increases proving that the concentration of spin polarized electrons at Mo ion is enhanced by the La substitution. A simple linear correlation between magnetic moment at Mo sites and the Curie temperature of the system has been found. Implications for understanding the electronic structure and the ferromagnetic coupling in these systems are underlined. ",
        " Occurrence of room temperature ferromagnetism is demonstrated in pulsed laser deposited thin films of Sn1-xCoxO2-d (x<0.3). Interestingly, films of Sn0.95Co0.05O2-d grown on R-plane sapphire not only exhibit ferromagnetism with a Curie temperature close to 650 K, but also a giant magnetic moment of about 7 Bohr-Magneton/Co, not yet reported in any diluted magnetic semiconductor system. The films are semiconducting and optically highly transparent. ",
        " In this letter, the electrical and magnetic properties of La{sub(1-x)}Te{sub(x)}MnO{sub(3)}(x=0.1, 0.15), which is a new material and shows good colossal magnetoresistance (CMR) behavior, have been investigated. These compounds have rhombohedral structure. In this materical, Te replaced a part of La ions, which induced the lattice cell constriction and Mn-O-Mn bond angle widening. X-ray photoemission spectroscopy (XPS) measurement revealed that the Te ions were in the tetravalent state and the manganese ions could be considered as in a mixture state of Mn{sup(2+)} and Mn{Sup(3+)}. Thus the material could be viewed as an electron-doped compound. The Curie temperature (Tc) was about 240 K and 255 K for x=0.1, 0.15, respectively. The maximum magnetoresistance ratio MR=[r(0)-r(H)]/r(0) was about 51% at 200 K and in the applied magnetic field of 40 kOe. ",
        " The ferromagnetic phase of Co_3Sn_2S_2 is widely considered to be a topological Weyl semimetal, with evidence for momentum-space monopoles of Berry curvature from transport and spectroscopic probes. As the bandstructure is highly sensitive to the magnetic order, attention has focused on anomalies in magnetization, susceptibility and transport measurements that are seen well below the Curie temperature, leading to speculation that a \"hidden\" phase coexists with ferromagnetism. Here we report spatially-resolved measurements by Kerr effect microscopy that identify this phase. We find that the anomalies coincide with a deep minimum in domain wall (DW) mobility, indicating a crossover between two regimes of DW propagation. We demonstrate that this crossover is a manifestation of a 2D phase transition that occurs within the DW, in which the magnetization texture changes from continuous rotation to unidirectional variation. We propose that the existence of this 2D transition deep within the ferromagnetic state of the bulk is a consequence of a giant quality factor for magnetocrystalline anisotropy unique to this compound. This work broadens the horizon of the conventional binary classification of DWs into Bloch and N'eel walls, and suggests new strategies for manipulation of domain walls and their role in electron and spin transport. ",
        " The effect of sintering temperatures (Ts) on the structural and magnetic properties of Ni0.6Zn0.4Fe2O4 (NZFO) ferrites synthesized by conventional double sintering method has been reported. The samples are sintered at 1200, 1250 and 1300 {deg}C. The X-ray diffraction (XRD) analysis reveals the formation of a single phase cubic spinel structure of the sample. The magnetic parameters such as saturation magnetization, Ms; coercive field, Hc; remanent magnetization, Mr and Bohr magneton, {mu}B are determined and well compared with reported values. The obtained values are found to be 71.94 emu/gm and 1.2 Oe for Ms and Hc, respectively at Ts=1300 oC. Curie temperature (Tc) at various Ts has also been calculated. It is noteworthy to note that the sample with a very low Hc could be used in transformer core and inductor applications. ",
        " We present high-temperature ferromagnetism and large magnetic anisotropy in heavily Fe-doped n-type ferromagnetic semiconductor (In1-x,Fex)Sb (x = 20 - 35%) thin films grown by low-temperature molecular beam epitaxy. The (In1-x,Fex)Sb thin films with x = 20 - 35% maintain the zinc-blende crystal and band structure with single-phase ferromagnetism. The Curie temperature (TC) of (In1-x,Fex)Sb reaches 390 K at x = 35%, which is significantly higher than room temperature and the highest value so far reported in III-V based ferromagnetic semiconductors. Moreover, large coercive force (HC = 160 Oe) and large remanent magnetization (Mr/MS = 71%) have been observed for a (In1-x,Fex)Sb thin film with x = 35%. Our results indicate that the n-type ferromagnetic semiconductor (In1-x,Fex)Sb is very promising for spintronics devices operating at room temperature. ",
        " We contest the interpretation by Gavilano et al. (Phys.Rev.Lett. 90 (2003) 167202) of violation of the Curie law behavior of the paramagnetic susceptibility at low temperatures by means of the quenching of the V4+-ion moment. These results can be understood as caused by well-known conventional phenomena like crystal-field interactions but with taking into account the intra-atomic spin-orbit coupling for the V4+ ion. ",
        " We observe how the charge-ordering (CO) temperature of Nd1/2Sr1/2MnO3 decreases with the external pressure p from 160 K at p = 0 down to 30 K at p ~ 4.5 GPa, by measuring the values p, T where the far-infrared spectral weight of the metallic phase is fully recovered. We thus determine the (p, T) phase diagram of CO in that manganite. We also find that the parameter d(lnTCO)/dp which describes this metallization from the CO phase is equal and opposite to the quantity d(lnTc)/dp which governs the metallization of the paramagnetic state at comparable Curie temperatures Tc, in similar manganites at half doping. ",
        " Recently, the quantum anomalous Hall (QAH) insulators are predicted in Lithium-decorated iron-based superconductor monolayer materials (LiFeX (X=S, Se and Te)) with very high Curie temperature (textcolor[rgb]{0.00,0.00,1.00}{PRL 125, 086401 (2020)}), which combines the topological and ferromagnetic (FM) orders. It is interesting and useful to achieve coexistence of intrinsic piezoelectricity, ferromagnetism and nontrivial band topology in single two-dimensional (2D) material, namely 2D piezoelectric quantum anomalous hall insulator (PQAHI). In this work, 2D Janus monolayer {Li_2Fe_2SSe} is predict to be a room-temperature PQAHI, which possesses dynamic, mechanical and thermal stabilities. It is predicted to be a half Dirac semimetal without spin-orbit coupling (SOC). It is found that the inclusion of SOC opens up a large nontrivial gap, which means the nontrivial bulk topology (QAH insulator), confirmed by the calculation of Berry curvature and the presence of two chiral edge states (Chern number C=2). Calculated results show that monolayer {Li_2Fe_2SSe} possesses robust QAH states against biaxial strain and electronic correlations. Compared to LiFeX, the glide mirror G_z of {Li_2Fe_2SSe} disappears, which will induce only out-of-plane piezoelectric response. The calculated out-of-plane d_{31} of monolayer {Li_2Fe_2SSe} is -0.238 pm/V comparable with ones of other 2D known materials. Moreover, very high Curie temperature (about 1000 K) is predicted by using Monte Carlo (MC) simulations, which means that the QAH effect can be achieved at room temperature in Janus monolayer {Li_2Fe_2SSe}. Similar to monolayer {Li_2Fe_2SSe}, the PQAHI can also be realized in the Janus monolayer {Li_2Fe_2SeTe}. ",
        " We studied structural, electronic and magnetic properties of a cubic perovskite BaFeO_{3-delta} (0 le delta le 0.5) within the density functional theory using a generalized gradient approximation and a GGA+U method. According to our calculations, BaFeO_3 in its stoichiometric cubic structure should be half-metallic and strongly ferromagnetic, with extremely high Curie temperature (T_C) of 700 - 900 K. However, a such estimate of T_C disagrees with all available experiments, which report that T_C of the BaFeO_3 and undoped BaFeO_{3-delta} films varies between 111 K and 235 K or, alternatively, that no ferromagnetic order was detected there. Fitting the calculated x-ray magnetic circular dichroism spectra to the experimental features seen for BaFeO_3, we concluded that the presence of oxygen vacancies in our model enables a good agreement. Thus, the relatively low T_C measured in BaFeO_3 can be explained by oxygen vacancies intrinsically presented in the material. Since iron species near the O vacancy change their oxidation state from 4+ to 3+, the interaction between Fe^{4+} and Fe^{3+}, which is antiferromagnetic, weakens the effective magnetic interaction in the system, which is predominantly ferromagnetic. With increasing delta in BaFeO_{3-delta}, its T_C decreases down to the critical value when the magnetic order becomes antiferromagnetic. Our calculations of the electronic structure of BaFeO_{3-delta} illustrate how the ferromagnetism originates and also how one can keep this cubic perovskite robustly ferromagnetic far above the room temperature. ",
        " Shifting the Curie temperature in dependence on both uniaxial pressure and electric field in BaTiO_3 crystals was studied based on literature data. It was shown that both these dependences perfectly coincide when adjusting the scale. Based on coincidence of these dependencies a relationship between both an uniaxial pressure and an electric field when shifting the Curie temperature was established. ",
        " The two-dimensional (2d) Ising model is the statistical physics textbook example for phase transitions and their kinetics. Quenched through the Curie point with Glauber rates, the late-time description of the ferromagnetic domain coarsening finds its place at the scalar sector of the Allen-Cahn (Model A) class. Resisting exact results sought since Lifshitz's account in 1962, central quantities in 2d Model A - most scaling exponents and correlation functions - remain known up to approximate theories whose disparate outcomes urge experimental assessment. Here, we perform such assessment from a comprehensive study of the coarsening of 2d twisted nematic liquid crystals whose kinetics is induced by a super-fast switching from a spatiotemporally chaotic state to a two-phase concurrent, equilibrium one. Tracking the dynamics via optical microscopy, we firstly show the sharp evidence of well-established Model A aspects, such as the dynamic exponent z=2 and the dynamic scaling hypothesis, to then move forward. We confirm the Bray-Humayun theory for Porod's regime describing intradomain length scales of spatial correlators, and show that their nontrivial decay beyond that regime is captured in a free-from-parameter fashion by Gaussian theories. These paradigmatic theories, however, do not perform well for time-related Model A statistics. We reveal that the collapsed form of two-time correlators is best accounted for by the local scaling invariance theory, along with the Fisher-Huse conjecture. We also suggest the true value for the local persistence exponent, in disfavour of Gaussian models, and extract a universal fractal dimension for the morphology of persistence clusters that is notably close to the golden ratio. Given its accuracy and possibilities, this experimental setup may work as a prototype to address universality issues in the realm of nonequilibrium systems. ",
        " Diluted magnetic semiconductors (DMSs) based on group-IV materials are desirable for spintronic devices compatible with current silicon technology. In this work, amorphous Mn-doped SiGe thin films were first fabricated on Ge substrates by radio frequency magnetron sputtering and then crystallized by rapid thermal annealing (RTA). After the RTA, the samples became ferromagnetic (FM) semiconductors, in which the Curie temperature increased with increasing Mn doping concentration and reached 280 K with 5% Mn concentration. The data suggest that the ferromagnetism came from the hole-mediated process and was enhanced by the tensile strain in the SiGe crystals. Meanwhile, the Hall effect measurement up to 33 T to eliminate the influence of anomalous Hall effect (AHE) reveals that the hole mobility of the annealed samples was greatly enhanced and the maximal value was ~1000 cm2/Vs, owing to the tensile strain-induced band structure modulation. The Mn-doped SiGe thin films with high Curie temperature ferromagnetism and high hole mobility may provide a promising platform for semiconductor spintronics. ",
        " Thermoelectric power, electrical conductivity, and high field Hall effect were studied over a broad temperature range in ferromagnetic Ga(1-x)Mn(x)As epitaxial layers (0.015<x<0.06). Thermoelectric power analysis gives the information about carrier transport mechanisms in layers with both metallic and non-metallic type of conductivity and allows determination of the Fermi energy and carrier concentration. At high temperatures (T>70 K) the thermoelectric power in GaMnAs linearly increases with increasing temperature. That indicates the presence of a degenerate hole gas with the Fermi energy EF=220+-25 meV, nearly independent of Mn content (for 0.02<x<0.05). At lower temperatures GaMnAs layers with metallic-type conductivity show an additional contribution to the thermoelectric power with the maximum close to the Curie temperature. The layers exhibiting insulating electrical properties show 1/T-type increase of thermoelectric power at low temperatures. ",
        " We have investigated the ferromagnetic phase transition of elemental Co by high-resolution neutron backscattering spectroscopy. We monitored the splitting of the nuclear levels by the hyperfine field at the Co nucleus. The energy of this hyperfine splitting is identified as the order parameter of the ferromagnetic phase transition. By measuring the temperature dependence of the energy we determined the critical exponent beta = 0.350 pm 0.002 and the ferromagnetic Curie temperature of T_{text{C}} = 1400~K. The present result of the critical exponent agrees better with the predicted value (0.367) of the 3-dimensional Heisenberg model than that determined previously by NMR. ",
        " A systematic study of hole compensation effect on magnetic properties, which is controlled by defect compensation through ion irradiation, in (Ga,Mn)As, (In,Mn)As and (Ga,Mn)P is presented in this work. In all materials, both Curie temperature and magnetization decrease upon increasing the hole compensation, confirming the description of hole mediated ferromagnetism according to the p-d Zener model. The material dependence of Curie temperature and magnetization versus hole compensation reveals that the manipulation of magnetic properties in III-Mn-V dilute ferromagnetic semiconductors by ion irradiation is strongly influenced by the energy level location of the produced defect relative to the band edges in semiconductors. ",
        " We report the effects of electron doping on the ground state of a diamagnetic semiconductor FeGa_{3} with a band gap of 0.5 eV. By means of electrical resistivity, magnetization and specific heat measurements we have found that gradual substitution of Ge for Ga in FeGa_{3-y}Ge_{y} yields metallic conduction at a very small level of y = 0.006, then induces weak ferromagnetic (FM) order at y = 0.13 with a spontaneous moment of 0.1 mu_{B}/Fe and a Curie temperature T_{C}= 3.3 K, which continues increasing to T_{C} = 75 K as doping reaches y = 0.41. The emergence of the FM state is accompanied by quantum critical behavior as observed in the specific heat, C/T propto -lnT, and in the magnetic susceptibility, M/B propto T^{-4/3}. At y= 0.09, the specific heat divided by temperature C/T reaches a large value of 70 mJ/K^{2}molFe, twice as large as that reported on FeSi_{1-x}Ge_{x} for x_{c}= 0.37 and Fe_{1-x}Co_{x}Sb_{2} for x_{c}=0.3 at their respective FM quantum critical points. The critical concentration y_{c}=0.13 in FeGa_{3-y}Ge_{y} is quite small, despite the fact that its band gap is one order of magnitude larger than those in FeSi and FeSb_{2}. In contrast, no FM state emerges by substituting Co for Fe in Fe_{1-x}Co_{x}Ga_{3} in the whole range 0 leq x leq 1, although both types of substitution should dope electrons into FeGa_{3}. The FM instability found in FeGa_{3-y}Ge_{y} indicates that strong electron correlations are induced by the disturbance of the Fe 3d - Ga 4p hybridization. ",
        " We report an interplay between magnetism and charge transport in the ferromagnetic semiconductor GdN, pointing to the formation of magnetic polarons centred on nitrogen vacancies. The scenario goes some way to resolving a long-standing disagreement between the measured and predicted Curie temperature in GdN. It further constitutes an extension of concepts that relate closely to the behaviour of ferromagnetic semiconductors generally, and EuO in particular. ",
        " A two-dimensional scandium monochloride sheet was investigated by using density functional theory. It could be exfoliated from a known bulk material with a cleavage energy slightly lower than that of graphene. The sheet has a ferromagnetic ground state with a Curie temperature of 100 K. Moreover, the sheet becomes a half-metal under hole doping. The Curie temperature increases to 250 K with the doping amount of 0.4 per primitive cell, which is close to the ice point. The two-dimensional scandium monochloride sheet should be a good candidate for two-dimensional spintronics. ",
        " A strong influence of illumination and electric bias on the Curie temperature and saturation value of the magnetization is demonstrated for semiconductor structures containing a modulation-doped p-type Cd0.96Mn0.04Te quantum well placed in various built-in electric fields. It is shown that both light beam and bias voltage generate an isothermal and reversible cross-over between the paramagnetic and ferromagnetic phases, in the way that is predetermined by the structure design. The observed behavior is in quantitative agreement with the expectations for systems, in which ferromagnetic interactions are mediated by the weakly disordered two-dimensional hole liquid. ",
        " In this paper, electrical properties of BaTiO3 nano crystals have been studied, Barium Titanate Nano Crystals are made by mechanical alloying method in a ball mill of SPEX 8000. In order to find Curie temperature, dielectric constant variation via temperature and hysteresis loops are investigated. Our results show that, there is a relationship between the time of milling and the curie temperature .this means with increasing milling time, grain size will decrease, consequently the curie temperature will decrease. In addition, with increasing temperature up to the Curie temperature, the hysteresis loop of samples decrease and at the Curie temperature the hysteresis loop changes to a straight line. ",
        " We have studied the chemical potential shift as a function of temperature in Nd_{1-x}Sr_xMnO_3 (NSMO) by measurements of core-level photoemission spectra. For ferromagnetic samples (x=0.4 and 0.45), we observed an unusually large upward chemical potential shift with decreasing temperature in the low-temperature region of the ferromagnetic metallic (FM) phase. This can be explained by the double-exchange (DE) mechanism if the e_g band is split by dynamical/local Jahn-Teller effect. The shift was suppressed near the Curie temperature (T_C), which we attribute to the crossover from the DE to lattice-polaron regimes. ",
        " We present magnetoresistance measurements performed on ultrathin films of amorphous Ni and Fe. In these films the Curie temperature drops to zero at small thickness, making it possible to study the effect of ferromagnetism on localization. We find that non-ferromagnetic films are characterized by positive magnetoresistance. This is interpreted as resulting from weak antilocalization due to strong Bychkov-Rashba spin orbit scattering. As the films become ferromagnetic the magnetoresistance changes sign and becomes negative. We analyze our data to identify the individual contributions of weak localization, weak antilocalization and anisotropic magnetoresistance and conclude that the magnetic order suppresses the influence of spin-orbit effects on localization phenomena in agreement with theoretical predictions. ",
        " The phase diagram of quarter-hole-doped perovskite manganites is investigated using the doubleexchange model. An exotic striped type-II multiferroic phase, where 25% of the nearest-neighbor spin couplings are orthogonal to each other, is found in the narrow-bandwidth region. Comparing with the spiral-spin ordering phase of undoped manganites, the multiferroic Curie temperature of the new phase is estimated to be ~4 times higher, while the ferroelectric polarization is similar in magnitude. Our study provides a path for noncollinear spin multiferroics based on electronic self-organization, different from the traditional approach based on superexchange frustration. ",
        " We present the temperature and layer dependent electronic structure of a 20-layer EuS(100)-film using a combination of first-principles and model calculation, the latter based on the ferromagnetic Kondo-lattice. The calculated thickness-dependent Curie temperature agrees very well with experimental data. The projected 5d-bandstructure is at finite temperatures strongly influenced by damping effects due to spin exchange processes. Spin-split unoccupied 5d-surfaces states are found with a Stoner-like collapsing for increasing temperature towards the Curie point and with an exponential decay of spectral weight with increasing distance from the surface. ",
        " Inspired by the successful synthesis of two-dimensional (2D) V-based Janus dichloride monolayers with intrinsic ferromagnetism and high Curie temperature (T_{c}), the electronic structure, spin-valley splitting and magnetic anisotropy of Janus 2H-VSeS monolayers are investigated in detailed using first-principles calculations. The results show that the Janus 2H-VSeS monolayer exhibits a large valley splitting of 105meV, high T_{c} of 278K and good magnetocrystalline anisotropy (0.31meV) contributed by the in-plane d_{x^{2}-y^{2}}/d_{xy} orbitals of V atoms. The biaxial strain (-8%<varepsilon<8%) can effectively tune the magnetic moments of V atom, valley splitting DeltaE, T_{c} and MAE of Janus 2H-VSeS monolayer. The corresponding DeltaE and T_{c} are adjusted from 72meV to 106.8meV and from 180K to 340K, respectively. The electronic phase transition from bipolar magnetic semiconductor (BMS) to half-semiconductor (HSC), spin gapless semiconductor (SGS), and half-metal (HM) is also observed due to the change of V 3d-orbital occupation. Due to the broken space- and time-reversal symmetry, the opposite valley charge carriers carry opposite Berry curvature, which leads to prominent anomalous Hall conductivity at the K and K^{prime} valleys. The maximum modulation of Berry curvature can reach to 45% and 9.5% by applying the biaxial strain and charge carrier doping, respectively. The stable in-plane magnetocrystalline anisotropy and large spontaneous valley polarization make the ferromagnetic Janus 2H-VSeS monolayer a promising material for achieving the spintronics and valleytronics devices. ",
        " We report on a comprehensive study of the magnetic coupling between soft magnetic Fe layers and hard magnetic Dysprosium (Dy) layers at low temperatures (4.2 - 120K). For our experiments we prepared thin films of Fe and Dy and multilayers of Fe/Dy by ultra-high vacuum sputtering. The magnetic properties of each material were determined with a superconducting quantum interference device. Furthermore, we performed magnetoresistance measurements with similarly grown, microstructured devices, where the anisotropic magnetoresistance (AMR) effect was used to identify the magnetization state of the samples. By analyzing and comparing the corresponding data of Fe and Dy, we show that the presence of a Dy layer on top of the Fe layer significantly influences its magnetic properties and makes it magnetically harder. We perform a systematic evaluation of this effect and its dependence on temperature and on the thickness of the soft magnetic layer. All experimental results can consistently be explained with exchange coupling at the interface between the Fe and the Dy layer. Our experiments also yield a negative sign of the AMR effect of thin Dy films, and an increase of the Dy films' Curie temperature, which is due to growth conditions. ",
        " We have investigated the electronic and magnetic properties of perovskite SrRu1-xIrxO3 thin films grown by pulsed laser deposition on atomically-flat (001) SrTiO3 substrates. SrRuO3 has the properties of a ferromagnetic metal with Curie temperature 150 K. Substituting Ir for Ru in SrRuO3, films showed fully-metallic behavior and ferromagnetic ordering, although resistivity increased and the ferromagnetic TC decreased. Films with x = 0.25 underwent the metal-to-insulator transition at 75 K, and spin-glass-like ordering at 45 K with the elimination of ferromagnetic long-range ordering caused by the electron localization at the substitution sites. In ferromagnetic films, resistivity increased near-linearly with T, but in paramagnetic film (x = 0.25) resistivity increased as T3/2. Moreover, observed spin-glass-like (TSG) ordering with the negative magnetoresistance in film with x = 0.25; validates the hypothesis that (Anderson) localization favors glassy ordering at amply disorder limit. These observations provide a promising approach for future applications and of fundamental interest in 4d and 5d mixed perovskites. ",
        " Spin-lattice dynamics is used to study the magnetic properties of Fe foams. The temperature dependence of the magnetization in foams is determined as a function of the fraction of surface atoms in foams, nsurf. The Curie temperature of foams decreases approximately linearly with nsurf, while the critical exponent of the magnetization increases considerably more strongly. If the data are plotted as a function of the fraction of surface atoms, reasonable agreement with recent data on vacancy-filled Fe crystals and novel data on void-filled crystals is observed for the critical . Critical temperature and critical exponent also depend on the coordination of surface atoms. Although the decrease we find is relatively small, it hints to the possibility of improved usage of topology to taylor magnetic properties. ",
        " We present resistivity, magnetization and specific heat measurements on flux grown single crystals of NiBi3. We find typical behavior of a type-II superconductor, with, however, a sizable magnetic signal in the superconducting phase. There is a hysteretic magnetization characteristic of a ferromagnetic compound. By following the magnetization as a function of temperature, we find a drop at temperatures corresponding to the Curie temperature of ferromagnetic amorphous Ni. Thus, we assign the magnetism in NiBi_3 crystals to amorphous Ni impurities. ",
        " We study the phase diagram of random outerplanar maps sampled according to non-negative Boltzmann weights that are assigned to each face of a map. We prove that for certain choices of weights the map looks like a rescaled version of its boundary when its number of vertices tends to infinity. The Boltzmann outerplanar maps are then shown to converge in the Gromov-Hausdorff sense towards the alpha-stable looptree introduced by Curien and Kortchemski (2014), with the parameter alpha depending on the specific weight-sequence. This allows us to describe the transition of the asymptotic geometric shape from a deterministic circle to the Brownian tree. ",
        " Precise resistivity measurements on the ferromagnetic superconductor UGe2 under pressure p and magnetic field H reveal a previously unobserved change of the anomaly at the Curie temperature. Therefore, the tricritical point (TCP) where the paramagnetic-to-ferromagnetic transition changes from a second order to a first order transition is located in the p-T phase diagram. Moreover, the evolution of the TCP can be followed under the magnetic field in the same way. It is the first report of the boundary of the first order plane which appears in the p-T-H phase diagram of weak itinerant ferromagnets. This line of critical points starts from the TCP and will terminate at a quantum critical point. These measurements provide the first estimation of the location of the quantum critical point in the p-H plane and will inspire similar studies of the other weak itinerant ferromagnets. ",
        " Magnetic Weyl semimetals (mWSMs) are characterized by linearly dispersive bands with chiral Weyl node pairs associated with broken time reversal symmetry. One of the hallmarks of mWSMs is the emergence of large intrinsic anomalous Hall effect. On heating the mWSM above its Curie temperature, the magnetism vanishes while exchange-split Weyl point pairs collapse into doubly-degenerated gapped Dirac states. Here, we reveal the attractive potential of these Dirac nodes in paramagnetic state for efficient spin current generation at room temperature via the spin Hall effect. Ni and In are introduced to separately substitute Co and Sn in a prototypal mWSM Co_3Sn_2S_2 shandite film and tune the Fermi level. Composition dependence of spin Hall conductivity for paramagnetic shandite at room temperature resembles that of anomalous Hall conductivity for ferromagnetic shandite at low temperature; exhibiting peak-like dependence centering around the Ni-substituted Co_2Ni_1Sn_2S_2 and undoped Co_3Sn_2S_2 composition, respectively. The peak shift is consistent with the redistribution of electrons' filling upon crossing the ferromagnetic-paramagnetic transition, suggesting intercorrelation between the two Hall effects. Our findings highlight a novel strategy for the quest of spin Hall materials, guided by the abundant experimental anomalous Hall effect data of ferromagnets in the literature. ",
        " The spin Hall effect in a heavy metal thin film allows to probe the magnetic properties of an adjacent magnetic insulator via magnetotransport measurements. Here, we investigate the magnetoresistive response of yttrium iron garnet/platinum heterostructures from room temperature to beyond the Curie temperature T_{C, YIG} approx 560,{K} of the ferrimagnetic insulator. We find that the amplitude of the (local) spin Hall magnetoresistance decreases monotonically from 300,{K} towards T_{C}, mimicking the evolution of the saturation magnetization of yttrium iron garnet. Interestingly, the spin Hall magnetoresistance vanishes around 500,{K}, well below T_{C}, which we attribute to the formation of a parasitic interface layer by interdiffusion. Around room temperature the non-local magnon-mediated magnetoresistance exhibits a power law scaling T^{alpha} with alpha = 3/2, as already reported. The exponent decreases gradually to alpha sim 1/2 at around 420,{K}, before the non-local magnetoresistance vanishes rapidly at a similar temperature as the spin Hall magnetoresistance. We attribute the reduced alpha at high temperatures to the increasing thermal magnon population which leads to enhanced scattering of the non-equilibrium magnon population and a reduced magnon diffusion length. Finally, we find a magnetic field independent offset voltage in the non-local signal for T > 470,{K} which we associate with electronic leakage currents through the normally insulating yttrium iron garnet film. Indeed, this non-local offset voltage is thermally activated with an energy close to the band gap. ",
        " A two-dimensional double-metal oxide MnCoO4 was predicted to be an intrinsic ferromagnetic semiconductor by using density functional theory. The low cleavage energy 0.36 Jm-2, which is similar to that of graphene, indicates that it can be easily exfoliated. The bulk structure has an antiferromagnetic ground state while the ferromagnetic configuration is the ground state against two antiferromagnetic and three ferrimagnetic configurations in the two-dimensional structure. The spin flip gaps for valence and conduction bands are 0.41 and 0.10 eV calculated with the HSE06 density functional, which are much larger than the thermal energy at room temperature. The Curie temperature obtained from the Monte Carlo simulation is 40 K. Under 9% tensile strain, the spin flip gaps increase largely so that the spin flip can be suppressed. The direct antiferromagnetic coupling between the Mn and Co atoms reduces largely while the indirect ferromagnetic couplings between two Mn or two Co atoms mediated by the O atoms do not decrease much in the stretched structure. The Curie temperature increases to 230 K, higher than the dry ice temperature. Moreover, phonon dispersion indicates that the MnCoO4 is also stable under the tensile stain. Therefore, two-dimensional MnCoO4 could be a good candidate for low-dimensional spintronics. ",
        " From first principles calculations we investigate the electronic structure and the magnetic properties of EuO under hydrostatic and epitaxial forces. There is a complex interdependence of the O 2p and Eu 4f and 5d bands on the magnetism in EuO, and decreasing lattice parameters is an ideal method to increase the Curie temperature, T_c. Compared to hydrostatic pressure, the out-of-plane compensation that is available to epitaxial films influences this increase in T_c, although it is minimized by the small value of poisson's ratio for EuO. We find the semiconducting gap closes at a 6% in-plane lattice compression for epitaxy, at which point a significant conceptual change must occur in the active exchange mechanisms. ",
        " Extensive efforts have been devoted to the study of spin-orbit torque in ferromagnetic metal/heavy metal bilayers and exploitation of it for magnetization switching using an in-plane current. As the spin-orbit torque is inversely proportional to the thickness of the ferromagnetic layer, sizable effect has only been realized in bilayers with an ultrathin ferromagnetic layer. Here we demonstrate that, by stacking ultrathin Pt and FeMn alternately, both ferromagnetic properties and current induced spin-orbit torque can be achieved in FeMn/Pt multilayers without any constraint on its total thickness. The critical behavior of these multilayers follows closely three-dimensional Heisenberg model with a finite Curie temperature distribution. The spin torque effective field is about 4 times larger than that of NiFe/Pt bilayer with a same equivalent NiFe thickness. The self-current generated spin torque is able to switch the magnetization reversibly without the need for an external field or a thick heavy metal layer. The removal of both thickness constraint and necessity of using an adjacent heavy metal layer opens new possibilities for exploiting spin-orbit torque for practical applications. ",
        " In the paper we propose a theoretical model that takes into account Vegard strains and perform a detailed quantitative comparison of the theoretical results with experimental ones for quasispherical nanoparticles, which reveal the essential (about 100 K) increase of the transition temperature in spherical nanoparticles in comparison with bulk crystals. The average radius of nanoparticles was about 25 nm, they consist of K(Ta,Nb)O3 solid solution, where KTaO3 is a quantum paraelectric, while KNbO3 is a ferroelectric.From the comparison between the theory and experiment we unambiguously established the leading contribution of Vegard strains into the extrinsic size effect in ferroelectric nanoparticles. We determined the dependence of Vegard strains on the content of Nb and reconstructed the Curie temperature dependence on the content of Nb using this dependence. Appeared that the dependence of the Curie temperature on the Nb content becomes nonmonotonic one for the small (< 20 nm) elongated K(Ta,Nb)O3 nanoparticles. We established that the accumulation of intrinsic and extrinsic defects near the surface can play the key role in the physical origin of extrinsic size effect in ferroelecric nanoparticles and govern its main features. ",
        " Ferromagnetic insulators (FMIs) are one of the most important components in developing dissipationless electronic and spintronic devices. However, since ferromagnetism generally accompanies metallicity, FMIs are innately rare to find in nature. Here, novel room-temperature FMI films are epitaxially synthesized by deliberate control of the ratio of two B-site cations in the double perovskite Sr2FeReO6. In contrast to the known ferromagnetic metallic phase in stoichiometric Sr2FeReO6, a FMI state with a high Curie temperature (Tc~400 K) and a large saturation magnetization (MS~1.8 {mu}B/f.u.) is found in highly cation-ordered Fe-rich phases. The stabilization of the FMI state is attributed to the formation of extra Fe3+-Fe3+ and Fe3+-Re6+ bonding states, which originate from the excess Fe. The emerging FMI state by controlling cations in the epitaxial oxide perovskites opens the door to developing novel oxide quantum materials & heterostructures. ",
        " We present an ab-initio-based effective interaction model (EIM) for the study of magnetism, thermodynamics, and their interplay in body-centered cubic Fe-Co alloys, with Co content from 0 to 70%. The model includes explicitly both spin and chemical variables. For the former, a Heisenberg formalism is adopted. But, the spin magnitude of each Fe atom varies according to its local chemical environment, following a simple rule determined by density functional theory (DFT) calculations. The proposed model is able to describe precisely the ground-state magneto-energetic landscape of both chemically ordered and disordered Fe-Co systems, as given by DFT and experiments. In combination with on-lattice Monte Carlo simulations, it enables an accurate prediction at finite temperatures. In particular, the Curie point and the chemical order-disorder (B2-A2) transition temperature are accurately predicted, for all the concentrations considered. A strong dependency of the chemical transition temperature on the magnetic configuration is evidenced and analyzed. We also suggest a more important effect of magnetic rather than vibrational entropy on the chemical transition. However, this transition is not affected by a commonly accessible external magnetic field. ",
        " Superconductivity, magnetic order, and quadrupolar order have been investigated in the filled skutterudite system Pr_{1-x}Nd_{x}Os_4Sb_{12} as a function of composition x in magnetic fields up to 9 tesla and at temperatures between 50 mK and 10 K. Electrical resistivity measurements indicate that the high field ordered phase (HFOP), which has been identified with antiferroquadruoplar order, persists to x sim 0.5. The superconducting critical temperature T_c of PrOs_4Sb_{12} is depressed linearly with Nd concentration to x sim 0.55, whereas the Curie temperature T_{FM} of NdOs_4Sb_{12} is depressed linearly with Pr composition to (1-x) sim 0.45. In the superconducting region, the upper critical field H_{c2}(x,0) is depressed quadratically with x in the range 0 < x lesssim 0.3, exhibits a kink at x approx 0.3, and then decreases linearly with x in the range 0.3 lesssim x lesssim 0.6. The behavior of H_{c2}(x,0) appears to be due to pair breaking caused by the applied magnetic field and the exhange field associated with the polarization of the Nd magnetic moments, in the superconducting state. From magnetic susceptibility measurements, the correlations between the Nd moments in the superconducting state appear to change from ferromagnetic in the range 0.3 lesssim x lesssim 0.6 to antiferromagnetic in the range 0 < x lesssim 0.3. Specific heat measurements on a sample with x = 0.45 indicate that magnetic order occurs in the superconducting state, as is also inferred from the depression of H_{c2}(x,0) with x. ",
        " The recent discovery of two heavy fermion materials PuCoGa_{5} and NpPd_{5}Al_{2} which transform directly from Curie paramagnets into superconductors, reveals a new class of superconductor where local moments quench directly into a superconducting condensate. A powerful tool in the description of heavy fermion metals is the large N expansion, which expands the physics in powers of 1/N about a solvable limit where particles carry a large number (N) of spin components. As it stands, this method is unable to jointly describe the spin quenching and superconductivity which develop in PuCoGa_{5} and NpPd_{5}Al_{2}. Here, we solve this problem with a new class of large N expansion that employs the symplectic symmetry of spin to protect the odd time-reversal parity of spin and sustain Cooper pairs as well-defined singlets. With this method we show that when a lattice of magnetic ions exchange spin with their metallic environment in two distinct symmetry channels, they are able to simultaneously satisfy both channels by forming a condensate of composite pairs between between local moments and electrons. In the tetragonal crystalline environment relevant to PuCoGa_{5} and NpPd_{5}Al_{2} the lattice structure selects a natural pair of spin exchange channels, giving rise to the prediction of a unique anisotropic paired state with g-wave symmetry. This pairing mechanism predicts a large upturn in the NMR relaxation rate above T_{c}, a strong enhancement of Andreev reflection in tunneling measurements and an enhanced superconducting transition temperature T_{c} in Pu doped Np_{1-x}Pu_{x}Pd_{5}Al_{2}. ",
        " Based on DFT and Berry curvature calculations, we predict that quantum anomalous hall effect (QAHE) can be realized in two dimensional anti-ferromagnetic (AFM) NiRuCl6 with zero net magnetic moment. By tuning spin-orbits coupling (SOC), we find that the topological properties of NiRuCl6 come from its energy band reversal. The results indicate that NiRuCl6 behaves as AFM Chern insulator and its spin-polarized electronic structure and strong spin-orbits coupling (SOC) are the origin of QAHE. Considering the compatibility between AFM and insulator, AFM Chern insulator is more suitable to realize high temperature QAHE because generally Neel temperature of AFM systems is more easily improved than Curie temperature of ferromagnetic (FM) systems. Due to the different magnetic coupling mechanism between FM and AFM Chern insulator, AFM Chern insulator provides a new way to archive high temperature QAHE in experiments. ",
        " The pressure-temperature phase diagram of the orthorhombic ferromagnetic superconductor UCoGe was determined by resistivity measurements up to 10.5~GPa. The Curie temperature T_C is suppressed with pressure and vanishes at the critical pressure p_capprox1~GPa. Superconductivity is observed in both the ferromagnetic state at low pressure, and in the paramagnetic state above p_c up to about 4~GPa. Non-Fermi liquid behavior appears in a large pressure range. The resistivity varies linearly with temperature around p_c and evolves continuously with pressure to a T^2 Fermi-liquid behavior for p gtrapprox 5~GPa. The residual resistivity as a function of pressure shows a maximum far above p_c at p^star=7.2~GPa and the amplitude of the inelastic scattering term of the resistivity decreases by more than one order in magnitude at p^star, which appears to mark the entrance into a weakly correlated regime. The pressure dependence of the upper critical field for magnetic field applied along the b and c axis illustrates the drastic difference in the field dependence of the ferromagnetic superconducting pairing. While for Hparallel b axis H_{c2}(T) is driven by the suppression of the ferromagnetic order, it is dominated by the strong initial suppression of the ferromagnetic fluctuations for a field applied in the easy magnetization axis c. ",
        " We report the growth, structural and magnetic properties of the less studied Eu-oxide phase, Eu_3O_4, thin films grown on a Si/SiO_2 substrate and Si/SiO_2/graphene using molecular beam epitaxy. The X-ray diffraction scans show that highly-textured crystalline Eu_3O_4(001) films are grown on both substrates, whereas the film deposited on graphene has a better crystallinity than that grown on the Si/SiO_2 substrate. The SQUID measurements show that both films have a Curie temperature of about 5.5 K, with a magnetic moment of 0.0032 emu/g at 2 K. The mixed-valency of the Eu cations has been confirmed by the qualitative analysis of the depth-profile X-ray photoelectron spectroscopy measurements with the Eu^{2+} : Eu^{3+} ratio of 28 : 72. However, surprisingly, our films show no metamagnetic behaviour as reported for the bulk and powder form. Furthermore, the Raman spectroscopy scans show that the growth of the Eu_3O_4 thin films has no damaging effect on the underlayer graphene sheet. Therefore, the graphene layer is expected to retain its properties. ",
        " The possibility of dissipationless chiral edge states without the need of an external magnetic field in the quantum anomalous Hall effect (QAHE) offers a great potential in electronic/spintronic applications. The biggest hurdle for the realization of a room-temperature magnetic Chern insulator is to find a structurally stable material with a sufficiently large energy gap and Curie temperature that can be easily implemented in electronic devices. This work based on first-principle methods shows that a single atomic layer of V2O3 with honeycomb-kagome (HK) lattice is structurally stable with a spin-polarized Dirac cone which gives rise to a room-temperature QAHE by the existence of an atomic on-site spin-orbit coupling (SOC). Moreover, by a strain and substrate study, it was found that the quantum anomalous Hall system is robust against small deformations and can be supported by a graphene substrate. ",
        " Metal trihalides (MX_3) are the most important family of 2D magnetic materials, being the chromium trihalides the most studied 2D magnets. The discovery of CrI_3, the recent obtention of CrCl_3 in-plane magnetic monolayer and the role of CrBr_3 inducing topological superconductivity in NbSe_2, may serve to showcase the active research being done in this family nowadays. Despite the high impact of these materials, most of the members in the MX_3 family are still unexplored and constitute an untapped source of interesting physical properties. Stimulated by the most recent advances in straintronics and aware of the crucial role of the dielectric screening, we present here a high throughput methodology to automatize the exploration of 2D materials. Employing this methodology, we studied the MX_3 family (M= Cr, Fe, V, Ti; X= Cl, Br, I) with the goal of advancing towards the solution of the most problematic issue in these materials, namely the Curie temperature. We use a particular case to show how this methodology allows us to obtain a complete description of the magnetic interaction picture (J_{iso}, J_{xx}, J_{yy}, J_{zz}) up to third neighbors condensed in a single effective equation per parameter, describing magnetic interaction in terms of the strain and the Hubbard U parameter. Additionally, and because of the important role of the Hubbard U in MX_3 materials, we provide a library of self-consistent calculated Hubbard U for the principal pseudopotential families. The work presented herein advances in the description of the still unexplored MX_3 materials, opening the door to a rational design of 2D magnetic materials. ",
        " This work focuses on the microstructure, magnetic properties and magnetocaloric effect of CoFe_2O_4 (CFO) nanoparticles elaborated by sol-gel auto combustion method. The XRD investigation indicates that CFO is crystallized in a cubic spinel structure and the SEM micrograph shows a fine quasi-spherical with an average grain sizes of 160 nm. The temperature dependence of the Raman spectra reveals the ferromagnetic to paramagnetic (FM-PM) transition started from 723 K and the magnetization versus temperature measurements shows the Curie temperature located at T_{rm C} = 785 K. Large value of magnetocaloric temperature change of DeltaT =11.2 K with a high RCP of 687.56 J Kg^{-1} are achieved indirectly via the Maxwell approach making our CFO nanopowder suitable candidate for both environmentally friendly magnetic refrigeration and medical applications at ambient temperature. ",
        " We propose a model for non isothermal ferromagnetic phase transition based on a phase field approach, in which the phase parameter is related but not identified with the magnetization. The magnetization is split in a paramagnetic and in a ferromagnetic contribution, dependent on a scalar phase parameter and identically null above the Curie temperature. The dynamics of the magnetization below the Curie temperature is governed by the order parameter evolution equation and by a Landau-Lifshitz type equation for the magnetization vector. In the simple situation of a uniaxial magnet it is shown how the order parameter dynamics reproduces the hysteresis effect of the magnetization. ",
        " Structural and magnetic properties of the CoMn_{0.88}Cu_{0.12}Ge compound have been investigated using X-ray diffraction (XRD) and differential scanning calorimetry (DSC) accompanied with investigation of magnetic properties under applied hydrostatic pressure up to 12 kbar. It has been found that the orthorhombic crystal structure of the TiNiSi-type, which is dominant at low temperatures, turns into the hexagonal Ni_2In-type one, slightly above 200 K. The structural transition is of the first-order type as confirmed by presence of distinct thermal hysteresis exceeding 20 K. The ac magnetic measurements indicate a ferromagnetic order below the Curie temperature T_C of 238 K, followed by additional anomaly at lower temperatures - the latter one being related to the structural transition. Application of hydrostatic pressure leads to temperature separation of the purely magnetic transition, whose Curie temperature T_C slowly increases with applied pressure, and the magnetostructural transition characterized by critical temperature showing much rapid decrease with increasing pressure. Comparison of the DSC data for the investigated compound and the isostructural CoMn_{0.95}Cu_{0.05}Ge one has made it possible to determine both the structural and magnetic components of entropy change. ",
        " Ferromagnetic shape memory alloys Ni_{2+x}Mn_{1-x}Ga were studied in the range of compositions 0.16 le x le 0.36. Experimental phase diagram, constructed from differential scanning calorimetry, transport and magnetic measurements, exhibits distinctive feature in a compositional interval 0.18 le x le 0.27, where martensitic and magnetic transitions merge in a first-order magnetostructural phase transition ferromagnetic martensite leftrightarrow paramagnetic austenite. Observed in this interval of compositions a non-monotonous behavior of the magnetostructural phase transition temperature was ascribed to the difference in the exchange interactions of martensitic and austenitic phase and to the competition between increasing number of valence electron and progressive dilution of the magnetic subsystem which occur in the presence of a strong magnetoelastic interaction. Based on the experimental phase diagram, the difference between Curie temperature of martensite T_C^M and Curie temperature of austenite T_C^A was estimated. Influence of volume magnetostriction was considered in theoretical modeling in order to account for the existence of the magnetostructural phase transition over a wide range of compositions. ",
        " We report intrinsic ferromagnetism in monolayer electrides or electrenes, in which excess electrons act as anions. Our first-principles calculations demonstrate that magnetism in such electron-rich two-dimensional (2D) materials originates from the anionic electrons rather than partially filled d orbitals, which is fundamentally different from ferromagnetism found in other 2D intrinsic magnetic materials. Taking the honeycomb LaBr_2 (La^{3+}Br^{-}_{2}cdot e^{-}) as an example, our calculations reveal that the excess electron is localized at the center of the hexagon, which leads to strong Stoner-instability of the associated states at the Fermi energy, resulting in spontaneous magnetization and formation of a local moment. The overlap of extended tails of the wave functions of these electrons mediates a long-range ferromagnetic interaction, contributing to a Curie temperature (T_textrm{c}) of 235 K and a coercive field (H_textrm{c}) of 0.53 T, which can be further enhanced by hole doping. The dual nature, localization and extension, of the electronic states suggests a unique mechanism in such magnetic-element-free electrenes as intrinsic 2D ferromagnets. ",
        " In the paper a self-consistent theoretical description of the lattice and magnetic properties of a model system with magnetoelastic interaction is presented. The dependence of magnetic exchange integrals on the distance between interacting spins is assumed, which couples the magnetic and the lattice subsystem. The framework is based on summation of the Gibbs free energies for the lattice subsystem and magnetic subsystem. On the basis of minimization principle for the Gibbs energy, a set of equations of state for the system is derived. These equations of state combine the parameters describing the elastic properties (relative volume deformation) and the magnetic properties (magnetization changes). The formalism is extensively illustrated with the numerical calculations performed for a system of ferromagnetically coupled spins S=1/2 localized at the sites of simple cubic lattice. In particular, the significant influence of the magnetic subsystem on the elastic properties is demonstrated. It manifests itself in significant modification of such quantities as the relative volume deformation, thermal expansion coefficient or isothermal compressibility, in particular, in the vicinity of the magnetic phase transition. On the other hand, the influence of lattice subsystem on the magnetic one is also evident. It takes, for example, the form of dependence of the critical (Curie) temperature and magnetization itself on the external pressure, which is thoroughly investigated. ",
        " GeTe is a well-known ferroelectric and thermoelectric material that undergoes a structural phase transition from a rhombohedral to the rocksalt structure at sim 600-700 K. We present a first principles approach to calculate the thermal expansion of GeTe in the rhombohedral phase up to the Curie temperature. We find the minimum of the Helmholtz free energy with respect to each structural parameter in a manner similar to the traditional Gr{\"u}neisen theory, and account for the temperature dependence of elastic constants. We obtain the temperature variation of the structural parameters of rhombohedral GeTe in very good agreement with experiments. In particular, we correctly reproduce a negative volumetric thermal expansion of GeTe near the phase transition. We show that the negative thermal expansion is induced by the coupling between acoustic and soft transverse optical phonons, which is also responsible for the low lattice thermal conductivity of GeTe. ",
        " We report on the growth of epitaxial bilayers of the La2/3Sr1/3MnO3 (LSMO) half-metallic ferromagnet and the BiFeO3 (BFO) multiferroic, on SrTiO3(001) by pulsed laser deposition. The growth mode of both layers is two-dimensional, which results in unit-cell smooth surfaces. We show that both materials keep their properties inside the heterostructures, i.e. the LSMO layer (11 nm thick) is ferromagnetic with a Curie temperature of ~330K, while the BFO films shows ferroelectricity down to very low thicknesses (5 nm). Conductive-tip atomic force microscope mappings of BFO/LSMO bilayers for different BFO thicknesses reveal a high and homogeneous resistive state for the BFO film that can thus be used as a ferroelectric tunnel barrier in tunnel junctions based on a half-metal. ",
        " The one- and two-orbital double-exchange models for manganites are studied using Monte Carlo computational techniques in the presence of a robust electron-phonon coupling (but neglecting the antiferromagnetic exchange J_{rm AF} between the localized spins). The focus in this effort is on the analysis of charge transport. Our results for the one-orbital case confirm and extend previous recent investigations that showed the presence of robust peaks in the resistivity vs. temperature curves for this model. Quenched disorder substantially enhances the magnitude of the effect, while magnetic fields drastically reduce the resistivity. A simple picture for the origin of these results is presented. It is also shown that even for the case of just one electron, the resistance curves present metallic and insulating regions by varying the temperature, as it occurs at finite electronic density. Moreover, in the present study these investigations are extended to the more realistic two-orbital model for manganites. The transport results for this model show large peaks in the resistivity vs. temperature curves, located at approximately the Curie temperature, and with associated large magnetoresistance factors. Overall, the magnitude and shape of the effects discussed here closely resemble experiments for materials such as rm La_{0.70} Ca_{0.30} Mn O_{3}, and they are in qualitative agreement with the current predominant theoretical view that competition between a metal and an insulator, enhanced by quenched disorder, is crucial to understand the colossal magnetoresistance (CMR) phenomenon. ",
        " Single crystals of AlFe_{2}B_{2} have been grown using the self flux growth method and then measured the structural properties, temperature and field dependent magnetization, and temperature dependent electrical resistivity at ambient as well as high pressure. The Curie temperature of AlFe_{2}B_{2} is determined to be 274~K. The measured saturation magnetization and the effective moment for paramagnetic Fe-ion indicate the itinerant nature of the magnetism with a Rhode-Wohlfarth ratio frac{M_{C}}{M_{sat}}approx 1.14. Temperature dependent resistivity measurements under hydrostatic pressure shows that transition temperature textit{T_C} is suppressed down to 255 K for p = 2.24~GPa pressure with a suppression rate of sim -8.9~K/GPa. The anisotropy fields and magnetocrystalline anisotropy constants are in reasonable agreement with density functional theory calculations. ",
        " We have investigated the role of transition metal impurities and oxygen vacancies in the formation of ferromagnetism in Co-doped TiO2 using LSDA+U approach which takes into account strong on-cite Coulomb correlations for electronic structure calculations. Several model systems such as supercells of rutile TiO2 with Co{+2} ion in high-spin state substituted into titanium cite and with oxygen vacancies were considered. We found that exchange interaction of Co magnetic ions is ferromagnetic, but very weak due to the large average impurity-impurity distance. However, its strength becomes three times stronger when there is a magnetic vacancy nearby. The magnetic moment values are 3mu_B for Co{2+} and 1mu_B for vacancy with the opposite directions of them. Our investigation showed that exchange interaction energy of Co and vacancy moments varies from 330meV to 40meV depending on the distance between them in the supercell. We suppose that strong interaction between Co and vacancy moments should be taken into account for the explanation of high Curie temperature value in Co-doped TiO2. ",
        " By density functional theory calculations, we predict a stable two-dimensional (2D) ferromagnetic semiconductor Cr_2Ge_2Se_6, where the Curie temperature T_c can be dramatically enhanced beyond room temperature by applying a few percent strain. In addition, the anomalous Hall conductivity in 2D Cr_2Ge_2Se_6 and Cr_2Ge_2Te_6 is predicted to be comparable to that in ferromagnetic metals of Fe and Ni, and is an order of magnitude larger than that in diluted magnetic semiconductor Ga(Mn,As). Based on superexchange interactions, the enhanced T_c in 2D Cr_2Ge_2Se_6 by strain can be understood by the decreased energy difference between 3d orbitals of Cr and 4p orbitals of Se. Our finding highlights the microscopic mechanism to obtain the room temperature ferromagnetic semiconductors by strain. ",
        " Quantum Heisenberg spin chains with random couplings and spin sizes are studied using a real-space renormalization group technique. These systems belong to a new universality class of disordered quantum spin systems realized in {it e.g.} {rm Sr}_3{rm CuPt}_{1-x}{rm Ir}_x {rm O}_6. The low-energy fixed point is characterized by the formation of weakly coupled large effective spins. At low temperature T the entropy obeys a power law T^delta (deltaapprox0.44), and the susceptibility follows a Curie-like behavior. ",
        " Spin-crossover compounds, which are characterized by magnetic ions showing low-spin and high-spin states at thermally accessible energies, are ubiquitous in nature. We here focus on the effect of an exchange interaction on the collective properties for the case of non-magnetic low-spin ions, which applies to Fe(II) compounds. Monte Carlo simulations are used to study a three-dimensional spin-crossover model for the full parameter range from essentially pure high spin to essentially pure low spin. We find that as the low-spin state becomes more favorable, the Curie temperature drops, the universality class deviates from the three-dimensional Heisenberg class, and the transition eventually changes to first order. A heat-bath algorithm that grows or shrinks low-spin and high-spin domains is developed to handle the first-order transition. When the ground state has low spin, a reentrant magnetic transition is found in a broad parameter range. We also observe a percolation transition of the high spins, which branches off the first-order magnetic transition. ",
        " Metallic Mn-based alloys with a nearest-neighbor Mn-Mn distance greater than 0.4 nm exhibit large, well-localized magnetic moments. Here we investigate the magnetism of tetragonal Au4Mn with a Curie temperature of 385 K, where manganese has a spin moment of 4.1 muB and its orbital moment is quenched. Since 80% of the atoms are gold, the spin orbit interaction is strong and Au4Mn exhibits uniaxial magnetocrystalline anisotropy with surface maze domains at room temperature. The magnetic hardness parameter of 1.0 is sufficient to maintain the magnetization along the c-axis for a sample of any shape. Au also reduces the spin moment of Mn through 5d-3d orbital hybridization. An induced moment of 0.05 muB was found on Au under a pulsed field of 40 T. Density functional theory calculations indicate that the Mn-Mn exchange is mediated by spin-polarized gold 5d and 6p electrons. The distance-dependence shows that it is ferromagnetic or zero for the first ten shells of Mn neighbors out to 1.041 nm (64 atoms), and very weak and oscillatory thereafter. ",
        " We investigate the influence of a well-defined reversible biaxial strain <=0.12 % on the magnetization (M) of epitaxial ferromagnetic manganite films. M has been recorded depending on temperature, strain and magnetic field in 20 - 50 nm thick films. This is accomplished by reversibly compressing the isotropic in-plane lattice parameter of the rhombohedral piezoelectric 0.72PMN-0.28PT (001) substrates by application of an electric field E <= 12 kV cm-1. The magnitude of the total variable in-plane strain has been derived. Strain-induced shifts of the ferromagnetic Curie temperature (Tc) of up to 19 K were found in La0.7Sr0.3MnO3 (LSMO) and La0.7Ca0.3MnO3 films and are quantitatively analysed for LSMO within a cubic model. The observed large magnetoelectric coupling coefficient alpha=mu0 dM/dE <= 6 10-8 s m-1 at ambient temperature results from the strain-induced M change in the magnetic-film-ferroelectric-substrate system. It corresponds to an enhancement of mu0 DeltaM <= 19 mT upon biaxial compression of 0.1 %. The extraordinary large alpha originates from the combination of three crucial properties: (i) the strong strain dependence of M in the ferromagnetic manganites, (ii) large piezo-strain of the PMN-PT substrates and (iii) effective elastic coupling at the film-substrate interface. ",
        " Ion implantation of Mn ions into hole-doped GaP has been used to induce ferromagnetic behavior above room temperature for optimized Mn concentrations near 3 at.%. The magnetism is suppressed when the Mn dose is increased or decreased away from the 3 at.% value, or when n-type GaP substrates are used. At low temperatures the saturated moment is on the order of one Bohr magneton, and the spin wave stiffness inferred from the Bloch-law T^3/2 dependence of the magnetization provides an estimate Tc = 385K of the Curie temperature that exceeds the experimental value, Tc = 270K. The presence of ferromagnetic clusters and hysteresis to temperatures of at least 330K is attributed to disorder and proximity to a metal-insulating transition. ",
        " A new disordered atom configuration in Fe2CrGa alloy has been created by ball-milling method. This leads to a significant enhancement of the magnetic moment up to 3.2~3.9 {mu}B and an increase of Curie temperature by about 200 K, compared with the arc-melt samples. Combination of first-principles calculations and experimental results reveals that Fe2CrGa alloy should crystallize in Hg2CuTi based structure with different atomic disorders for the samples prepared by different methods. It is addressed that magnetic interactions play a crucial role for the system to adopt such an atomic configuration which disobeys the empirical rule. ",
        " We propose a method to realize diluted magnetic semiconductors (DMS) with p- and n-type carriers by choosing host semiconductors with a narrow band gap. By employing a combination of the density function theory and quantum Monte Carlo simulation, we demonstrate such semiconductors using Mn-doped BaZn2As2, which has a band gap of 0.2 eV. In addition, we found a new non-toxic DMS Mn-doped BaZn2Sb2, of which the Curie temperature Tc is predicted to be higher than that of Mn-doped BaZn2As2, the Tc of which was up to 230 K in the recent experiment. ",
        " At the interface of an s-wave superconductor and a three-dimensional topological insulator, Ma- jorana zero modes and Majorana helical states have been proposed to exist respectively around magnetic vortices and geometrical edges. Here we first show that a single magnetic impurity at such an interface splits each resonance state of a given spin channel outside the superconducting gap, and also induces two new symmetric impurity states inside the gap. Next we find that an increase in the superconducting gap suppresses both the oscillation magnitude and period of the RKKY inter- action between two interface magnetic impurities mediated by BCS quasi-particles. Within a mean field approximation, the ferromagnetic Curie temperature is found to be essentially independent of the superconducting gap, an intriguing phenomenon due to a compensation effect between the short-range ferromagnetic and long-range anti-ferromagnetic interactions. The existence of persis- tent ferromagnetism at the interface allows realization of a novel topological phase transition from a non-chiral to a chiral superconducting state at sufficiently low temperatures, providing a new platform for topological quantum computation. ",
        " MnAs has been grown by means of MBE on the GaN(0001)-(1x1) surface. Two options of initiating the crystal growth were applied: (a) a regular MBE procedure (manganese and arsenic were delivered simultaneously) and (b) subsequent deposition of manganese and arsenic layers. It was shown that spontaneous formation of MnAs dots with the surface density of 1cdot 10^{11} cm^{-2} and 2.5cdot 10^{11} cm^{-2}, respectively (as observed by AFM), occurred for the layer thickness higher than 5 ML. Electronic structure of the MnAs/GaN systems was studied by resonant photoemission spectroscopy. That led to determination of the Mn 3d - related contribution to the total density of states (DOS) distribution of MnAs. It has been proven that the electronic structures of the MnAs dots grown by the two procedures differ markedly. One corresponds to metallic, ferromagnetic NiAs-type MnAs, the other is similar to that reported for half-metallic zinc-blende MnAs. Both system behave superparamagnetically (as revealed by magnetization measurements), but with both the blocking temperatures and the intra-dot Curie temperatures substantially different. The intra-dot Curie temperature is about 260 K for the former system while markedly higher than room temperature for the latter one. Relations between growth process, electronic structure and other properties of the studied systems are discussed. Possible mechanisms of half-metallic MnAs formation on GaN are considered. ",
        " It was shown, that there are 48 magnetic point groups of the Bloch lines including 22 (11 time-invariant and 11 time-noninvariant) enantimorphic and 26 non-enantiomorphic groups. The Bloch lines with the time-noninvariant enantiomorphism have identical types (parities) of the magnetization and polarization dependences. The soliton like Bloch lines are derived from the symmetry classification. The tip electrode method of the creation of these Bloch lines is suggested for the potential applications in the magnetoelectric memory devices. The method of the experimental determination of the flexomagnetoelectric properties of the Bloch lines carried by the Bloch domain walls has been suggested. New type of the flexomagnetoelectric coupling, determined by the spatial derivatives of the electric polarization can be found in the vicinity of the Curie temperature or compensation point of the ferrimagnets. The multiple states Bloch line based magnetoelectric/multiferroic memory is proposed. It can be considered as a concept of the magnetoelectric enhancement of existing Bloch line memory invention. ",
        " The evolution of the magnetic and charge transport properties of itinerant magnetic metal MnSi with the substitution of Al and Ga on the Si site is investigated. We observe an increase in unit cell volume indicating that both Al and Ga substitutions create negative chemical pressure. There are substantial increases in the Curie temperature and the ordered moment demonstrating that the substitutions give the magnetism a more local character. The substitutions also increase the range of temperature and field where the skyrmion phase is stable due to a change in the character of the magnetism. In contrast to the behavior of pure MnSi and expectations for the intrinsic anomalous Hall effect, we find a significant temperature dependence to the magnitude and sign of anomalous Hall conductivity constant in Al or Ga substituted samples. This temperature dependence likely reflects changes in the spin-orbit coupling strength with temperature, which may have significant consequences on the helical and skyrmion states. Overall, we observe a continuous evolution of magnetic and charge transport properties through positive to negative pressure ",
        " Off-stoichiometric Ni_2MnIn Heusler alloys have drawn recent attention due to their large magnetocaloric entropy change associated with the first-order magneto-structural transition. Here we present crystal structural, calorimetric and magnetic studies of three compositions. Temperature-dependent X-ray diffraction shows clear structural transition from a 6M modulated monoclinic to a L2_1 cubic. A significant enhancement of relative cooling power (RCP) was achieved by tuning the magnetic and structural stability through minor compositional changes, with the measured results quantitatively close to the prediction as a function of the ratio between the martensitic transition (T_m) temperature and austenite Curie temperature (T_C) although the maximal magnetic induced entropy change (Delta S_{max}) reduction is observed in the same time. The results provided an evaluation guideline of RCPs as well as magnetic-induced entropy change in designing practical active materials. ",
        " Based on the first-principles calculations, we investigated the ferroelectric properties of two-dimensional (2D) Group-IV tellurides XTe (X=Si, Ge and Sn), with a focus on GeTe. 2D Group-IV tellurides energetically prefer an orthorhombic phase with a hinge-like structure and an in-plane spontaneous polarization. The intrinsic Curie temperature Tc of monolayer GeTe is as high as 570 K and can be raised quickly by applying a tensile strain. An out-of-plane electric field can effectively decrease the coercive field for the reversal of polarization, extending its potential for regulating the polarization switching kinetics. Moreover, for bilayer GeTe the ferroelectric phase is still the ground state. Combined with these advantages, 2D GeTe is a promising candidate material for practical integrated ferroelectric applications. ",
        " On the basis of the concept of the growing role of nonadiabatic effects of the non-conservation of the quantum number K, a theory has been developed of the phenomenon which has been given the name of backbending. Above the transition point, for Jgeq J_c, all the values -Jleq Kleq J are equally probable. An investigation is made of the singularities possessed by the ordering parameter (proportional to the spectroscopic quadrupole moment of a nonspherical nucleus), the rotational angular velocity and the moment of inertia of a nucleus at the Curie point. Formulas have been derived for the intensity of quadrupole radiation in the more symmetric n-phase J> J_c. By analyzing the experimental values of the moments of inertia belonging to the n-phase, the radius of the mass distribution in the nucleus was determined. It agrees with the radius of the proton distribution derived from data on the scattering of electrons by nuclei. On the basis of the simplest form of the singularity of the parametric derivative of the Hamiltonian of the system a general theory of zero-temperature second-order phase transitions is developed in the Appendix. ",
        " Various strategies to implement efficiently QMC simulations for large chemical systems are presented. These include: i.) the introduction of an efficient algorithm to calculate the computationally expensive Slater matrices. This novel scheme is based on the use of the highly localized character of atomic Gaussian basis functions (not the molecular orbitals as usually done), ii.) the possibility of keeping the memory footprint minimal, iii.) the important enhancement of single-core performance when efficient optimization tools are employed, and iv.) the definition of a universal, dynamic, fault-tolerant, and load-balanced computational framework adapted to all kinds of computational platforms (massively parallel machines, clusters, or distributed grids). These strategies have been implemented in the QMC=Chem code developed at Toulouse and illustrated with numerical applications on small peptides of increasing sizes (158, 434, 1056 and 1731 electrons). Using 10k-80k computing cores of the Curie machine (GENCI-TGCC-CEA, France) QMC=Chem has been shown to be capable of running at the petascale level, thus demonstrating that for this machine a large part of the peak performance can be achieved. Implementation of large-scale QMC simulations for future exascale platforms with a comparable level of efficiency is expected to be feasible. ",
        " We have performed a detailed study of thermal annealing of the moment configuration in artificial spin ice. Permalloy (Ni_{80}Fe_{20}) artificial spin ice samples were examined in the prototypical square ice geometry, studying annealing as a function of island thickness, island shape, and annealing temperature and duration. We also measured the Curie temperature as a function of film thickness, finding that thickness has a strong effect on the Curie temperature in regimes of relevance to many studies of the dynamics of artificial spin ice systems. Increasing the interaction energy between island moments and reducing the energy barrier to flipping the island moments allows the system to more closely approach the collective low energy state of the moments upon annealing, suggesting new channels for understanding the thermalization processes in these important model systems. ",
        " Searching for room temperature ferromagnetic semiconductors has evolved into a broad field of material science and spintronics for decades, nevertheless, these novel states remain rare. Phosphorene, a monolayer black phosphorus with a puckered honeycomb lattice structure possessing a finite band gap and high carrier mobility, has been synthesized recently. Here we show, by means of two different large scale quantum Monte-Carlo methods, that relatively weak interactions can lead to remarkable edge magnetism in the phosphorene nanoribbons. The ground state constrained path quantum Monte-Carlo simulations reveal strong ferromagnetic correlations along the zigzag edges, and the finite temperature determinant quantum Monte-Carlo calculations show a high Curie temperature up to room temperature. ",
        " The magnetic state of Nitrogen-doped MgO, with N substituting O at concentrations between 1% and the concentrated limit, is calculated with density-functional methods. The N atoms are found to be magnetic with a moment of 1 Bohr magneton per Nitrogen atom and to interact ferromagnetically via the double exchange mechanism. The long-range magnetic order is established above a finite concentration of about 1.5% when the percolation threshold is reached. The Curie temperature increases linearly with the concentration, and is found to be about 30 K for 10% concentration. Besides the substitution of single Nitrogen atoms, also interstitial Nitrogen atoms, clusters of Nitrogen atoms and their structural relaxation on the magnetism are discussed. Possible scenarios of engineering a higher Curie temperature are analyzed, with the conclusion that an increase of the Curie temperature is difficult to achieve, requiring a particular attention to the choice of chemistry. ",
        " Carrier-independent ferromagnetism of chromium doped topological insulator Bi_xSb_{2-x}Te_3 thin films,which cannot be explained by current theory of dilute magnetic semiconductor, has been reported recently. To study if it is related to the distinctive surface state of topological insulator, we studied the structural, magnetic and transport characters of Cr_{0.2}Bi_xSb_{1.8-x}Te_3 single crystals. The Curie temperature T_c, which is determined from magnetization and anomalous Hall effect measurements by Arrott plots, is found to be proportional to p^{1/3}, where p is the hole density. This fact supports a scenario of RKKY interaction with mean-field approximation. This carrier density dependent nature enables tuning and controlling of the magnetic properties by applying a gate voltage in the future science researches and spintronics applications. ",
        " The enigma of the emergent ferromagnetic state in tensile-strained LaCoO3 thin films remains to be explored because of the lack of a well agreed explanation. The direct magnetic imaging technique using a low-temperature magnetic force microscope (MFM) is critical to reveal new aspects of the ferromagnetism by investigating the lateral magnetic phase distribution. Here we show the experimental demonstration of the rare halved occupation of the ferromagnetic state in tensile-strained LaCoO3 thin films on SrTiO3 substrates using the MFM. The films have uniformly strained lattice structure and minimal oxygen vacancies (less than 2%) beyond the measurement limit. It is found that percolated ferromagnetic regions with typical sizes between 100 nm and 200 nm occupy about 50% of the entire film, even down to the lowest achievable temperature of 4.5 K and up to the largest magnetic field of 13.4 T. Preformed ferromagnetic droplets were still observed when the temperature is 20 K above the Curie temperature indicating the existence of possible Griffiths phase. Our study demonstrated a sub-micron level phase separation in high quality LaCoO3 thin films, which has substantial implications in revealing the intrinsic nature of the emergent ferromagnetism. ",
        " Ultrasound velocity measurements of magnesium chromite spinel MgCr_2O_4 reveal elastic anomalies in the paramagnetic phase that are characterized as due to geometrical frustration. The temperature dependence of the tetragonal shear modulus (C_{11}-C_{12})/2 exhibits huge Curie-type softening, which should be the precursor to spin Jahn-Teller distortion in the antiferromagnetic phase. The trigonal shear modulus C_{44} exhibits nonmonotonic temperature dependence with a characteristic minimum at sim50 K, indicating a coupling of the lattice to dynamical molecular spin state. These results strongly suggest the coexistence of dynamical spin Jahn-Teller effect and dynamical molecular spin state in the paramagnetic phase, which is compatible with the coexistence of magnetostructural order and dynamical molecular spin state in the antiferromagnetic phase. ",
        " Although progress with twisted graphene nano-devices is boosting the superconductivity that is the consequence of their Moir'e flat electronic bands, the immense choice for future development is an obstacle for their optimisation. We report here that soft-chemistry deintercalation of KC_8 breaks down graphite stacking generating a strong disorder that includes stacking twists and variable local doping. We obtain a bulk graphite whose individual crystallites have different stackings with arbitrary twists and doping, scanning in the same sample a huge number of stacking configurations. We perform magnetisation measurements on batches with different synthesis conditions. The disorder weakens the huge diamagnetism of graphite, revealing several phase transitions. A \"ferromagnetic-like\" magnetisation appears with Curie temperatures T_0sim450K, that has to be subtracted from the measured magnetisation. Depending on sample synthesis, anomalies towards diamagnetic states appear at T_csim110K (3 samples), sim240K (4 samples), sim320K (2 samples). Electrical resistivity measurements yield anomalies for the T_csim240K transition, with one sample showing a 90% drop. We discuss the possibility that these (diamagnetic and resistitive) anomalies could be due to superconductivity. ",
        " The crystal structure and magnetic properties of MnCoxFe1-xSi (x=0-0.5) compounds were investigated. With increasing Fe content, the unit cell changes anisotropically and the magnetic property evolves gradually: Curie temperature decreases continuously, the first-order metamagnetic transition from a low-temperature helical antiferromagnetic state to a high-temperature ferromagnetic state disappears gradually and then a spin-glass-like state and another antiferromagnetic state emerge in the low temperature region. The Curie transition leads to a moderate conventional entropy change. The metamagnetic transition not only yields a larger negative magnetocaloric effect at lower applied fields than in MnCoSi but also produces a very large temperature span (103 K for H=5 T) of delta S(T), which results in a large refrigerant capacity. These phenomena were explained in terms of crystal structure change and magnetoelastic coupling mechanism. The low-cost MnCo1-xFexSi compounds are promising candidates for near room temperature magnetic refrigeration applications because of the large isothermal entropy change and the wide working temperature span. ",
        " The microscopic magnetic properties of high-quality GdN thin films have been investigated by electron spin resonance (ESR) and ferromagnetic resonance (FMR) measurements. Detailed temperature dependence ESR measurements have shown the existence of two ferromagnetic components at lower temperatures which was not clear from the previous magnetization measurements. The temperature, where the resonance shift occurs for the major ferromagnetic component, seems to be consistent with the Curie temperature obtained from the previous magnetization measurement. On the other hand, the divergence of line width is observed around 57 K for the minor ferromagnetic component. The magnetic anisotropies of GdN thin films have been obtained by the analysis of FMR angular dependence observed at 4.2 K. Combining the X-ray diffraction results, the correlation between the magnetic anisotropies and the lattice constants is discussed. ",
        " We report a combined theoretical and experimental investigation of half-metallic ferromagnetism in equiatomic quaternary Heusler alloy CoRuMnSi. Room temperature XRD analysis reveals that the alloy crystallizes in L21 disorder instead of pristine Y-type structure due to 50% swap disorder between the tetrahedral sites, i.e., Co and Ru atoms. Magnetization measurements reveal a net magnetization of 4 mu_B with Curie temperature of ~780 K. Resistivity measurement reveals the presence of localization effect below 35 K while above 100 K, a linear dependence is observed. Resistivity behavior indicates the absence of single magnon scattering, which indirectly supports the half-metallic nature. The majority spin band near the Fermi level clearly indicates the overlap of flat eg bands with sharply varying conduction bands that are responsible for the localization. In-depth analysis of the projected atomic d-orbital character of band structure reveals unusual bonding, giving rise to the flat eg bands purely arising out of Ru ions. Co-Ru swap disorder calculations indicate the robustness of half-metallic nature, even when the structure changes from Y-type to L21-type, with no major change in the net magnetization of the system. Thus, robust half-metallic nature, stable structure, and high Curie temperature make this alloy quite a promising candidate to be used as a source of highly spin-polarized currents in spintronic applications. ",
        " Two-dimensional topological materials (TMs) have a variety of properties that make them attractive for applications including spintronics and quantum computation. However, there are only a few such experimentally known materials. To help discover new 2D TMs, we develop a unified and computationally inexpensive approach to identify magnetic and non-magnetic 2D TMs, including gapped and semi-metallic topological classifications, in a high-throughput way using density functional theory-based spin-orbit spillage, Wannier-interpolation, and related techniques. We first compute the spin-orbit spillage for the ~1000 2D materials in the JARVIS-DFT dataset (https://www.ctcms.nist.gov/~knc6/JVASP.html ), resulting in 122 materials with high-spillage values. Then, we use Wannier-interpolation to carry-out Z2, Chern-number, anomalous Hall conductivity, Curie temperature, and edge state calculations to further support the predictions. We identify various topologically non-trivial classes such as quantum spin-hall insulators (QSHI), quantum anomalous-hall insulators (QAHI), and semimetals. For a few predicted materials, we run G0W0+SOC and DFT+U calculations. We find that as we introduce many-body effects, only a few materials retain non-trivial band-topology, suggesting the importance of high-level DFT methods in predicting 2D topological materials. However, as an initial step, the automated spillage screening and Wannier-approach provide useful predictions for finding new topological materials and to narrow down candidates for experimental synthesis and characterization. ",
        " Achieving metrological precision of quantum anomalous Hall resistance quantization at zero magnetic field so far remains limited to temperatures of the order of 20 mK, while the Curie temperature in the involved material is as high as 20 K. The reason for this discrepancy remains one of the biggest open questions surrounding the effect, and is the focus of this article. Here we show, through a careful analysis of the non-local voltages on a multi-terminal Corbino geometry, that the chiral edge channels continue to exist without applied magnetic field up to the Curie temperature of bulk ferromagnetism of the magnetic topological insulator, and that thermally activated bulk conductance is responsible for this quantization breakdown. Our results offer important insights on the nature of the topological protection of these edge channels, provide an encouraging sign for potential applications, and establish the multi-terminal Corbino geometry as a powerful tool for the study of edge channel transport in topological materials. ",
        " Ferromagnetic resonance (FMR) in magnetic multilayers of type F1/f/F2, where two strongly ferromagnetic layers F1 and F2 are separated by a weakly magnetic spacer f with a compositional gradient along its thickness, is investigated. The method allows to detect the weak signal from the spacer in additional to the more pronounced and readily measured signal from the outer strongly-magnetic layers, and thereby study the properties of the spacer as well as the interlayer exchange interaction it mediates. Variable temperature FMR measurements, especially near the relevant Curie points, reveal a rich set of properties of the exchange interactions in the system. The obtained results are useful for designing and optimizing nanostructures with thermally-controlled magnetic properties. ",
        " We present a 31P NMR study of the coupled spin 1/2 ladder compound BiCu2PO6. In the pure material, intrinsic susceptibility and dynamics show a spin gap of about . Substitution of non magnetic Zn or magnetic Ni impurity at Cu site induces a staggered magnetization which results in a broadening of the 31P NMR line, while susceptibility far from the defects is unaffected. The effect of Ni on the NMR line broadening is twice that of Zn, which is consistent with Quantum Monte Carlo (QMC) calculations assuming that Ni couples ferromagnetically to its adjacent Cu. The induced moment follows a 1/T temperature dependence due to the Curie-like development of the moment amplitude while its extension saturates and does not depend on impurity content or nature. This allow us to verify the generically expected scenario for impurity doping and to extend it to magnetic impurity case: in an antiferromagnetically correlated low dimensional spin system with antiferromagnetic correlations, any type of impurity induces a staggered moment at low temperature, whose extension is not linked to the impurity nature but to the intrinsic physics at play in the undoped pure system, from 1D to 2D systems. ",
        " Heat assisted recording is believed as a key technology in order to further increase the areal density of magnetic recording. In the work of Richter et al. [Richter et al. J. Appl. Phys. 111, 033909 (2012)] it is stated that storage densities will be limited to 15 to 20 Tbit/in2 due to thermally induced write errors. In this letter we propose a composite structure consisting of two materials with different Curie temperatures. A hard magnetic layer is on top of a high Tc soft magnetic layer. In this composite material the thermal write error is negligible up to areal densities of 50 to 100 Tbit/in2. It is shown that the effective thermal field gradient, which is reduced in this composite structure, is not relevant for a possible increase of the transition jitter. The transition jitter is dominated by a small distribution of the Curie temperature. The smallest jitter is obtained for the composite structure. ",
        " We investigate the critical relaxational dynamics of the S=1/2 Heisenberg ferromagnet on a simple cubic lattice within the Handscomb prescription on which it is a diagrammatic series expansion of the partition function that is computed by means of a Monte Carlo procedure. Using a phenomenological renormalization group analysis of graph quantities related to the spin susceptibility and order parameter, we obtain precise estimates for the critical exponents relations gamma / nu = 1.98pm 0.01 and beta /nu = 0.512 pm 0.002 and for the Curie temperature k_BT_c/J = 1.6778 pm 0.0002. The critical correlation time of both energy and susceptibility is also computed. We found that the number of Monte Carlo steps needed to generate uncorrelated diagram configurations scales with the system's volume. We estimate the efficiency of the Handscomb method comparing its ability in dealing with the critical slowing down with that of other quantum and classical Monte Carlo prescriptions. ",
        " An effective field theory is derived for the ferromagnetic transition of diffusive electrons at T=0. The static disorder which leads to diffusive electron dynamics induces an effective long-range interaction between the spins of the form 1/r^(2d-2). This leads to unusual scaling behavior at the quantum critical point, which is determined exactly. The crossover from this quantum fixed point to the classical Heisenberg fixed point should be observable in ferromagnetic materials with low Curie temperatures. ",
        " We have synthesized ferromagnetic InMnP, a member of III-Mn-V ferromagnetic semiconductor family, by Mn ion implantation and pulsed laser annealing. Clear ferromagnetic hysteresis loops and a perpendicular magnetic anisotropy are observed up to a Curie temperature of 42 K. Large values of negative magnetoresistance and magnetic circular dichroism as well as anomalous Hall effect are further evidences of a ferromagnetic order in InMnP. An effort is made to understand the transport mechanism in InMnP using the theoretical models. We find that the valence band of InP does not merge with the impurity band of the heavily doped ferromagnetic InMnP. Our results suggest that impurity band conduction is a characteristic of Mn-doped III-V semiconductors which have deep Mn-acceptor levels. ",
        " We study the geometry of infinite random Boltzmann planar maps having weight of polynomial decay of order k^{-2} for each vertex of degree k. These correspond to the dual of the discrete \"stable maps\" of Le Gall and Miermont [Scaling limits of random planar maps with large faces, Ann. Probab. 39, 1 (2011), 1-69] studied in [Budd & Curien, Geometry of infinite planar maps with high degrees, Electron. J. Probab. (to appear)] related to a symmetric Cauchy process, or alternatively to the maps obtained after taking the gasket of a critical O(2)-loop model on a random planar map. We show that these maps have a striking and uncommon geometry. In particular we prove that the volume of the ball of radius r for the graph distance has an intermediate rate of growth and scales as {e}^{sqrt{r}}. We also perform first passage percolation with exponential edge-weights and show that the volume growth for the fpp-distance scales as {e}^{r}. Finally we consider site percolation on these lattices: although percolation occurs only at p=1, we identify a phase transition at p=1/2 for the length of interfaces. On the way we also prove new estimates on random walks attracted to an asymmetric Cauchy process. ",
        " In this research paper, we investigated the structural, electronic, and magnetic features of titanium atom substituting calciumatom in rock salt structure of CaS to explore the new dilute magnetic semiconductor compounds. The calculations are carried out using the full potential linearized augmented plane wave (FP-LAPW) method based on spin-polarized density functional theory, implemented in WIEN2k code. The generalized gradient approximation and Tran-Balaha modified Becke-Johnson exchange potential. The stability of Ti doped CaS in ferromagnetic state is provided by the total energy released from the optimized structures and defect formation energies. The classical model of Heisenberg is employed to estimate Curie temperature of these compounds. It is found that the room temperature ferromagnetism is achieved at low concentrations. The studied materials exhibit half metallic ferromagnetic demeanor. The half metallic gaps (GHM) are the extremely significant factors to consider for spintronic applications. The insertion of impurity significantly decreased the value of GHM due the broadening of 3d Ti states in the gap of the minority spin. Furthermore, to evaluate the effects of the exchange splitting process, the pd exchange splitting and the exchange constants are predicted. ",
        " We report magnetic measurements up to 1200 K on multi-walled carbon nanotube mats using Quantum Design vibrating sample magnetometer. Extensive magnetic data consistently show two ferrromagnetic-like transitions at about 1000 K and 1275 K, respectively. The lower transition at about 1000 K is associated with an Fe impurity phase and its saturation magnetization is in quantitative agreement with the Fe concentration measured by an inductively coupled plasma mass spectrometer. On the other hand, the saturation magnetization for the higher transition phase (geq1.0 emu/g) is about four orders of magnitude larger than that expected from the measured concentration of Co or CoFe, which has a high enough Curie temperature to explain this high transition. We show that this transition at about 1275 K is not consistent with a magnetic proximity effect of Fe-carbon systems and ferromagnetism of any carbon-based materials or magnetic impurities but with the paramagnetic Meissner effect due to the existence of pi Josephson junctions in a granular superconductor. ",
        " BiFeO_3 is the most famous multiferroic material, but it has no strong spontaneous magnetization due to its antiferromagnetism. Here we show that giant ferroelectric polarization and strong spontaneous magnetization can be both realized in double perovskite Bi_2FeMoO_6 with R3 (#146) space group based on BiFeO_3. Our first-principles phonon spectra establishes that this multiferroic R3 phase is stable. Our systematic calculations show that it is a spin-polarized semiconductor with gap reaching to 0.54 eV and has a strong ferroelectric polarization of 85muC/cm^2. This ferroelctricity is comparable with that of BiFeO_3, but here obtained is a strong ferrimagnetism with net magnetic moment of 2mu_B per formula unit and Curie temperature of 650 K. Both ferroelectric polarization and magnetic easy axis are shown to be in pseudocubic [111] orientation. Our further analysis shows that the macroscopic spontaneous magnetization can be deterministically reversed through a three-step path by external electric field. Therefore, we believe that this Bi_2FeMoO_6 material can be used to design new multifunctional materials and achieve high-performance devices. ",
        " Dynamic magnetic susceptibility, chi, was studied in several intermetallic materials exhibiting ferromagnetic, antiferromagnetic and metamagnetic transitions. Precise measurements by using a 14 MHz tunnel diode oscillator (TDO) allow detailed insight into the field and temperature dependence of chi. In particular, local moment ferromagnets show a sharp peak in chi(T) near the Curie temperature, T_c. The peak amplitude decreases and shifts to higher temperatures with very small applied dc fields. Anisotropic measurements of CeVSb_3 show that this peak is present provided the magnetic easy axis is aligned with the excitation field. In a striking contrast, small moment, itinerant ferromagnets (i.e., ZrZn_2) show a broad maximum in chi(T) that responds differently to applied field. We believe that TDO measurements provide a very sensitive way to distinguish between local and itinerant moment magnetic orders. Local moment antiferromagnets do not show a peak at the N'eel temperature, T_N, but only a sharp decrease of chi below T_N due to the loss of spin-disorder scattering changing the penetration depth of the ac excitation field. Furthermore, we show that the TDO is capable of detecting changes in spin order as well as metamagnetic transitions. Finally, critical scaling of chi(T,H) in the vicinity of T_C is discussed in CeVSb_3 and CeAgSb_2. ",
        " Thermal control of exchange coupling between two strongly ferromagnetic layers through a weakly ferromagnetic Ni-Cu spacer and the associated magnetoresistance is investigated. The spacer, having a Curie point slightly above room temperature, can be cycled between its paramagnetic and ferromagnetic states by varying the temperature externally or using joule heating. It is shown that the giant magnetoresistance vanishes due to a strong reduction of the mean free path in the spacer at above ~30 % Ni concentration -- before the onset of ferromagnetism. Finally, a device is proposed and demonstrated which combines thermally controlled exchange coupling and large magnetoresistance by separating the switching and the read out elements. ",
        " The Young's modulus and the internal friction of amorphous Fe_{90}Zr_{10} alloy were measured near the Curie temperature using the vibrating reed technique. The modulus shows softening around T_capprox 227K and the internal friction undergoes drastic increase at T_c. It is found that both the Young's modulus and the reciprocal of internal friction are inversely proportional to the magnetic susceptibility in the paramagnetic phase. ",
        " We investigate experimentally magnetic frustration effects in thermally active artificial kagome spin ice. Starting from a paramagnetic state, the system is cooled down below the Curie temperature of the constituent material. The resulting magnetic configurations show that our arrays are locally brought into the so-called spin ice 2 phase, predicted by at-equilibrium Monte Carlo simulations and characterized by a magnetic charge crystal embedded in a disordered kagome spin lattice. However, by studying our arrays on a larger scale, we find unambiguous signature of an out-of-equilibrium physics. Comparing our findings with numerical simulations, we interpret the efficiency of our thermalization procedure in terms of kinetic pathways that the system follows upon cooling and which drive the arrays into degenerate low-energy manifolds that are hardly accessible otherwise. ",
        " We analyse possible ways of calculating magnetic exchange interactions within density functional theory plus dynamical mean-field theory (DFT+DMFT) approach in paramagnetic phase. Using the susceptibilities within the ladder DMFT approach together with the random phase approximation (RPA) result for the Heisenberg model, we obtain bilinear exchange interactions. We show that the earlier suggested result of [E. A. Stepanov, et al., Phys. Rev. Lett. 121, 037204 (2018)] corresponds to the leading order approximation in the non-local correlations. We apply the developed approach to evaluate effective magnetic parameters of iron and nickel. For iron we find in the low-temperature limit the exchange interaction J_0simeq 0.20-0.26 eV. While the lower bound allows to describe Curie temperature, the upper bound provides agreement with the experimental spin-wave stiffness, the difference between these bounds is attributed to the non-Heisenberg contributions. For nickel we obtain J_0simeq 1.2 eV in a good agreement with the experimental data for spin-wave stiffness. ",
        " Strained epitaxial growth provides the opportunity to understand the dependence of intrinsic and extrinsic properties of functional materials at frozen intermediate stages of a phase transformation. In this study, a combination of thin film experiments and first-principles calculations yields the binding energy and magnetic properties of tetragonal Fe70Pd30-xCux ferromagnetic shape memory thin films with x = 0, 3, 7 and structures ranging from bcc to beyond fcc (1.07<c/a_bct<1.57). We find that Cu enhances the quality of epitaxial growth, while spontaneous polarisation and Curie temperature are only moderately lowered as expected from our calculations. Beyond c/a_bct>1.41 the samples undergo structural relaxations through adaptive nanotwinning. For all tetragonal structures, we observe a significant increase of the magnetocrystalline anisotropy constant K1, which reaches a maximum of K1=-2.4*10^5 Jm^-3 at room temperature around c/a_bct=1.33 and is thus even larger than for binary Fe70Pd30 and the prototype Ni-Mn-Ga magnetic shape memory system. Since K1 represents the driving force for variant reorientation in magnetic shape memory systems, we conclude that Fe-Pd-Cu alloys offer a promising route towards microactuators applications with significantly improved work output. ",
        " R_2Mo_2O_7 compounds show a ferromagnetic metal-insulator spin glass transition tuned by the radius of the rare earth ion R^{3+}. We have studied Gd_2Mo_2O_7 located on the verge of the transition, by neutron diffraction on a ^{160}Gd isotopic sample, muSR and X ray diffraction using the synchrotron radiation. All measurements were done both at ambient and under applied pressure. At ambient pressure, a ferromagnetic state is observed below the Curie temperature (T_{rm C} = 70 K). The ordered magnetic moments at 1.7 K are parallel and equal to 5.7(5) mu_{rm B} and 0.8(2) mu_{rm B} for Gd and Mo, respectively. The relaxation rate measured by muSR evidences strong spin fluctuations below T_{rm C} and down to the lowest temperature (6.6 K). A spin reorientation occurs in the range 20 K<T<T_{rm C}. The ferromagnetic state is strongly unstable under pressure. T_{rm C} sharply decreases (down to 38 K at 1.3 GPa) and Bragg peaks start to coexist with mesoscopic ferromagnetic correlations. The ordered moments decrease under pressure. At 2.7 GPa long range magnetic order completely breaks down. In this spin glass state, Gd-Gd spin correlations remain ferromagnetic with a correlation length limited to the fourth neighbor, and Gd-Mo spin correlations turn to antiferromagnetic. The unique combination of three microscopic probes under pressure provides a detailed description of the magnetic transition, crucial for further theories. ",
        " We report the results of 151Eu Moessbauer effect and magnetization measurements in the Eu-doped Ca3Co2O6 and Ca3CoRhO6, which are of great current interest in the fields of spin-chain magnetism and geometrical frustration. We find that there is a pronounced increase in the line-width of the Moessbauer spectra below a certain characteristic temperature which is well-above the one at which three-diensional ordering features set in. This unusual broadening of the spectra indicates the existence of a characteristic temperature in these 'exotic' magnetic systems, attributable to the onset of incipient one-dimensional magnetic order. This is inferred from an intriguing correlation of this characteristic temperature with the paramagnetic Curie temperature (a measure of intrachain coupling strength in these cases). ",
        " We report time-resolved Kerr effect measurements of magnetization dynamics in ferromagnetic SrRuO3. We observe that the demagnetization time slows substantially at temperatures within 15K of the Curie temperature, which is ~ 150K. We analyze the data with a phenomenological model that relates the demagnetization time to the spin flip time. In agreement with our observations the model yields a demagnetization time that is inversely proportional to T-Tc. We also make a direct comparison of the spin flip rate and the Gilbert damping coefficient showing that their ratio very close to kBTc, indicating a common origin for these phenomena. ",
        " This work is concerned with thermal quantum states of Hamiltonians on spin and fermionic lattice systems with short range interactions. We provide results leading to a local definition of temperature, thereby extending the notion of \"intensivity of temperature\" to interacting quantum models. More precisely, we derive a perturbation formula for thermal states. The influence of the perturbation is exactly given in terms of a generalized covariance. For this covariance, we prove exponential clustering of correlations above a universal critical temperature that upper bounds physical critical temperatures such as the Curie temperature. As a corollary, we obtain that above the critical temperature, thermal states are stable against distant Hamiltonian perturbations. Moreover, our results imply that above the critical temperature, local expectation values can be approximated efficiently in the error and the system size. ",
        " Self - consistent temperature dependence of the average magnetization in quantum Heisenberg ferromagnet is obtained as a first approximation of perturbation theory on an inverse radius by application of the functional method for quantum ferromagnet. The experimental data are compared with the theoretical results for {bf EuO} ferromagnet. A quantitative agreement is observed between theoretical and experimental results outside interval near Curie temperature. The theory is of critical behavior in the vicinity of Curie temperature T_c. Theoretical T_c value itself is agreed with the experimental one with an accuracy of several percents. ",
        " We report the observation of a pronounced dip in the in-plane field (H//) dependence of the critical current density Jc(H) and a peak in resistance R(H) of a NbN-HoNi5 bilayer at temperatures below the magnetic ordering temperature (TCurie ~ 5.5 K) of HoNi5, which is lower than the onset temperature (~ 9 K) of superconductivity in the NbN layer. The extrema in Jc(H) and R(H) appear at fields much below the upper critical field of NbN. It is suggested that the origin of this feature is linked with the non-collinear magnetization of HoNi5 whose normal component assists in depairing of Pearl vortex-antivortex pairs in the system. A spin reorientation transition driven by the H// diminishes this normal component and consequently the excess dissipation. ",
        " We have demonstrated the deposition of EuO films on graphene by reactive molecular beam epitaxy in a special adsorption-controlled and oxygen-limited regime, which is a critical advance toward the realization of the exchange proximity interaction (EPI). It has been predicted that when the ferromagnetic insulator (FMI) EuO is brought into contact with graphene, an overlap of electronic wavefunctions at the FMI/graphene interface can induce a large spin splitting inside the graphene. Experimental realization of this effect could lead to new routes for spin manipulation, which is a necessary requirement for a functional spin transistor. Furthermore, EPI could lead to novel spintronic behavior such as controllable magnetoresistance, gate tunable exchange bias, and quantized anomalous Hall effect. However, experimentally, EuO has not yet been integrated onto graphene. Here we report the successful growth of high quality crystalline EuO on highly-oriented pyrolytic graphite (HOPG) and single-layer graphene. The epitaxial EuO layers have (001) orientation and do not induce an observable D peak (defect) in the Raman spectra. Magneto-optic measurements indicate ferromagnetism with Curie temperature of 69 K, which is the value for bulk EuO. Transport measurements on exfoliated graphene before and after EuO deposition indicate only a slight decrease in mobility. ",
        " Inducing magnetic orders in a topological insulator (TI) to break its time reversal symmetry has been predicted to reveal many exotic topological quantum phenomena. The manipulation of magnetic orders in a TI layer can play a key role in harnessing these quantum phenomena towards technological applications. Here we fabricated a thin magnetic TI film on an antiferromagnetic (AFM) insulator Cr2O3 layer and found that the magnetic moments of the magnetic TI layer and the surface spins of the Cr2O3 layers favor interfacial AFM coupling. Field cooling studies show a crossover from negative to positive exchange bias clarifying the competition between the interfacial AFM coupling energy and the Zeeman energy in the AFM insulator layer. The interfacial exchange coupling also enhances the Curie temperature of the magnetic TI layer. The unique interfacial AFM alignment in magnetic TI on AFM insulator heterostructures opens a new route toward manipulating the interplay between topological states and magnetic orders in spin-engineered heterostructures, facilitating the exploration of proof-of-concept TI-based spintronic and electronic devices with multi-functionality and low power consumption. ",
        " A heat-assisted multiferroic solid-state memory design is proposed and analysed, based on a PbNbZrSnTiO3 antiferroelectric substrate and Ni81Fe19 magnetic free layer. Information is stored as magnetisation direction in the free layer of a magnetic tunnel junction element. The bit writing process is contactless and relies on triggering thermally activated magnetisation switching of the free layer towards a strain-induced anisotropy easy axis. A stress is generated using the antiferroelectric substrate by voltage-induced antiferroelectric to ferroelectric phase change, and this is transmitted to the magnetic free layer by strain-mediated coupling. The thermally activated strain-induced magnetisation switching is analysed here using a three-dimensional, temperature-dependent magnetisation dynamics model, based on simultaneous evaluation of the stochastic Landau Lifshitz Bloch equation and heat flow equation, together with stochastic thermal fields and magnetoelastic contributions. The magnetisation switching probability is calculated as a function of stress magnitude and maximum heat pulse temperature. An operating region is identified, where magnetisation switching always occurs, with stress values ranging from 80 to 180 MPa, and maximum temperatures normalised to the Curie temperature ranging from 0.65 to 0.99. ",
        " The switching probability of magnetic elements for heat assisted recording is investigated. It is found that FePt elements with a diameter of 5 nm and a height of 10nm show, at a field of 0.5 T, thermally written in errors of 12 percent, which is significant too large for bit patterned magnetic recording. Thermally written in errors can be decreased if larger head fields are applied. However, larger fields lead to an increase the fundamental thermal jitter. This leads to a dilemma between thermally written in errors and fundamental thermal jitter. This dilemma can be partly relaxed by increasing the thickness of the FePt film up to 30nm. For realistic head fields, it is found that the fundamental thermal jitter is in the same order of magnitude of the fundamental thermal jitter in conventional recording, which is about 0.5 to 0.8 nm. Composite structures consisting of high Curie top layer and FePt as hard magnetic storage layer can reduce the thermally written in errors to be smaller than 10-4 if the damping constant is increased in the soft layer. Large damping may be realized by doping with rare earth elements. Similar to single FePt grains also in composite structure an increase of switching probability is sacrifices by an increase of thermal jitter. Structures utilizing first order phase transitions breaking the thermal jitter and writeability dilemma are discussed. ",
        " The consideration of oxygen vacancies influence on the relaxors with perovskite structure was considered in the framework of Landau-Ginzburg-Devonshire phenomenological theory. The theory applicability for relaxors is based on the existence of some hidden soft phonon polar mode in them, and its frequency could be zero at some negative temperature TC*. Main attention was paid to PZN-PLZT relaxor described by formula 0.3Pb(Zn1/3Nb2/3)O3-0.7(Pb0.96La0.04(ZrxTi1-x)0.99O3) with x = 0.52, where earlier experimental investigation of oxygen vacancies influence on the polar properties was performed and the evidence of oxygen vacancies induced ferroelectricity was obtained. Since the oxygen vacancies are known to be elastic dipoles, they influence upon elastic and electric fields due to Vegard and flexoelectric coupling. We include the vacancies elastic and electrostrictive contribution into free energy functional. The calculations of the vacancies impact on polar properties were performed using their concentration distribution function. It was shown that the negative Curie temperature of a relaxor TC* is renormalized by the elastic dipoles due to the electrostrictive coupling and can become positive at some large enough concentration of the vacancies. We calculated the local polarization and electric field induced by the flexo-chemical coupling in dependence on the concentration of oxygen vacancies. The coexistence of FE phase and relaxor state can take place because of inhomogeneity of vacancies concentration distribution. ",
        " We calculate magnetic couplings in the J_{pd} model for dilute magnets, in order both to identify the relevant parameters which control ferromagnetism and also to bridge the gap between first principle calculations and model approaches. The magnetic exchange interactions are calculated non-perturbatively and disorder in the configuration of impurities is treated exacly, allowing us to test the validity of effective medium theories. Results differ qualitatively from those of weak coupling. In contrast to mean field theory, increasing J_{pd} may not favor high Curie temperatures: T_C scales primarily with the bandwidth. High temperature ferromagnetism at small dilutions is associated with resonant structure in the p-band. Comparison to diluted magnetic semiconductors indicate that Ga(Mn)As has such a resonant structure and thus this material is already close to optimality. ",
        " Intending to optimize the giant magnetocaloric properties of HoB_{2}, we synthesized and magnetocalorically characterized Ho_{1-x}Gd_{x}B_{2}(0.1 leq x leq 0.4) alloys. We found out that Gd enters stoichiometrically and randomly into the Ho site, leading to a Vegard-type structural change. The addition of spherical S^{7/2} Gd^{3+} moments prompts an enhancement in Curie temperature, a reduction in peak value of the magnetic entropy change while still being relatively high, and a broadening of the magnetic entropy change curves. The overall influence is a relatively high refrigerant capacity and relative cooling power, and an extension of the thermal working range to higher temperatures; thus, electing Ho_{1-x}Gd_{x}B_{2}(as potential candidates for cryogenic refrigeration applications. ",
        " Nanosized spherical system of magnetic moments interacting indirectly via the RKKY mechanism is studied. The interaction energy that determines the temperature of the ferromagnetic ordering, depends strongly on the system size. Obtained in the mean-field approximation, dimensional and concentration dependencies of the Curie temperature testify to the necessity of taking into account the finite size of such systems to calculate their features. Results may concern both artificially constructed nanosystems and naturally arising formations (such as clusters of magnetic ions in diluted magnetic semiconductors, etc.). ",
        " Similar to the optimal-doped, weak-ferromagnetic (WFM induced by canted antiferromagnetism, T_{Curie} = 131 K) and superconducting (T_{c} = 56 K) RuSr_{2}GdCu_{2}O_{8}, the underdoped RuSr_{2}EuCu_{2}O_{8} (T_{Curie} = 133 K, T_{c} = 36 K) also exhibited a spontaneous vortex state (SVS) between 16 K and 36 K. The low field (pm20 G) superconducting hysteresis loop indicates a weak and narrow Meissner state region of average lower critical field B_{c1}^{ave}(T) = B_{c1}^{ave}(0)[1 - (T/T_{SVS})^{2}], with B_{c1}^{ave}(0) = 7 G and T_{SVS} = 16 K. The vortex melting transition (T_{melting} = 21 K) below T_{c} obtained from the broad resistivity drop and the onset of diamagnetic signal indicates a vortex liquid region due to the coexistence and interplay between superconductivity and WFM order. No visible jump in specific heat was observed near T_{c} for Eu- and Gd-compound. This is not surprising, since the electronic specific heat is easily overshadowed by the large phonon and weak-ferromagnetic contributions. Furthermore, a broad resistivity transition due to low vortex melting temperature would also lead to a correspondingly reduced height of any specific heat jump. Finally, with the baseline from the nonmagnetic Eu-compound, specific heat data analysis confirms the magnetic entropy associated with antiferromagnetic ordering of Gd^{3+} (J = S = 7/2) at 2.5 K to be close to it{N_{A}k} ln8 as expected. ",
        " We present a static, model-independent, experimental determination of the spin-spin correlation length xi in a quantum spin system. This is achieved in doped Haldane (i.e., S=1 Heisenberg antiferromagnetic) chain Y(2)BaNi(1-x)Mg(x)O(5) by Y NMR imaging of the staggered magnetization induced around the Mg-impurities (i.e., chain boundaries) by magnetic field. The magnitude of this magnetization is found to decay exponentially with xi equal to the theoretical prediction for an infinite S=1 chain, and the staggered magnetic moment at the edge site showing the Curie behavior of an effective S=1/2 spin. ",
        " Two-dimensional (2D) van der Waals (vdW) magnetic materials could be an ideal platform for ultracompact spintronic applications. Among them, FeCl_{2} monolayer in the triangular lattice is subject to a strong debate. Thus, we critically examine its spin-orbital state, electronic structure, and magnetic properties, using a set of delicate first-principles calculations, crystal field level analyses, and Monte Carlo simulations. Our work reveals that FeCl_{2} monolayer is a ferromagnetic (FM) semiconductor in which the electron correlation of the narrow Fe 3d bands determines the band gap of about 1.2 eV. Note that only when the spin-orbit coupling (SOC) is properly handled, the unique d^{5uparrow}l^downarrow_{z+} electronic ground state is achieved. Then, both the orbital and spin contributions (0.59 mu_{rm B} plus 3.56 mu_{rm B}) to the total magnetic moment well account for, for the first time, the experimental perpendicular moment of 4.3 mu_{rm B}/Fe. Moreover, we find that a compressive strain further stabilizes the d^{5uparrow}l^downarrow_{z+} ground state, and that the enhanced magnetic anisotropy and exchange coupling would boost the Curie temperature (T_{rm C}) from 25 K for the pristine FeCl_{2} monolayer to 69-102 K under 3%-5% compressive strain. Therefore, FeCl_{2} monolayer is indeed an appealing 2D FM semiconductor. ",
        " The continuous displacement cluster variation method (CDCVM) has introduced local atomic displacements into the theoretical framework of the cluster variation method (CVM) by viewing an atom displaced from a Bravais lattice point as a particular atomic species located at the lattice point. This idea of conversion from a freedom of local displacements into configurational freedom is extended in this paper to magnetic freedoms. Various magnitudes of local magnetic moments are considered, as well as two spin directions, on up-spins and down-spins. The approach is applied to pure Ni and its Curie temperature is explored with the entropy formula of the tetrahedron approximation in the CVM, using the first-nearest-neighbor pair interaction energies extracted from the total energies of various spin configurations, which are estimated from electronic-structure calculations. ",
        " We present the effect of Zn (S=0) and Cu (S=1/2) substitution at the Ni site of S=1 Haldane chain compound Y_{2}BaNiO_{5}. ^{89}Y NMR allows us to measure the local magnetic susceptibility at different distances from the defects. The ^{89}Y NMR spectrum consists of one central peak and several less intense satellite peaks. The shift of the central peak measures the uniform susceptibility, which displays a Haldane gap Deltaequiv100 K and it corresponds to an AF coupling Jequiv260 K between the near-neighbor Ni spins. Zn or Cu substitution does not affect the Haldane gap. The satellites, which are evenly distributed on the two sides of the central peak, probe the antiferromagnetic staggered magnetization near the substituted site, which decays exponentially. Its extension is found identical for both impurities and corresponds accurately to the correlation length xi(T) determined by Monte Carlo (QMC) simulations for the pure compound. In the case of non-magnetic Zn, the temperature dependence of the induced magnetization is consistent with a Curie law with an \"effective\" spin S=0.4 on each side of Zn, which is well accounted by Quantum Monte Carlo computations of the spinless-defect-induced magnetism. In the case of magnetic Cu, the similarity of the induced magnetism to the Zn case implies a weak coupling of the Cu spin to the nearest- neighbor Ni spins. The slight reductionin the induced polarization with respect to Zn is reproduced by QMC computations by considering an antiferromagnetic coupling of strength J'=0.1-0.2 J between the S=1/2 Cu-spin and nearest-neighbor Ni-spin. ",
        " The search for a material platform for topological quantum computation has recently focused on unconventional superconductors. Such material systems, where the superconducting order parameter breaks a symmetry of the crystal point group, are capable of hosting novel phenomena, including emergent Majorana quasiparticles. Unique among unconventional superconductors is the recently discovered UTe2, where spin-triplet superconductivity emerges from a paramagnetic normal state. Although UTe2 could be considered a relative of a family of known ferromagnetic superconductors, the unique crystal structure of this material and experimentally suggested zero Curie temperature pose a great challenge to determining the symmetries, magnetism, and topology underlying the superconducting state. These emergent properties will determine the utility of UTe2 for future spintronics and quantum information applications. Here, we report observations of a non-zero polar Kerr effect and of two transitions in the specific heat upon entering the superconducting state, which together show that the superconductivity in UTe2 is characterized by an order parameter with two components that breaks time reversal symmetry. These data allow us to place firm constraints on the symmetries of the order parameter, which strongly suggest that UTe2 is a Weyl superconductor that hosts chiral Fermi arc surface states. ",
        " In this paper, we discuss magnetic properties of dilute systems of localized spins interacting with itinerant carriers. More precisely, we compare recent available Monte Carlo results with our two step approach (TSA) calculations. The TSA consists first on the determination of the magnetic couplings and then on a proper treatment of the resulting effective dilute Heisenberg Hamiltonian. We show important disagreement between the Monte Carlo results (in principle exact) and our TSA calculations. We analyze the origins and shed light on the reasons of those dissensions. In contrast to one could expect, we demonstrate that the available MC calculations suffer from severe numerical shortcomings. More precisely, (i) the finite size effects appear to be huge in dilute systems, (ii) the statistical sampling (disorder configurations) was far too small, and (iii) the determination of the Curie temperature was too rough. In addition, we provide new arguments to explain a recent disagreement between the Monte Carlo simulations and TSA for the model study of the well known III-V diluted magnetic semiconductor Ga_{1-x}Mn_{x}As. We hope that this work will motivate new systematic large scale Monte Carlo calculations. ",
        " The aim of this paper is to present a self-similar growth-fragmentation process linked to a Brownian excursion in the upper half-plane mathbb{H}, obtained by cutting the excursion at horizontal levels. We prove that the associated growth-fragmentation is related to one of the growth-fragmentation processes introduced by Bertoin, Budd, Curien and Kortchemski. ",
        " Electrical control of magnetism is a long-standing goal in physics and technology, recently developed electrolyte gating techniques providing a promising route to realization. Validating a recent theoretical prediction, here we demonstrate large enhancement of electrostatic modulation of ferromagnetic order in ion-gel-gated ultrathin La_{0.5}Sr_{0.5}CoO_{3-delta} by thickness-tuning to the brink of a magnetic percolation transition. Application of only 3-4 V then drives a transition from a short-range-ordered insulator to a robust long-range ferromagnetic metal, realizing giant electrostatic Curie temperature modulation over a 150 K window. In operando polarized neutron reflectometry confirms gate-controlled ferromagnetism, also demonstrating unusually deep penetration of induced magnetization, in further agreement with theory. ",
        " Perpendicularly magnetized spin injector with high Curie temperature is a prerequisite for developing spin optoelectronic devices on 2D materials working at room temperature (RT) with zero applied magnetic field. Here, we report the growth of Ta/CoFeB/MgO structures with a large perpendicular magnetic anisotropy (PMA) on full coverage monolayer (ML) MoS2. A large perpendicular interface anisotropy energy of 0.975mJ/m2 has been obtained at the CoFeB/MgO interface, comparable to that observed in magnetic tunnel junction systems. It is found that the insertion of MgO between the ferromagnetic metal (FM) and the 2D material can effectively prevent the diffusion of the FM atoms into the 2D material. Moreover, the MoS2 ML favors a MgO(001) texture and plays a critical role to establish the large PMA. First principle calculations on a similar Fe/MgO/MoS2 structure reveal that the MgO thickness can modify the MoS2 band structure, from an indirect bandgap with 7ML-MgO to a direct bandgap with 3ML-MgO. Proximity effect induced by Fe results in a splitting of 10meV in the valence band at the {Gamma} point for the 3ML-MgO structure while it is negligible for the 7ML-MgO structure. These results pave the way to develop RT spin optoelectronic devices on 2D transition-metal dichalcogenide materials. ",
        " Low-dimensional magnetic materials have attracted much attention due to their novel properties and high potential for spintronic applications. In this work, we study the electronic structure and magnetic properties of the pseudo one-dimensional compound CrSbSe_3, using density functional calculations, superexchange model analyses, and Monte Carlo simulations. We find that CrSbSe_3 is a ferromagnetic (FM) semiconductor with a band gap of about 0.65 eV. The FM couplings within each zig-zag spin chain are due to the Cr-Se-Cr superexchange with the near-90^circ bonds, and the inter-chain FM couplings are one order of magnitude weaker. By inclusion of the spin-orbit coupling (SOC) effects, our calculations reproduce the experimental observation of the easy magnetization a axis and the hard b axis (the spin-chain direction), with the calculated moderate magnetic anisotropy of 0.19 meV/Cr. Moreover, we identify the nearly equal contributions from the single ion anisotropy of Cr, and from the exchange anisotropy due to the strong SOC of the heavy elements Sb and Se and their couplings with Cr. Using the parameters of the magnetic coupling and anisotropy from the above calculations, our Monte Carlo simulations yield the Curie temperature T_{rm{C}} of 108 K. ",
        " We present a spin-rotation-invariant Green-function theory of long- and short-range order in the ferro- and antiferromagnetic Heisenberg model with arbitrary spin quantum number S on a stacked square lattice. The thermodynamic quantities (Curie temperature T_C, N'eel temperature T_N, specific heat C_V, intralayer and interlayer correlation lengths) are calculated, where the effects of the interlayer coupling and the S dependence are explored. In addition, exact diagonalizations on finite two-dimensional (2D) lattices with S>=1 are performed, and a very good agreement between the results of both approaches is found. For the quasi-2D and isotropic 3D magnets, our theory agrees well with available quantum Monte Carlo and high-temperature series-expansion data. Comparing the quasi-2D S=1/2 magnets, we obtain the inequalities T_N>T_C and, for small enough interlayer couplings, T_N<T_C. The results for C_V and the intralayer correlation length are compared to experiments on the quasi-2D antiferromagnets Zn_2VO(PO_4)_2 with S=1/2 and La_2NiO_4 with S=1, respectively. ",
        " Ferromagnetic topological insulators exhibit the quantum anomalous Hall effect that might be used for high precision metrology and edge channel spintronics. In conjunction with superconductors, they could host chiral Majorana zero modes which are among the contenders for the realization of topological qubits. Recently, it was discovered that the stable 2+ state of Mn enables the formation of intrinsic magnetic topological insulators with A1B2C4 stoichiometry. However, the first representative, MnBi2Te4, is antiferromagnetic with 25 K N'eel temperature and strongly n-doped. Here, we show that p-type MnSb2Te4, previously considered topologically trivial, is a ferromagnetic topological insulator in the case of a few percent of Mn excess. It shows (i) a ferromagnetic hysteresis with record high Curie temperature of 45-50 K, (ii) out-of-plane magnetic anisotropy and (iii) a two-dimensional Dirac cone with the Dirac point close to the Fermi level which features (iv) out-of-plane spin polarization as revealed by photoelectron spectroscopy and (v) a magnetically induced band gap that closes at the Curie temperature as demonstrated by scanning tunneling spectroscopy. Moreover, it displays (vi) a critical exponent of magnetization beta~1, indicating the vicinity of a quantum critical point. Ab initio band structure calculations reveal that the slight excess of Mn that substitutionally replaces Sb atoms provides the ferromagnetic interlayer coupling. Remaining deviations from the ferromagnetic order, likely related to this substitution, open the inverted bulk band gap and render MnSb2Te4 a robust topological insulator and new benchmark for magnetic topological insulators. ",
        " Two-dimensional (2D) materials with intrinsic ferromagnetism provide unique opportunity to engineer new functionalities in nano-spintronics. One such material is CrI_3, showing long-range magnetic order in monolayer with the Curie temperature (T_c) of 45 K. Here we study detailed evolution of magnetic transition and magnetic critical properties in response to systematic reduction in crystal thickness down to 50 nm. Bulk T_c of 61 K is gradually suppressed to 57 K, however, the satellite transition at T^* = 45 K is observed layer-independent at fixed magnetic field of 1 kOe. The origin of T^* is proposed to be a crossover from pinning to depinning of magnetic domain walls. The reduction of thickness facilitates a field-driven metamagnetic transition around 20 kOe with out-of-plane field, in contrast to the continuous changes with in-plane field. The critical analysis around T_c elucidates the mean-field type interactions in microscale-thick CrI_3. ",
        " We performed in-situ angle-resolved photoemission spectroscopy (ARPES) and spin-resolved ARPES (SARPES) experiments to investigate the relationship between electronic band structures and ferromagnetism in SrRuO_3 (SRO) thin films. Our high-quality ARPES and SARPES results show clear spin-lifted band structures. The spin polarization is strongly dependent on momentum around the Fermi level, whereas it becomes less dependent at high-binding energies. This experimental observation matches our dynamical mean-field theory (DMFT) results very well. As temperature increases from low to the Curie temperature, spin-splitting gap decreases and band dispersions become incoherent. Based on the ARPES study and theoretical calculation results, we found that SRO possesses spin-dependent electron correlations in which majority and minority spins are localized and itinerant, respectively. Our finding explains how ferromagnetism and electronic structure are connected, which has been under debate for decades in SRO. ",
        " It is shown that ferromagnetic ordering in metals is associated with an opening of the energy pseudogap. This energy pseudogap belongs to a d-band type in d-metals and to an sp-band type in f-metals. A relation between the magnetic energy and the Curie temperature is obtained. Effect of magnetic ordering on the temperature dependence of the electrical resistivity is considered. ",
        " Room temperature two-dimensional (2D) ferromagnetism is highly desired in practical spintronics applications. Recently, 1T phase CrTe2 (1T-CrTe2) nanosheets with five and thicker layers have been successfully synthesized, which all exhibit the properties of ferromagnetic (FM) metals with Curie temperatures around 305 K. However, whether the ferromagnetism therein can be maintained when continuously reducing the nanosheet's thickness to monolayer limit remains unknown. Here, through first-principles calculations, we explore the evolution of magnetic properties of 1 to 6 layers CrTe2 nanosheets and several interesting points are found: First, unexpectedly, monolayer CrTe2 prefers a zigzag antiferromagnetic (AFM) state with its energy much lower than that of FM state. Second, in 2 to 4 layers CrTe2, both the intralayer and interlayer magnetic coupling are AFM. Last, when the number of layers is equal to or greater than five, the intralayer and interlayer magnetic coupling become FM. Theoretical analysis reveals that the in-plane lattice contraction of few layer CrTe2 compared to bulk is the main factor producing intralayer AFM-FM magnetic transition. At the same time, as long as the intralayer coupling gets FM, the interlayer coupling will concomitantly switch from AFM to FM. Such highly thickness dependent magnetism provides a new perspective to control the magnetic properties of 2D materials. ",
        " Phonon densities of states (DOS) of bcc alpha-^{57}Fe were measured from room temperature through the 1044K Curie transition and the 1185K fcc gamma-Fe phase transition using nuclear resonant inelastic x-ray scattering. At higher temperatures all phonons shift to lower energies (soften) with thermal expansion, but the low transverse modes soften especially rapidly above 700K, showing strongly nonharmonic behavior that persists through the magnetic transition. Interatomic force constants for the bcc phase were obtained by iteratively fitting a Born-von K'{a}rm'{a}n model to the experimental phonon spectra using a genetic algorithm optimization. The second-nearest-neighbor fitted axial force constants weakened significantly at elevated temperatures. An unusually large nonharmonic behavior is reported, which increases the vibrational entropy and accounts for a contribution of 35 meV/atom in the free energy at high temperatures. The nonharmonic contribution to the vibrational entropy follows the thermal trend of the magnetic entropy, and may be coupled to magnetic excitations. A small change in vibrational entropy across the alpha-gamma structural phase transformation is also reported. ",
        " We use muon spin relaxation (muSR) to investigate the magnetic properties of a bulk form diluted ferromagnetic semiconductor (DFS) Li1.15(Zn0.9Mn0.1)P with T_C ~ 22 K. MuSR results confirm the gradual development of ferromagnetic ordering below T_C with a nearly 100% magnetic ordered volume. Despite its low carrier density, the relation between static internal field and Curie temperature observed for Li(Zn,Mn)P is consistent with the trend found in (Ga,Mn)As and other bulk DFSs, indicating these systems share a common mechanism for the ferromagnetic exchange interaction. Li1+y(Zn1-xMnx)P has the advantage of decoupled carrier and spin doping, where Mn2+ substitution for Zn2+ introduces spins and Li+ off-stoichiometry provides carriers. This advantage enables us to investigate the influence of overdoped Li on the ferromagnetic ordered state. Overdoping Li suppresses both T_C and saturation moments for a certain amount of spins, which indicates that more carriers are detrimental to the ferromagnetic exchange interaction, and that a delicate balance between charge and spin densities is required to achieve highest T_C. ",
        " Fe3Si is a ferromagnetic material with possible applications in magnetic tunnel junctions. When doped with Mn, the material shows a complex magnetic behavior, as suggested by older experiments. We employed the Korringa-Kohn-Rostoker (KKR) Green function method within density-functional theory (DFT) in order to study the alloy Fe(3-x)Mn(x)Si, with 0 < x < 1. Chemical disorder is described within the coherent potential approximation (CPA). In agreement with experiment, we find that the Mn atoms align ferromagnetically to the Fe atoms, and that the magnetization and Curie temperature drop with increasing Mn-concentration x. The calculated spin polarization P at the Fermi level varies strongly with x, from P=-0.3 at x=0 (ordered Fe3Si) through P=0 at x=0.28, to P=+1 for x>0.75; i.e., at high Mn concentrations the system is half-metallic. We discuss the origin of the trends of magnetic moments, exchange interactions, Curie temperature and the spin polarization. ",
        " The electronic and magnetic properties of pristine CrPSe_3 and mixed Cr_{1textrm{-}x}M_xPSe_3 (M = Zn, Cd, Hg) monolayers were studied using density functional theory including an on-site Coulomb term (DFT+U) and tight-binding approach (TBA). While pristine CrPSe_3 monolayer has an antiferromagnetic (AFM) ground state, its alloying with MPSe_3 may give rise to half-metallic ferromagnet (HMF) with high Curie temperature. The resulting monolayers demonstrate single-spin Dirac cones of mainly Cr-d character located in the first Brillouin zone directly at the Fermi energy. The calculated Fermi velocities of Dirac fermions indicate very high mobility in mixed Cr_{1textrm{-}x}M_xPSe_3 monolayers, that makes this material appealing for low-dimensional spintronics applications. ",
        " We study the temperature-dependent conductivity sigma(T) and spin susceptibility chi(T) of the two-dimensional disordered Hubbard model. Calculations of the current-current correlation function using the Determinant Quantum Monte Carlo method show that repulsion between electrons can significantly enhance the conductivity, and at low temperatures change the sign of dsigma/dT from positive (insulating behavior) to negative (conducting behavior). This result suggests the possibility of a metallic phase, and consequently a metal-insulator transition,in a two-dimensional microscopic model containing both interactions and disorder. The metallic phase is a non-Fermi liquid with local moments as deduced from a Curie-like temperature dependence of chi(T). ",
        " We study the effect of dissipation on the infinite randomness fixed point and the Griffiths-McCoy singularities of random transverse Ising systems in chains, ladders and in two-dimensions. A strong disorder renormalization group scheme is presented that allows the computation of the finite temperature behavior of the magnetic susceptibility and the spin specific heat. In the case of Ohmic dissipation the susceptibility displays a crossover from Griffiths-McCoy behavior (with a continuously varying dynamical exponent) to classical Curie behavior at some temperature T^*. The specific heat displays Griffiths-McCoy singularities over the whole temperature range. For super-Ohmic dissipation we find an infinite randomness fixed point within the same universality class as the transverse Ising system without dissipation. In this case the phase diagram and the parameter dependence of the dynamical exponent in the Griffiths-McCoy phase can be determined analytically. ",
        " The linear reversal mechanism in FePt grains ranging from 2.316 nm to 5.404 nm has been simulated using atomistic spin dynamics, parametrized from ab-initio calculations. The Curie temperature and the critical temperature (T*), at which the linear reversal mechanism occurs, are observed to decrease with system size whilst the temperature window T* < T < TC increases. The reversal paths close to the Curie temperature have been calculated, showing that for decreasing system size the reversal path becomes more elliptic at lower temperatures, consistent with the decrease in the Curie temperature arising from finite size effects. Calculations of the minimum pulse duration show faster switching in small grains and is qualitatively described by the Landau-Lifshitz-Bloch equation with finite size atomistic parameterization, which suggests that multiscale modeling of FePt down to a grain size of ~ 3.5 nm is possible. ",
        " Ultrasound velocity measurements of the orbital-degenerate frustrated spinel MgV_2O_4 are performed in the high-purity single crystal which exhibits successive structural and antiferromagnetic phase transitions, and in the disorder-introduced single crystal which exhibits spin-glass-like behavior. The measurements reveal that two-types of unusual temperature dependence of the elastic moduli coexist in the cubic paramagnetic phase, which are resolved by magnetic-field and disorder sensitivities: huge Curie-type softening with decreasing temperature, and concave temperature dependence with a characteristic minimum. These elastic anomalies suggest the coupling of lattice to coexisting orbital fluctuations and orbital-spin-coupled excitations. ",
        " We study the effects of short-range correlated disorder arising from chemical dopants or local lattice distortions, on the ferromagnetism of 3d double exchange systems. For this, we integrate out the carriers and treat the resulting disordered spin Hamiltonian within local random phase approximation, whose reliability is shown by direct comparison with Monte Carlo simulations. We find large scale inhomogeneities in the charge, couplings and spin densities. Compared with the homogeneous case, we obtain larger Curie temperatures (T_{C}) and very small spin stiffnesses (D). As a result, large variations of frac{D}{T_{C}} measured in manganites may be explained by correlated disorder. This work also provides a microscopic model for Griffiths phases in double exchange systems. ",
        " The temperature dependence of the O K-edge pre-edge structure in the x-ray absorption spectra of the perovskites La(1-x)A(x)MnO(3), (A = Ca, Sr; x = 0.3, 0.4) reveals a correlation between the disappearance of the splitting in the pre-edge region and the presence of Jahn-Teller distortions. The different magnitudes of the distortions for different compounds is proposed to explain some dissimilarity in the line shape of the spectra taken above the Curie temperature. ",
        " We report the magnetic susceptibility and NMR studies of a spin-gapped layered compound Na2Cu2TeO6 (the spin gap Deltasim 250 K), the hole doping effect on the Cu2TeO6 plane via a topochemical Na deficiency by soft chemical treatment, and the static spin vacancy effect by nonmagnetic impurity Zn substitution for Cu. A finite Knight shift at the ^{125}Te site was observed for pure Na2Cu2TeO6. The negative hyperfine coupling constant ^{125}A_{tr} is an evidence for the existence of a superexchange pathway of the Cu-O-Te-O-Cu bond. It turned out that both the Na deficiency and Zn impurities induce a Curie-type magnetism in the uniform spin susceptibility in an external magnetic field of 1 T, but only the Zn impurities enhance the low-temperature ^{23}Na nuclear spin-lattice relaxation rate whereas the Na deficiency suppresses it. A spin glass behavior was observed for the Na-deficient samples but not for the Zn-substituted samples. The dynamics of the unpaired moments of the doped holes are different from that of the spin vacancy in the spin-gapped Cu2TeO6 planes. ",
        " The magnetic excitation spectrum of the unconventional ferromagnet CeRh_{3}B_{2} was measured by inelastic neutron scattering on single crystal sample in the magnetically ordered and paramagnetic phases. The spin-wave excitation spectrum evidences high exchange interaction along the c-axis about two orders of magnitude higher than the ones in the basal plane of the hexagonal structure. Both strong out of plane and small in plane anisotropies are found. This latter point confirms that considering the J=5/2 multiplet alone is not adequate for describing the ground state of CeRh_{3}B_{2}. Quasielastic scattering measured above T_{Curie} is also strongly anisotropic between the basal plane and the c-axis and suggests localized magnetism. ",
        " We have performed ^{31}P-NMR measurements on Ce(Ru_{1-x}Fe_{x})PO in order to investigate ferromagnetic (FM) quantum criticality, since heavy-fermion (HF) ferromagnet CeRuPO with a two-dimensional structure turns to a HF paramagnet by an isovalent Fe-substitution for Ru. We found that Ce(Ru_{0.15}Fe_{0.85})PO shows critical fluctuations down to sim 0.3 K, as well as the continuous suppression of Curie temperature and the ordered moments by the Fe-substitution. These experimental results suggest the presence of a FM quantum critical point (QCP) at x sim 0.86, which is a rare example among itinerant ferromagnets. In addition, we point out that the critical behaviors in Ce(Ru_{0.15}Fe_{0.85})PO share the similarity with those in YbRh_{2}Si_{2}, where the local criticality of f electrons has been discussed. We reveal that Ce(Ru_{1-x}Fe_{x})PO is a new system to study FM quantum criticality in HF compounds. ",
        " One primary concern in diluted magnetic semiconductors (DMSs) is how to establish a long-range magnetic order with a low magnetic doping concentration to maintain the gate tunability of the host semiconductor, as well as to increase Curie temperature. Two-dimensional van der Waals semiconductors have been recently investigated to demonstrate the magnetic order in DMSs; however, a comprehensive understanding of the mechanism responsible for the gate-tunable long-range magnetic order in DMSs has not been achieved yet. Here, we introduce a monolayer tungsten diselenide (WSe2) semiconductor with V dopants to demonstrate the long-range magnetic order through itinerant spin-polarized holes. The V atoms are sparsely located in the host lattice by substituting W atoms, which is confirmed by scanning tunneling microscopy and high-resolution transmission electron microscopy. The V impurity states and the valence band edge states are overlapped, which is congruent with density functional theory calculations. The field-effect transistor characteristics reveal the itinerant holes within the hybridized band; this clearly resembles the Zener model. Our study gives an insight into the mechanism of the long-range magnetic order in V-doped WSe2, which can also be used for other magnetically doped semiconducting transition metal dichalcogenides. ",
        " A first-principles derived approach is combined with the inverse Monte Carlo technique to determine the atomic orderings leading to prefixed properties in Pb(Sc_{0.5}Nb_{0.5})O_{3} perovskite alloy. We find that some arrangements between Sc and Nb atoms result in drastic changes with respect to the disordered material, including ground states of new symmetries, large enhancement of electromechanical responses, and considerable shift of the Curie temperature. We discuss the microscopic mechanisms responsible for these unusual effects. ",
        " Magnetic linear dichroism and birefringence in (Ga,Mn)As epitaxial layers is investigated by measuring the polarization plane rotation of reflected linearly polarized light when magnetization lies in the plane of the sample. We report on the spectral dependence of the rotation and ellipticity angles in a broad energy range of 0.12-2.7 eV for a series of optimized samples covering a wide range on Mn-dopings and Curie temperatures and find a clear blue shift of the dominant peak at energy exceeding the host material band gap. These results are discussed in the general context of the GaAs host band structure and also within the framework of the k.p and mean-field kinetic-exchange model of the (Ga,Mn)As band structure. We find a semi-quantitative agreement between experiment and theory and discuss the role of disorder-induced non-direct transitions on magneto-optical properties of (Ga,Mn)As. ",
        " We investigated the evolution of ferromagnetism in layered Fe_3GeTe_2 flakes under different pressures and temperatures using in situ magnetic circular dichroism (MCD) spectroscopy. We found that the rectangle shape of hysteretic loop under an out-of-plane magnetic field sweep can sustain below 7 GPa. Above that pressure, an intermediate state appears at low temperature region signaled by an 8-shaped skew hysteretic loop. Meanwhile, the coercive field and Curie temperature decrease with increasing pressures, implying the decrease of the exchange interaction and the magneto-crystalline anisotropy under pressures. The intermediate phase has a labyrinthine domain structure, which is attributed to the increase of ratio of exchange interaction to magneto-crystalline anisotropy based on Jagla's theory. Moreover, our calculation results reveal a weak structural transition around 6 GPa, which leads to a drop of the magnetic momentum of Fe ions. ",
        " Thin films grown by pulsed-laser deposition from targets of Sn0.95Fe0.05O2 are transparent ferromagnets with Curie temperature and spontaneous magnetization of 610 K and 2.2 Am2kg-1, respectively. The 57Fe Mossbauer spectra show the iron is all high-spin Fe3+ but the films are magnetically inhomogeneous on an atomic scale, with only 23 % of the iron ordering magnetically. The net ferromagnetic moment per ordered iron ion, 1.8 Bohr magnetons, is greater than for any simple iron oxide. Ferromagnetic coupling of ferric ions via an electron trapped in a bridging oxygen vacancy (F center) is proposed to explain the high Curie temperature ",
        " Ferromagnetism is an exciting phase of matter exhibiting strongly correlated electron behavior and a standard example of spontaneously broken rotational symmetry: below the Curie temperature, atomic magnets in an isotropic single-domain ferromagnetic metal align along a spontaneously chosen direction. The scattering of conduction electrons from thermal perturbations to this spin order, together with electron-electron collisions, mark the material electrical behavior at low temperatures, where the resistivity varies mostly quadratically with the temperature. Around liquid-helium temperatures however, an interesting phenomenon occurs, giving rise to an extra emph{linear} contribution to the variation of the electrical resistivity with temperature, whose theoretical explanation has encountered problems for a long time. Here I introduce a spin-flip scattering mechanism of conduction electrons in ferromagnetic metals arising from their interaction with the internal magnetic induction and mediated by chiral modes of the crystal lattice vibrations carrying spin 1. This mechanism is able to explain the above anomaly and give a good account of the spin-lattice relaxation times of iron, cobalt and nickel at room temperatures. ",
        " The concepts of symmetry, symmetry breaking and gauge symmetries are discussed, their operational meaning being displayed by the observables {em and} the (physical) states. For infinitely extended systems the states fall into physically disjoint {em phases} characterized by their behavior at infinity or boundary conditions, encoded in the ground state, which provide the cause of symmetry breaking without contradicting Curie Principle. Global gauge symmetries, not seen by the observables, are nevertheless displayed by detectable properties of the states (superselected quantum numbers and parastatistics). Local gauge symmetries are not seen also by the physical states; they appear only in non-positive representations of field algebras. Their role at the Lagrangian level is merely to ensure the validity on the physical states of local Gauss laws, obeyed by the currents which generate the corresponding global gauge symmetries; they are responsible for most distinctive physical properties of gauge quantum field theories. The topological invariants of a local gauge group define superselected quantum numbers, which account for the theta vacua. ",
        " The electronic structure and the magnetism of the novel ferromagnetic semiconductor (Ga,Fe)Sb, whose Curie temperature T_{rm C} can exceed room temperature, were investigated by means of x-ray absorption spectroscopy (XAS), x-ray magnetic circular dichroism (XMCD), and resonance photoemission spectroscopy (RPES). The line-shape analyses of the XAS and XMCD spectra suggest that the ferromagnetism is of intrinsic origin. The orbital magnetic moments deduced using XMCD sum rules were found to be large, indicating that there is a considerable amount of 3d^{6} contribution to the ground state of Fe. From RPES, we observed a strong dispersive Auger peak and non-dispersive resonantly enhanced peaks in the valence-band spectra. The latter is a fingerprint of the correlated nature of Fe 3d electrons, whereas the former indicates their itinerant nature. It was also found that the Fe 3d states have finite contribution to the DOS at the Fermi energy. These states presumably consisting of majority-spin p-d hybridized states or minority-spin e states would be responsible for the ferromagnetic order in this material. ",
        " Single crystals of (Nd1-xCex)2Fe14B are grown out of Fe-(Nd,Ce) flux. Chemical and structural analysis of the crystals indicates that (Nd1-xCex)2Fe14B forms a solid solution until at least x = 0.38 with a Vegard-like variation of the lattice constants with x. Refinements of single crystal neutron diffraction data indicate that Ce has a slight site preference (7:3) for the 4g rare earth site over the 4f site. Magnetization measurements show that for x = 0.38 the saturation magnetization at 400 K, a temperature important to applications, falls from 29.8 for the parent Nd2Fe14B to 27.6 (mu)B/f.u., the anisotropy field decreases from 5.5 T to 4.7 T, and the Curie temperature decreases from 586 to 543 K. First principles calculations carried out within density functional theory are used to explain the decrease in magnetic properties due to Ce substitution. Though the presence of the lower-cost and more abundant Ce slightly affects these important magnetic characteristics, this decrease is not large enough to affect a multitude of applications. Ce-substituted Nd2Fe14B is therefore a potential high-performance permanent magnet material with substantially reduced Nd content. ",
        " Ferromagnetic Kondo lattice compounds are far less common than their antiferromagnetic analogs. In this work, we report the discovery of a new ferromagnetic Kondo lattice compound, YbIr3Ge7. Like almost all ferromagnetic Kondo lattice systems, YbIr3Ge7 shows magnetic order with moments aligned orthogonal to the crystal electric field (CEF) easy axis. YbIr3Ge7 is unique in that it is the only member of this class of compounds that crystallizes in a rhombohedral structure with a trigonal point symmetry of the magnetic site, and it lacks broken inversion symmetry at the local moment site. AC magnetic susceptibility, magnetization, and specific heat measurements show that YbIr3Ge7 has a Kondo temperature TK = 14 K and a Curie temperature TC = 2.4 K. Ferromagnetic order occurs along the crystallographic [100] hard CEF axis despite the large CEF anisotropy of the ground state Kramers doublet with a saturation moment along [001] almost four times larger than the one along [100]. This implies that a mechanism which considers the anisotropy in the exchange interaction to explain the hard axis ordering is unlikely. On the other hand, the broad second-order phase transition at TC favors a fluctuation-induced mechanism. ",
        " For the prototype diluted ferromagnetic semiconductor (Ga,Mn)As, there is a fundamental concern about the electronic states near the Fermi level, i.e., whether the Fermi level resides in a well-separated impurity band derived from Mn doping (impurity-band model) or in the valence band that is already merged with the Mn-derived impurity band (valence-band model). We investigate this question by carefully shifting the Fermi level by means of carrier compensation. We use helium-ion implantation, a standard industry technology, to precisely compensate the hole doping of GaAs-based diluted ferromagnetic semiconductors while keeping the Mn concentration constant. We monitor the change of Curie temperature (T_C) and conductivity. For a broad range of samples including (Ga,Mn)As and (Ga,Mn)(As,P) with various Mn and P concentrations, we observe a smooth decrease of T_C with carrier compensation over a wide temperature range while the conduction is changed from metallic to insulating. The existence of T_C below 10,K is also confirmed in heavily compensated samples. Our experimental results are naturally explained within the valence-band picture. ",
        " Electrical resistivity rho(T) of the 5f ferromagnet UGa2 was investigated for single-crystal samples as a function of pressure and magnetic field. The Curie temperature monotonously increases from T_{C} = 124 K under quasi-hydrostatic pressure up to 154 K at p = 14.2 GPa, after which it turns down steeply and reaches T_{C} = 147 K at p = 15.2 GPa. At 20 GPa the compound is already non-magnetic. This dramatic variation is compatible with exchange interactions mediated by the 5f hybridization with the non-f states. The external pressure first enhances the exchange coupling of the 5f moments, but eventually suppresses the order by washing out the 5f moments. Such a two-band model is adequate for the weakly delocalized 5f states. The spin-disorder resistivity, which produces very high rho-values (300 muOmega.cm) is gradually suppressed by the pressure. In the paramagnetic state, this leads to a crossover from initial negative to positive drho/dT. ",
        " The temperature and yttrium-iron-garnet (YIG) thickness dependences of the spin Peltier effect (SPE) have been investigated using a Pt/YIG junction system at temperatures ranging from room temperature to the Curie temperature of YIG by the lock-in thermography method. By analyzing the YIG thickness dependence using an exponential decay model, the characteristic length of SPE in YIG is estimated to be 0.9 mum near room temperature and almost constant even near the Curie temperature. The high-temperature behavior of SPE is clearly different from that of the spin Seebeck effect, providing a clue for microscopically understanding the reciprocal relation between them. ",
        " We investigate the ferromagnetic Kondo-lattice model (FKLM) with a correlated conduction band. A moment conserving approach is proposed to determine the electronic self-energy. Mapping the interaction onto an effective Heisenberg model we calculate the ordering of the localized spin system self-consistently. Quasiparticle densities of states (QDOS) and the Curie temperature are calculated. The band interaction leads to an upper Hubbard peak and modifies the magnetic stability of the FKLM. "
    ],
    "sources": [
        "1710.02361",
        "cond-mat/0509653",
        "2301.12910",
        "1807.10751",
        "cond-mat/9807129",
        "1808.00815",
        "1012.1983",
        "1002.1426",
        "1205.2416",
        "cond-mat/0311114",
        "1311.4113",
        "2008.08749",
        "2011.05967",
        "2112.13570",
        "1705.02963",
        "1104.0099",
        "2210.06826",
        "1203.0284",
        "0910.2001",
        "1711.01817",
        "1902.01645",
        "2112.03343",
        "1711.03128",
        "2003.06609",
        "0901.0491",
        "1705.05560",
        "cond-mat/0302231",
        "2201.08509",
        "0808.0678",
        "0809.1178",
        "1212.3830",
        "0904.1156",
        "0707.4490",
        "2008.07744",
        "2005.04572",
        "2111.14587",
        "cond-mat/0207163",
        "cond-mat/0402456",
        "2006.00333",
        "cond-mat/0408602",
        "cond-mat/0310689",
        "cond-mat/0301456",
        "cond-mat/0210609",
        "2104.13381",
        "1506.06280",
        "1901.01996",
        "cond-mat/0311033",
        "1011.0665",
        "2106.00907",
        "1505.07942",
        "2008.00790",
        "2107.09043",
        "2004.02676",
        "cond-mat/0409659",
        "1810.10906",
        "1907.05160",
        "1210.5360",
        "1210.3441",
        "1807.02652",
        "cond-mat/0111511",
        "1301.5939",
        "0710.4462",
        "1008.0456",
        "0905.4481",
        "cond-mat/0403075",
        "2205.00106",
        "1804.03609",
        "1509.02987",
        "2204.10123",
        "1310.5247",
        "1710.04460",
        "1011.0754",
        "2203.02356",
        "2011.08589",
        "1712.05071",
        "0711.4586",
        "1605.05135",
        "1410.1199",
        "1812.04953",
        "2001.05342",
        "1008.5198",
        "0710.1126",
        "1601.07705",
        "1608.01949",
        "2105.02705",
        "2101.02162",
        "2104.03023",
        "2209.10632",
        "1108.0378",
        "2202.05358",
        "cond-mat/0511086",
        "1904.04952",
        "1611.06941",
        "1804.06790",
        "cond-mat/0510625",
        "cond-mat/0603221",
        "1805.06373",
        "cond-mat/0503625",
        "1901.09306",
        "cond-mat/9507055",
        "0802.1169",
        "2210.14069",
        "cond-mat/0609760",
        "cond-mat/0201492",
        "1303.4954",
        "1601.05165",
        "1407.3029",
        "cond-mat/0702444",
        "1109.0531",
        "1609.08181",
        "1710.02522",
        "1705.09029",
        "nucl-th/0403083",
        "1209.6630",
        "1910.14158",
        "1604.06324",
        "0908.0934",
        "1207.4363",
        "1906.03825",
        "1206.2755",
        "2205.09358",
        "1306.3582",
        "1501.07672",
        "1908.07804",
        "2001.11389",
        "2109.01463",
        "1612.06785",
        "0912.4353",
        "1302.1092",
        "cond-mat/0004176",
        "cond-mat/9504021",
        "1404.2023",
        "1704.05297",
        "2202.06947",
        "0802.4108",
        "1612.07124",
        "0705.1072",
        "1002.0090",
        "cond-mat/9406008",
        "1412.5208",
        "2212.09267",
        "1205.5422",
        "cond-mat/0606420",
        "0806.2029",
        "1008.0674",
        "1309.0816",
        "cond-mat/9402037",
        "1003.0092",
        "1302.5751",
        "1901.02905",
        "1707.04710",
        "1411.3052",
        "1803.09965",
        "cond-mat/0607640",
        "2011.12660",
        "cond-mat/0609266",
        "cond-mat/0702040",
        "cond-mat/9902084",
        "2204.07755",
        "1901.07209",
        "cond-mat/0310645",
        "2002.02539",
        "0902.4722",
        "2005.06372",
        "1807.09364",
        "2106.10317",
        "2112.10937",
        "0903.1282",
        "2011.07052",
        "1908.09969",
        "2111.07750",
        "1204.5013",
        "2106.07960",
        "1404.4998",
        "1406.3744",
        "1012.3463",
        "2112.11840",
        "cond-mat/9907246",
        "0711.2905",
        "1503.03728",
        "1405.2802",
        "cond-mat/0702642",
        "cond-mat/0501273",
        "cond-mat/0607141",
        "1007.4919",
        "1210.4604",
        "2002.07333",
        "cond-mat/0110044",
        "1308.5907",
        "2005.03195",
        "cond-mat/0401293",
        "1607.04585",
        "1502.06540",
        "1811.07467",
        "1508.07792",
        "1901.02489",
        "1602.06790",
        "1502.04948",
        "2204.05482",
        "cond-mat/0306242"
    ]
}