{
    "abstracts": [
        " We realize and investigate ionic liquid gated field-effect transistors (FETs) on large-area MoS2 monolayers grown by chemical vapor deposition (CVD). Under electron accumulation, the perfoance of these devices is comparable to that of FETs based on exfoliated flakes. FETs on CVD-grown material, however, exhibit clear ambipolar transport, which for MoS2 monolayers had not been reported previously. We exploit this property to estimate the bandgap Delta of monolayer MoS2 directly from the device transfer curves and find Delta approx 2.4-2.7 eV. In the ambipolar injection regime, we observe electroluminescence due to exciton recombination in MoS2, originating from the region close to the hole-injecting contact. Both the observed transport properties and the behavior of the electroluminescence can be consistently understood as due to the presence of defect states at an energy of 250-300 meV above the top of the valence band, acting as deep traps for holes. Our results are of technological relevance, as they show that devices with useful optoelectronic functionality can be realized on large-area MoS2 monolayers produced by controllable and scalable techniques. ",
        " Although diamond photonics has driven considerable interest and useful applications, as shown in frequency generation devices and single photon emitters, fundamental studies on the third-order optical nonlinearities of diamond are still scarce, stalling the development of an integrated platfo for nonlinear and quantum optics. The purpose of this paper is to contribute to those studies by measuring the spectra of two-photon absorption coefficient (beta) and the nonlinear index of refraction (n2) of diamond using femtosecond laser pulses, in a wide spectral range. These measurements show the magnitude of beta increasing from 0.07 to 0.23 cm/GW, as it approaches the bandgap energy, in the region from 3.18 to 4.77 eV (390 - 260 nm), whereas the n2 varies from zero to 1.7E-19 m^2/W in the full measured range, from 0.83 - 4.77 eV (1500 - 260 nm). The experimental results are compared with theoretical models for nonlinear absorption and refraction in indirect gap semiconductors, indicating the two-photon absorption as the dominant effect in the dispersion of the third-order nonlinear susceptibility. These data, together with optical Kerr gate measurements, also provided here, are of foremost relevance to the understanding of ultrafast optical processes in diamond and its nonlinear properties. ",
        " Two-dimensional (2D) polyaniline sheet has been recently synthesized and showed that it is a semiconductor with indirect band gap. In this research, we examine electrical and mechanical properties of a fully hydrogenated 2D polyaniline sheet C3NH using density functional theory. Results show that the C3NH sheet is an insulator with a band gap more than 5eV . The sheet is quasi planner and dynamically stable confied by phonon band structure. Young modulus of the sheet is 275N/m. Ab-initio molecular dynamics simulations show that the C3NH sheet can be stable at 1000K indicating a high melting point. Tensile strain reduces the band gap of the sheet and electron effective mass. In return, hole effective mass is strongly dependent on the strain direction so that strain along zigzag (achair) increases (reduces) hole effective mass. our findings show that C3NH sheet is a promising candidate for electronic and optoelectronic applications and strain engineering can be used to tune its properties. ",
        " Carbon is likely the most fascinating element of the periodic table because of the diversity of its allotropes stemming from its variable (sp, sp2, and sp3) bonding motifs. Exploration of new fos of carbon has been an eternal theme of contemporary scientific research. Here we report on novel amorphous carbon phases containing high fraction of sp3 bonded atoms recovered after compressing fullerene C60 to previously unexplored high pressure and temperature. The synthesized carbons are the hardest and strongest amorphous materials known to date, capable of scratching diamond crystal and approaching its strength which is evidenced by complimentary mechanical tests. Photoluminescence and absorption spectra of the materials demonstrate they are semiconductors with tunable bandgaps in the range of 1.5-2.2 eV, comparable to that of amorphous silicon. A remarkable combination of the outstanding mechanical and electronic properties makes this class of amorphous carbons an excellent candidate for photovoltaic applications demanding ultrahigh strength and wear resistance. ",
        " Density functionals with asymptotic corrections to the long-range potential provide entry-level methods for calculations on molecules that can sustain charge transfer, but similar applications in Materials Science are rare. We describe an implementation of the CAM-B3LYP range-separated functional within the Vienna Ab-initio Simulation Package (VASP) framework, together with its analytical functional derivatives. Results obtained for eight representative materials: aluminum, diamond, graphene, silicon, NaCl, MgO, 2D h-BN and 3D h-BN, indicate that CAM-B3LYP predictions embody mean-absolute deviations (MAD) compared to HSE06 that are reduced by a factor of 6 for lattice parameters, 4 for quasiparticle band gaps, 3 for the lowest optical excitation energies, and 6 for exciton binding energies. Further, CAM-B3LYP appears competitive compared to ab initio G0W0 and Bethe-Salpeter equation (BSE) approaches. The CAM-B3LYP implementation in VASP was verified by comparison of optimized geometries and reaction energies for isolated molecules taken from the ACCDB database, evaluated in large periodic unit cells, to analogous results obtained using Gaussian basis sets. Using standard GW pseudopotentials and energy cutoffs for the plane-wave calculations and the aug-cc-pV5Z basis set for the atomic-basis ones, the MAD in energy for 1738 chemical reactions was 0.34 kcal mol-1, whilst for 480 unique bond lengths this was 0.0036 AA; these values reduced to 0.28 kcal mol-1 (largest error 0.94 kcal mol-1) and 0.0009 AA by increasing the plane-wave cuttoff energy to 850 eV. ",
        " Through a combination of thin film growth, hard X-ray photoelectron spectroscopy (HAXPES), scanning transmission electron microscopy/electron energy loss spectroscopy (STEM/EELS), magneto-transport measurements, and transport modeling, we report on the demonstration of modulation-doping of BaSnO3 (BSO) using a wider bandgap La-doped SrSnO3 (LSSO) layer. Hard X-ray photoelectron spectroscopy (HAXPES) revealed a valence band offset of 0.71 +/- 0.02 eV between LSSO and BSO resulting in a favorable conduction band offset for remote doping of BSO using LSSO. Nonlinear Hall effect of LSSO/BSO heterostructure confied two-channel conduction owing to electron transfer from LSSO to BSO and remained in good agreement with the results of self-consistent solution to one-dimensional Poisson and Schr\"odinger equations. Angle-dependent HAXPES measurements revealed a spatial distribution of electrons over 2-3 unit cells in BSO. These results bring perovskite oxides a step closer to room-temperature oxide electronics by establishing modulation-doping approaches in non-SrTiO3-based oxide heterostructure. ",
        " We have measured the optical constants of GaMnAs from 0.62 eV to 6 eV, using spectroscopic ellipsometry. The second derivatives of the dielectric function are examined through a critical point analysis. The E1 critical point shifts to higher energies with increased doping of Mn, while all other critical points appear unaffected. The evolution of the critical points results from the interplay between band gap renoalization from ionized impurities and sp-d hybridization of the Mn induced impurity band and GaAs valence and conductions bands. ",
        " Quantum confinement of graphene Dirac-like electrons in artificially crafted nanometer structures is a long sought goal that would provide a strategy to selectively tune the electronic properties of graphene, including bandgap opening or quantization of energy levels However, creating confining structures with nanometer precision in shape, size and location, remains as an experimental challenge, both for top-down and bottom-up approaches. Moreover, Klein tunneling, offering an escape route to graphene electrons, limits the efficiency of electrostatic confinement. Here, a scanning tunneling microscope (STM) is used to create graphene nanopatterns, with sub-nanometer precision, by the collective manipulation of a large number of H atoms. Individual graphene nanostructures are built at selected locations, with predeteined orientations and shapes, and with dimensions going all the way from 2 nanometers up to 1 micron. The method peits to erase and rebuild the patterns at will, and it can be implemented on different graphene substrates. STM experiments demonstrate that such graphene nanostructures confine very efficiently graphene Dirac quasiparticles, both in zero and one dimensional structures. In graphene quantum dots, perfectly defined energy band gaps up to 0.8 eV are found, that scale as the inverse of the dots linear dimension, as expected for massless Dirac feions ",
        " In this work we report on Hall effect, resistivity and theopower measurements in n-type indium selenide at room temperature under either hydrostatic and quasi-hydrostatic pressure. Up to 40 kbar (= 4 GPa), the decrease of carrier concentration as the pressure increases is explained through the existence of a subsidiary minimum in the conduction band. This minimum shifts towards lower energies under pressure, with a pressure coefficient of about -105 meV/GPa, and its related impurity level traps electrons as it reaches the band gap and approaches the Fei level. The pressure value at which the electron trapping starts is shown to depend on the electron concentration at ambient pressure and the dimensionality of the electron gas. At low pressures the electron mobility increases under pressure for both 3D and 2D electrons, the increase rate being higher for 2D electrons, which is shown to be coherent with previous scattering mechanisms models. The phase transition from the semiconductor layered phase to the metallic sodium cloride phase is observed as a drop in resistivity around 105 kbar, but above 40 kbar a sharp nonreversible increase of the carrier concentration is observed, which is attributed to the foation of donor defects as precursors of the phase transition. ",
        " In this manuscript, we report the results of optical properties of SnS thin films, deposited on FTO coated glass substrates at room temperature by theal evaporation technique. In addition, the effect of film thickness on the optical behavior of FTO/SnS is analyzed and obtained results are compared with data of SnS films grown on glass and ITO substrates. Our study indicates that the properties of SnS film are independent of the substrate material. Further, the influence of the film thickness on the other optical parameters including, linear and third order nonlinear optical constants and dispersion parameters have also been investigated using the transmission, reflection, and absorption spectra. It is found that the optical band gap decreases from 2.07 to 1.30 eV with increase in SnS film thickness, whereas the refractive index increases with increasing thickness. Additionally, the oscillator energy, and the dispersion energy are estimated using WempleDiDomenico approach. The dispersion energies are in the range of 7.20 to 4.59 eV, while the oscillator energies of the thin films are in the range of 5.49 to 2.24 eV. Moreover, the nonlinear refractive index, and optical susceptibility are calculated by using the empirical relation of Tichy and Ticha. The volume of data suggests optical properties of SnS thin films are strongly dependent on film thickness. ",
        " The alkali halides, known as ionic crystals, have the NaCl-type or CsCl-type structure as the ground state. We study the structural, vibrational, and electronic properties of two-dimensional (2D) ionic crystals from first-principles. Two potential structures that are hexagonal and tetragonal are investigated as structural templates. Through phonon dispersion calculations, 8 and 16 out of 20 alkali halides in the hexagonal and tetragonal structures are dynamically stable, respectively. The electron energy gaps range from 6.8 eV for LiF to 3.9 eV for RbI and CsI in the tetragonal structure within the generalized gradient approximation. By considering the Madelung energy and the core-core repulsion, we propose a hard sphere model that accounts for the nearest-neighbor bond length and the cohesive energy of 2D alkali halides. The 2D CsAu in the tetragonal structure is also predicted to be stable as an ionic crystal including only metallic elements, showing a band gap of 2.6 eV that is higher than that of the 3D counterparts. ",
        " By means of first-principles calculations, we explore systematically the geometric, electronic and piezoelectric properties of multilayer SnSe. We find that these properties are layer-dependent, indicating that the interlayer interaction plays an important role. With increasing the number of SnSe layers from 1 to 6, we observe that the lattice constant decreases from 4.27 mathringA to 4.22 mathringA along zigzag direction, and increases from 4.41 mathringA to 4.51 mathringA along achair direction close to the bulk limit (4.21 mathringA and 4.52 mathringA, respectively); the band gap decreases from 1.45 eV to 1.08 eV, approaching the bulk gap 0.95 eV. Although the monolayer SnSe exhibits almost symmetric geometric and electronic structures along zigzag and achair directions, bulk SnSe is obviously anisotropic, showing that the stacking of layers enhances the anisotropic character of SnSe. As bulk and even-layer SnSe have inversion centers, they cannot exhibit piezoelectric responses. However, we show that the odd-layer SnSe have piezoelectric coefficients much higher than those of the known piezoelectric materials, suggesting that the odd-layer SnSe is a good piezoelectric material. ",
        " Two-dimensional materials have been gaining great attention as they displayed a broad series of electronic properties that ranging from superconductivity to topology. Among them, those which possess magnetism are most desirable, enabling us to manipulate charge and spin simultaneously. Here, based on first-principles calculation, we demonstrate monolayer chromium iodide arsenide (CrIAs), an undiscovered stable two-dimensional material, is an intrinsic ferromagnetic semiconductor with out-of-plane spin magnetization. The indirect bandgaps are predicted to be 0.32 eV for majority spin and 3.31 eV for minority spin, large enough to preserve semiconducting features at room temperature. Its Curie temperature, estimated by Heisenberg model with magnetic anisotropic energy using Monte Carlo method, is as high as 655 K that well above the room temperature, owing to strong direct exchange interaction between chromium d and iodine p orbitals. This work offers the affiative answer of whether there exists two-dimensional ferromagnetic semiconductor at room temperature. And the practical realization of quantum spintronic devices, which have been suppressed because of lacking suitable room temperature magnetic materials, would embrace a great opportunity. ",
        " Ab-initio, self-consistent electronic energy bands of rutile TiO2 are reported within the local density functional approximation (LDA). Our first principle, non-relativistic and ground state calculations employed a local density functional approximation (LDA) potential and the linear combination of atomic orbitals (LCAO). Within the framework of the Bagayoko, Zhao, and Williams (BZW) method, we solved self-consistently both the Kohn-Sham equation and the equation giving the ground state charge density in tes of the wave functions of the occupied states. Our calculated band structure shows that there is significant O2p-Ti3d hybridization in the valence bands. These bands are well separated from the conduction bands by an indirect band gap of 2.95 eV, from Gamma to R. Consequently, this work predicts that rutile TiO2 is an indirect band gap material, as all other gaps from our calculations are larger than 2.95 eV. We found a slightly larger, direct band gap of 3.05 eV, at the Gamma point, in excellent agreement with experiment. Our calculations reproduced the peaks in the measured conduction and valence bands densities of states, within experimental uncertainties. We also calculated electron effective mass. Our structural optimization led to lattice parameters of 4.65 AA and 2.97 AA for a0 and c0, respectively with a u parameter of 0.3051 and a bulk modulus of 215 GPa. ",
        " Using spectroscopic ellipsometry measurements on GaP1-xBix/GaP epitaxial layers up to x = 3.7% we observe a giant bowing of the direct band gap (Eg^Gamma) and valence band spin-orbit splitting energy (DeltatextSO). Eg^Gamma (DeltatextSO) is measured to decrease (increase) by approximately 200 meV (240 meV) with the incorporation of 1% Bi, corresponding to a greater than fourfold increase in DeltatextSO in going from GaP to GaP0.99Bi0.01. The evolution of Eg^Gamma and DeltatextSO with x is characterised by strong, composition-dependent bowing. We demonstrate that a simple valence band-anticrossing model, parametrised directly from atomistic supercell calculations, quantitatively describes the measured evolution of Eg^Gamma and DeltatextSO with x. In contrast to the well-studied GaAs1-xBix alloy, in GaP1-xBix substitutional Bi creates localised impurity states lying energetically within the GaP host matrix band gap. This leads to the emergence of an optically active band of Bi-hybridised states, accounting for the overall large bowing of Eg^Gamma and DeltatextSO and in particular for the giant bowing observed for x lesssim 1%. Our analysis provides insight into the action of Bi as an isovalent impurity, and constitutes the first detailed experimental and theoretical analysis of the GaP1-xBix alloy band structure. ",
        " We present a study of the electronic properties of Tl5Te3, BiTl9Te6 and SbTl9Te6 compounds by means of density functional theory based calculations. The optimized lattice constants of the compounds are in good agreement with the experimental data. The band gap of BiTl9Te6 and SbTl9Te6 compounds are found to be equal to 0.589 eV and 0.538 eV, respectively and are in agreement with the available experimental data. To compare the theoelectric properties of the different compounds we calculate their theopower using Mott's law and show, as expected experimentally, that the substituted tellurides have much better theoelectric properties compared to the pure compound. ",
        " We demonstrate experimentally a chemical codoping approach that would simultaneously narrow the band gap and control the band edge positions of oxide semiconductors. Using TiO2 as an example, we show that a sequential doping scheme with nitrogen (N) leading the way, followed by phosphorous (P), is crucial for the incorporation of both N and P into the anion sites. Various characterization techniques confi the foation of the N-P bonds, and as a consequence of the chemical codoping, the band gap of the TiO2 is reduced from 3.0 eV to 1.8 eV. The realization of chemical codoping could be an important step forward in improving the general perfoance of electronic and optoelectronic materials and devices. ",
        " During the synthesis of ultra-thin materials with hexagonal lattice structure Stone-Wales (SW) type of defects are quite likely to be foed and the existence of such topological defects in the graphene-like structures results in dramatical changes of their electronic and mechanical properties. Here we investigate the foation and reactivity of such SW defects in silicene. We report the energy barrier for the foation of SW defects in freestanding (~2.4 eV) and Ag(111)-supported (~2.8 eV) silicene and found it to be significantly lower than in graphene (~9.2 eV). Moreover, the buckled nature of silicene provides a large energy barrier for the healing of the SW defect and therefore defective silicene is stable even at high temperatures. Silicene with SW defects is semiconducting with a direct bandgap of 0.02 eV and this value depends on the concentration of defects. Furtheore, nitrogen substitution in SW defected silicene shows that the defect lattice sites are the least preferable substitution locations for the N atoms. Our findings show the easy foation of SW defects in silicene and also provide a guideline for bandgap engineering in silicene-based materials through such defects. ",
        " Monolayer PtSe2 is a semiconducting transition metal dichalcogenide characterized by an indirect band gap, space inversion symmetry, and high carrier mobility. Strong intrinsic spin-orbit coupling and the possibility to induce extrinsic spin-orbit fields by gating make PtSe2 attractive for fundamental spin transport studies as well as for potential spintronics applications. We perfo a systematic theoretical study of the spin-orbit coupling and spin relaxation in this material. Specifically, we employ first principles methods to obtain the basic orbital and spin-orbital properties of PtSe2, also in the presence of an external transverse electric field. We calculate the spin mixing parameters b^2 and the spin-orbit fields Omega for the Bloch states of electrons and holes. This infoation allows us to predict the spin lifetimes due to the Elliott-Yafet and D'yakonov-Perel mechanisms. We find that b^2 is rather large, on the order of 10^-2 and 10^-1, while Omega varies strongly with doping, being about 10^3 - 10^4,ns^-1 for %typical Fei levels in the interval (10-100) meV, carrier density in the interval 10^13-10^14,cm^-2 at the electric field of 1 V/nm. We estimate the spin lifetimes to be on the picosecond level. ",
        " We probe the room temperature photoluminescence of N-layer molybdenum ditelluride (MoTe2) in the continuous wave (cw) regime. The photoluminescence quantum yield of monolayer MoTe2 is three times larger than in bilayer MoTe2 and forty times greater than in the bulk limit. Mono- and bilayer MoTe2 display almost symmetric emission lines at 1.10~ eV and 1.07~ eV, respectively, which predominantly arise from direct radiative recombination of the A exciton. In contrast, Ngeq3-layer MoTe2 exhibits a much reduced photoluminescence quantum yield and a broader, redshifted and seemingly bimodal photoluminescence spectrum. The low- and high-energy contributions are attributed to emission from the indirect and direct optical band gaps, respectively. Bulk MoTe2 displays a broad emission line with a dominant contribution at 0.94~eV that is assigned to emission from the indirect optical band gap. As compared to related systems (such as MoS2, MoSe2, WS2 and WSe2), the smaller energy difference between the monolayer direct optical band gap and the bulk indirect optical band gap leads to a smoother increase of the photoluminescence quantum yield as N decreases. In addition, we study the evolution of the photoluminescence intensity in monolayer MoTe2 as a function of the exciton foation rate Wmathabs up to 3.6times 10^22~cm^-2 s^-1. The lineshape of the photoluminescence spectrum remains largely independent of Wmathabs, whereas the photoluminescence intensity grows sub-linearly above Wmathabssim 10^21~ cm^-2 s^-1. This behavior is assigned to exciton-exciton annihilation and is well-captured by an elementary rate equation model. ",
        " Three new novel phases of carbon nitride (CN) bilayer, which are named as alpha-C2N2, beta-C2N2 and gamma-C4N4, respectively, have been predicted in this paper. All of them are consisted of two CN sheets connected by C-C covalent bonds. The phonon dispersions reveal that all these phases are dynamically stable, since no imaginary frequency is found for them. Transition path way between alpha-C2N2 and beta-C2N2 is investigated, which involves bond-breaking and bond-refoing between C and N. This conversion is difficult, since the activation energy barrier is found to be 1.90 eV per unit cell, high enough to prevent the transfoation at room temperature. Electronic structures calculations show that they are all semiconductors with indirect band gap of 3.76 / 5.22 eV, 4.23 / 5.75 eV and 2.06 / 3.53 eV by PBE / HSE calculation, respectively. The beta-C2N2 has the widest band gap among the three phases. From our results, the three new two-dimensional materials have potential applications in the electronics, semiconductors, optics and spintronics. ",
        " Single-layer MoS2 is a direct-gap semiconductor whose electronic band structure strongly depends on the strain applied to its crystal lattice. While uniaxial strain can be easily applied in a controlled way, e.g., by bending of a flexible substrate with the atomically thin MoS2 layer on top, experimental realization of biaxial strain is more challenging. Here, we exploit the large mismatch between the theal expansion coefficients of MoS2 and a silicone-based substrate to apply a controllable biaxial tensile strain by heating the substrate with a focused laser. The effect of this biaxial strain is directly observable in optical spectroscopy as a redshift of the MoS2 photoluminescence. We also demonstrate the potential of this method to engineer more complex strain patterns by employing highly absorptive features on the substrate to achieve non-unifo heat profiles. By comparison of the observed redshift to strain-dependent band structure calculations, we estimate the biaxial strain applied by the silicone-based substrate to be up to 0.2 percent, corresponding to a band gap modulation of 105 meV per percentage of biaxial tensile strain. ",
        " The monolayer WSe2 is interesting and important for future application in nanoelectronics, spintronics and valleytronics devices, because it has the largest spin splitting and longest valley coherence time among all the known monolayer transition-metal dichalcogenides (TMDs). To obtain the large-area monolayer TMDs' crystal is the first step to manufacture scalable and high-perfoance electronic devices. In this letter, we have successfully fabricated millimeter-sized monolayer WSe2 single crystals with very high quality, based on our improved mechanical exfoliation method. With such superior samples, using standard high resolution angle-resolved photoemission spectroscopy, we did comprehensive electronic band structure measurements on our monolayer WSe2. The overall band features point it to be a 1.2eV direct band gap semiconductor. Its spin-splitting of the valence band at K point is found as 460 meV, which is 30 meV less than the corresponding band splitting in its bulk counterpart. The effective hole masses of valence bands are deteined as 2.344 me at Gamma, and 0.529 me as well as 0.532 me at K for the upper and lower branch of splitting bands, respectively. And screening effect from substrate is shown to substantially impact on the electronic properties. Our results provide important insights into band structure engineering in monolayer TMDs. Our monolayer WSe2 crystals may constitute a valuable device platfo. ",
        " The structural stability, electronic structure, and theal transport properties of one to six quintuple layers (QLs) of Bi2Se3 are investigated by van der Waals density functional theory and semi-classical Boltzmann theory. The bandgap amounts to 0.41 eV for a single QL and reduces to 0.23 eV when the number of QLs increases to six. A single QL has a significantly higher theoelectric figure of merit (0.27) than the bulk material (0.10), which can be further enhanced to 0.30 by introducing 2.5% compressive strain. Positive phonon frequencies under strain indicate that the structural stability is maintained. ",
        " The ability to directly observe electronic band structure in modern nanoscale field-effect devices could transfo understanding of their physics and function. One could, for example, visualize local changes in the electrical and chemical potentials as a gate voltage is applied. One could also study intriguing physical phenomena such as electrically induced topological transitions and many-body spectral reconstructions. Here we show that submicron angle-resolved photoemission (micro-ARPES) applied to two-dimensional (2D) van der Waals heterostructures affords this ability. In graphene devices, we observe a shift of the chemical potential by 0.6 eV across the Dirac point as a gate voltage is applied. In several 2D semiconductors we see the conduction band edge appear as electrons accumulate, establishing its energy and momentum, and observe significant band-gap renoalization at low densities. We also show that micro-ARPES and optical spectroscopy can be applied to a single device, allowing rigorous study of the relationship between gate-controlled electronic and excitonic properties. ",
        " Based on first-principles calculations and symmetry analysis, we propose that EuIn2As2 is a long awaited axion insulator with antiferromagnetic (AFM) long range order. Characterized by the parity-based invariant mathbb Z4=2, the topological magneto-electric effect is quantized with theta=pi in the bulk, with a band gap as large as 0.1 eV. When the staggered magnetic moment of the AFM phase is along a/b axis, it's also a TCI phase. Gapless surface states emerge on (100), (010) and (001) surfaces, protected by mirror symmetries (nonzero mirror Chern numbers). When the magnetic moment is along c axis, the (100) and (001) surfaces are gapped. As a consequence of a high-order topological insulator with mathbb Z4=2, the one-dimensional (1D) chiral state can exist on the hinge between those gapped surfaces. We have calculated both the topological surface states and hinge state in different phases of the system, respectively, which can be detected by ARPES or STM experiments. ",
        " The optical properties of graphene are made unique by the linear band structure and the vanishing density of states at the Dirac point. It has been proposed that even in the absence of a semiconducting bandgap, a relaxation bottleneck at the Dirac point may allow for population inversion and lasing at arbitrarily long wavelengths. Furtheore, efficient carrier multiplication by impact ionization has been discussed in the context of light harvesting applications. However, all these effects are difficult to test quantitatively by measuring the transient optical properties alone, as these only indirectly reflect the energy and momentum dependent carrier distributions. Here, we use time- and angle-resolved photoemission spectroscopy with femtosecond extreme ultra-violet (EUV) pulses at 31.5 eV photon energy to directly probe the non-equilibrium response of Dirac electrons near the K-point of the Brillouin zone. In lightly hole-doped epitaxial graphene samples, we explore excitation in the mid- and near-infrared, both below and above the minimum photon energy for direct interband transitions. While excitation in the mid-infrared results only in heating of the equilibrium carrier distribution, interband excitations give rise to population inversion, suggesting that terahertz lasing may be possible. However, in neither excitation regime do we find indication for carrier multiplication, questioning the applicability of graphene for light harvesting. Time-resolved photoemission spectroscopy in the EUV emerges as the technique of choice to assess the suitability of new materials for optoelectronics, providing quantitatively accurate measurements of non-equilibrium carriers at all energies and wavevectors. ",
        " The Moore's law in the semiconducting industry has faltered as the three-dimensional (3D) Si-based transistors has approached their physical limit with the downscaling. The carrier mobility mu , critical to the device's perfoance, will be degraded when the thickness of Si is scaled into several nanometers. In contrast to the bulk counterpart, two-dimensional (2D) semiconductors can be scaled into atomic-layer thickness without dangling bonds, maintaining its intrinsic carrier mobility and going beyond the limits of Si-based electronics. Hence, the development of novel 2D semiconducting materials with high carrier mobility is the market demand as well as the scientific challenge. Here, we successfully designed 2D Be3B2C3 with planar hypercoordinate motif. It possesses the perfect planar skeleton with both pentacoordinate carbon and hexacoordinate boron moieties, which is the first reported material with such multi-hypercoordinate centers. Density functional theory (DFT) calculations prove that the Be3B2C3 monolayer has excellent structural and theal stabilities as well as mechanical properties. Further investigations reveal that the Be3B2C3 monolayer has a strong ultrahigh Fei velocity ( 2.7 times 10^5 m/s), suitable direct bandgap (1.97 eV), and high optical absorption coefficient ( 10^5). As a result, an unprecedented ultrahigh room-temperature carrier mobility ( 8.1 times 10^5 cm^2V^-1s^-1) with strong anisotropy is discovered, making Be3B2C3 monolayer a revolutionary candidate for future electronic and photovoltaic applications. ",
        " Layered material alpha-RuCl3 has caught wide attention due to its possible realization of Kitaev's spin liquid and its electronic structure that involves the interplay of electron-electron correlations and spin-orbit effects. Several DFT+U studies have suggested that both electron-electron correlations and spin-orbit effects are crucial for accurately describing the band gap. This work studies the importance of these two effects using fixed-node and fixed-phase diffusion Monte Carlo calculations both in spin-averaged and explicit spin-orbit foalisms. In the latter, the Slater-Jastrow trial function is constructed from two-component spin-orbitals using our recent quantum Monte Carlo (QMC) developments and thoroughly tested effective core potentials. Our results show that the gap in the ideal crystal is already accurately described by the spin-averaged case, with the dominant role being played by the magnetic ground state with significant exchange and electron correlation effects. We find qualitative agreement between hybrid DFT, DFT+U, and QMC. In addition, QMC results agree very well with available experiments, and we identify the values of exact Fock exchange mixing that provide comparable gaps. Explicit spin-orbit QMC calculations reveal that the effect of spin-orbit coupling on the gap is minor, of the order of 0.2 eV, which corresponds to the strength of the spin-orbit of the Ru atom. ",
        " We characterize the electronic structure and elasticity of monolayer transition-metal dichalcogenides MX2 (M=Mo, W, Sn, Hf and X=S, Se, Te) with 2H and 1T structures using fully relativistic first principles calculations based on density functional theory. We focus on the role of strain on the band structure and band alignment across the series 2D materials. We find that strain has a significant effect on the band gap; a biaxial strain of 1% decreases the band gap in the 2H structures, by as a much 0.2 eV in MoS2 and WS2, while increasing it for the 1T materials. These results indicate that strain is a powerful avenue to modulate their properties; for example, strain enables the foation of, otherwise impossible, broken gap heterostructures within the 2H class. These calculations provide insight and quantitative infoation for the rational development of heterostructures based on these class of materials accounting for the effect of strain. ",
        " Spin-polarized conducting edge currents counterpropagate in quantum spin Hall (QSH) insulators and are protected against disorder-driven localizations by the time-reversal symmetry. Using these spin-currents for device applications require materials having large band gap and fast switchable QSH states. By means of in-depth first-principles calculations, we demonstrate the large band gap and fast switchable QSH state in a newly introduced two-dimensional (2D) material family with 1T^prime-MGe2Z4 (M = Mo or W and Z = P or As). The theodynamically stable 1T^prime-MoGe2Z4 monolayers have a large energy gap around sim237 meV. These materials undergo a phase transition from a QSH insulator to a trivial insulator with a Rashba-like spin splitting under the influence of an out-of-plane electric field, demonstrating the tunability of the band gap and its band topology. Fast topological phase switching in a large gap 1T^prime-MoGe2Z4 QSH insulators has potential applications in low-power devices, quantum computation, and quantum communication. ",
        " The accurate theoretical description of the underlying electronic structures is essential for understanding the superconducting mechanism of iron-based superconductors. Compared to bulk FeSe, the superconducting single-layer FeSe/SrTiO3 films exhibit a distinct electronic structure consisting of only electron Fei pockets, due to the foation of a new band gap at the Brillouin zone (BZ) corners and an indirect band gap between the BZ center and corners. Although intensive studies have been carried out, the origin of such a distinct electronic structure and its connection to bulk FeSe remain unclear. Here we report a systematic study on the temperature evolution of the electronic structure in single-layer FeSe/SrTiO3 films by angle-resolved photoemission spectroscopy. A temperature-induced electronic phase transition was clearly observed at 200 K, above which the electronic structure of single-layer FeSe/SrTiO3 films restored to that of bulk FeSe, characterized by the closing of the new band gap and the vanishing of the indirect band gap. Moreover, the interfacial charge transfer effect induced band shift of ~ 60 meV was deteined for the first time. These observations not only show the first direct evidence that the electronic structure of single-layer FeSe/SrTiO3 films originates from bulk FeSe through a combined effect of an electronic phase transition and an interfacial charge transfer, but also provide a quantitative basis for theoretical models in describing the electronic structure and understanding the superconducting mechanism in single-layer FeSe/SrTiO3 films. ",
        " Magnetic ordering, as one of the most important characteristics in magnetic materials, could have significant influence on the band structure, spin dependent transport, and other important properties of materials. Its measurement, especially for the case of antiferromagnetic ordering, however, is generally difficult to be achieved. Here we demonstrate the feasibility of magnetic ordering detection using a noncontact and nondestructive optical method. Taking the compressive strained tetragonal BiFeO3 (BFO) as an example and combining density functional theory calculations with the minimal one-band tight-binding models, we find that when BFO changes from C1-type antiferromagnetic (AFM) phase to G-type AFM phase, the top of valance band shifts from the Z point to Gamma point, which makes the original direct band gap become indirect. This can be explained by the two-center Slater-Koster parameters using the Harrison approach. The impact of magnetic ordering on energy band dispersion dramatically changes the optical properties of tetragonal BFO. For the linear ones, the energy shift of the optical band gap could be as large as 0.4 eV. As for the nonlinear ones, the change is even larger. The second-haonic generation coefficient d33 of G-AFM becomes more than 13 times smaller than that of C1-type AFM case. Finally, we propose a practical way to distin-guish the C1- and G-type AFM of BFO using the optical method, which might be of great importance in next-generation infoation storage technologies and widens the potential application of BFO to optical switch. ",
        " The question of optical bandgap anisotropy in the monoclinic semiconductor beta-Ga2O3 was revisited by combining accurate optical absorption measurements with theoretical analysis, perfoed using different advanced computation methods. As expected, the bandgap edge of bulk beta-Ga2O3 was found to be a function of light polarization and crystal orientation, with the lowest onset occurring at polarization in the ac crystal plane around 4.5-4.6 eV; polarization along b unambiguously shifts the onset up by 0.2 eV. The theoretical analysis clearly indicates that the shift of the b onset is due to a suppression of the transition matrix elements of the three top valence bands at Gamma point. ",
        " Two-dimensional (2D) semiconductors with direct and modest bandgap and ultrahigh carrier mobility are highly desired functional materials for nanoelectronic applications. Herein, we predict that monolayer CaP3 is a new 2D functional material that possesses not only a direct bandgap of 1.15 eV (based on HSE06 computation), and also a very high electron mobility up to 19930 cm2 V-1 s-1, comparable to that of monolayer phosphorene. More remarkably, contrary to the bilayer phosphorene which possesses dramatically reduced carrier mobility compared to its monolayer counterpart, CaP3 bilayer possesses even higher electron mobility (22380 cm2 V-1 s-1) than its monolayer counterpart. The bandgap of 2D CaP3 can be tuned over a wide range from 1.15 to 0.37 eV (HSE06 values) through controlling the number of stacked CaP3 layers. Besides novel electronic properties, 2D CaP3 also exhibits optical absorption over the entire visible-light range. The combined novel electronic, charge mobility, and optical properties render 2D CaP3 an exciting functional material for future nanoelectronic and optoelectronic applications. ",
        " Optical bound states in the continuum (BIC) allow to totally prevent a photonic mode from radiating into free space along a given spatial direction. Polariton excitations derived from the strong radiation-matter interaction of a BIC with an excitonic resonance inherit an ultralong radiative lifetime and significant nonlinearities due to their hybrid nature. However, maximizing the light-matter interaction in these structures remains challenging, especially with 2D semiconductors, thus preventing the observation of room temperature nonlinearities of BIC polaritons. Here we show a strong light-matter interaction enhancement at room temperature by coupling monolayer WS2 excitons to a BIC, while optimizing for the electric field strength at the monolayer position through Bloch surface wave confinement. By acting on the grating geometry, the coupling with the active material is maximized in an open and flexible architecture, allowing to achieve a 100 meV photonic bandgap with the BIC in a local energy minimum and a record 70 meV Rabi splitting. Our novel architecture provides large room temperature optical nonlinearities, thus paving the way to tunable BIC-based polariton devices with topologically-protected robustness to fabrication imperfections. ",
        " XX'YZ equiatomic quaternary Heusler alloys (EQHA's) containing Cr, Al, and select Group IVB elements (textitM = Ti, Zr, Hf) and Group VB elements (textitN = V, Nb, Ta) were studied using state-of-the-art density functional theory to deteine their effectiveness in spintronic applications. Each alloy is classified based on their spin-dependent electronic structure as a half-metal, a spin gapless semiconductor, or a spin filter material. We predict several new fully-compensated ferrimagnetic spin filter materials with small electronic gaps and large exchange splitting allowing for robust spin polarization with small resistance. CrVZrAl, CrVHfAl, CrTiNbAl, and CrTiTaAl are identified as particularly robust spin filter candidates with an exchange splitting of sim 0.20 eV. In particular, CrTiNbAl and CrTiTaAl have exceptionally small band gaps of sim 0.10 eV. Moreover, in these compounds, a spin asymmetric electronic band gap is maintained in 2 of 3 possible atomic arrangements they can take, making the electronic properties less susceptible to random site disorder. In addition, hydrostatic stress is applied to a subset of the studied compounds in order to deteine the stability and tunability of the various electronic phases. Specifically, we find the CrAlVtextitM subfamily of compounds to be exceptionally sensitive to hydrostatic stress, yielding transitions between all spin-dependent electronic phases. ",
        " Using first principle calculations, we study the structural, optical and electronic properties of two-dimensional silicene-like structures of CSi7 (carbosilicene) and GeSi7 (geasilicene) monolayers. We show that both CSi7 and GeSi7 monolayers have different buckling that promises a new way to control the buckling in silicene-like structures. Carbon impurity decreases the silicene buckling, whereas geanium impurity increases it. The CSi7 has semiconducting properties with 0.25 eV indirect band gap, but GeSi7 is a semimetal. Also, under uniaxial tensile strain, the semiconducting properties of CSi7 convert to metallic properties which shows that CSi7 can be used in straintronic devices such as strain sensor and strain switch. There is no important response for GeSi7 under strain. The GeSi7 has higher dielectric constant relative to CSi7, silicene and graphene and it can be used as a 2D-material in high perfoance capacitors. Calculation of cohesive and foation energies show that CSi7 is more stable than GeSi7. Furtheore, we investigate the optical properties of these new materials and we show that CSi7 and GeSi7 can significantly increase the light absorption of silicene. The obtained results can pave a new route for tuning the electronic and optical properties of silicene like structures for different applications in nanoelectronic devices. ",
        " Recently, a new class of carbon allotrope called protomene was proposed. This new structure is composed of sp2 and sp3 carbon-bonds. Topologically, protomene can be considered as an sp3 carbon structure (~80% of this bond type) doped by sp2 carbons. First-principles simulations have shown that protomene presents an electronic bandgap of ~3.4 eV. However, up to now, its mechanical properties have not been investigated. In this work, we have investigated protomene mechanical behavior under tensile strain through fully atomistic reactive molecular dynamics simulations using the ReaxFF force field, as available in the LAMMPS code. At room temperature, our results show that the protomene is very stable and the obtained ultimate strength and ultimate stress indicates an anisotropic behavior. The highest ultimate strength was obtained for the x-direction, with a value of ~110 GPa. As for the ultimate strain, the highest one was for the z-direction (~25% of strain) before protomene mechanical fracture. ",
        " By a combination of the first-principles calculations and climbing image nudged elastic band method (ciNEB) we investigate structure stabilities and hydrogen evolution reaction (HER) perfoance of monolayer 2H-CrS2. The results suggest the free energy for the Volmer reaction in the monolayer 2H-CrS2 with S vacancy is 0.07 eV, comparable with Pt-based catalyst, and HER on the surface of the monolayer is prone to the Volmer-Heyrovsky mechanism with no energy barrier. We propose that high HER perfoance stems from the reduction of the energy level of d-band center. Additionally, the S vacancy leads to defect states in the middle of electronic bandgap and the reduction of potential barrier between the S atom layer and the vacuum, which is conducive to improve HER perfoance. ",
        " We investigate numerically the impact of the electron-phonon scattering on the optical properties of a perovskite material (CH3NH3PbI3). Using non-equilibrium Green functions foalism, we calculate the local density-of-states for several values of the electron-phonon scattering strength as well as in the case of ballistic transport. We report an Urbach-like penetration of the density-of-states in the bandgap due to scattering. The density-of-states expands deeper in the bandgap with the scattering strength. We deteine the electronic current contributions relative to photon absorption and photon emission. This allows to estimate the Urbach energy from the absorption coefficient below the bandgap. Values of Urbach energy up to 9.5 meV are obtained, meaning that scattering contribution to the total experimental Urbach energy of 15meV is quite important. The Urbach tail is generally attributed to the disorder of the system, leaving hope for further improvement. Yet, we show in this work that a significant contribution to the Urbach tail comes from carriers-phonon interactions, an intrinsic properties of the material which thus set a lower bound on the improvement margin. Finally, we estimate the open-circuit voltage Voc for a solar cell assuming such a material as an absorber. Voc losses increase with the scattering strength, up to 41 mV. This study then confis that scattering of electrons in perovskite material modifies the optical behaviour. ",
        " By coupling silicon nanowires (~150 nm diameter, 20 micron length) with an Omega-shaped plasmonic nanocavity we are able to generate broadband visible luminescence, which is induced by high-order hybrid nanocavity-surface plasmon modes. The nature of this super-bandgap emission is explored via photoluminescence spectroscopy studies perfoed with variable laser excitation energies (1.959 eV to 2.708 eV) and finite difference time domain simulations. Furtheore, temperature-dependent photoluminescence spectroscopy shows that the observed emission corresponds to radiative recombination of un-thealized (hot) carriers as opposed to a Resonant Raman process. ",
        " Ultra-small (r<2 nm) semiconductor quantum dots (QDs) have attracted attention for applications ranging from dye sensitized solar cells to sensing due to its tunable electronic structure and band gap, and large specific surface area. However obtaining monodisperse QDs and stabilization in this size regime remains a challenge. A recent report on digestive ripening of an oxide system showed substantial promise in addressing these requirements of QDs. In this work, we report a green solution, soft chemical (chimie douce) approach for synthesis of quasi-spherical, ultra-small, stable, and monodispersed copper oxide QDs (r<2 nm) based on digestive ripening (DR). It may be noted this is only the second transition metal oxide system in which DR is reported so far. DR involves the refluxing of polydispersed colloidal nanoparticles in the presence of surface active agents (e.g. triethanolamine (TEA)) that leads to fairly monodispersed nanoparticles. It has been noticed that capping with TEA results in reduction in the average particle diameter from 6 +/- 4 nm to 2.4 +/- 0.5 nm and an increase of zeta potential (xi) from +12 +/- 2 mV to +31 +/- 2 mV. These copper oxide QDs are monodispersed (size ~ 2.4 +/- 0.5 nm), and stable (>1 year). In addition, these quantum dots show an anomalous increase in band gap (5.3 eV), inexplicable using Brus' equation. XPS indicates that Cu exists in mixed valence state in this material. Based on our observations, we suggest that off-stoichiometry in copper oxide, which is seemingly substantial at these length scales, is responsible for the observed anomaly in band gap. ",
        " This work presents a theoretical study of the structural and electronic properties of bilayered silicon films under in-plane biaxial strain/stress using density functional theory. Atomic structures of the two-dimensional silicon films are optimized by using both the local-density approximation and generalized gradient approximation. In the absence of strain/stress, five buckled hexagonal honeycomb structures of the bilayered silicon film have been obtained as local energy minima and their structural stability has been verified. These structures present a Dirac-cone shaped energy band diagram with zero energy band gaps. Applying tensile biaxial strain leads to a reduction of the buckling height. Atomically flat structures with zero bucking height have been observed when the AA-stacking structures are under a critical biaxial strain. Increase of the strain between 10.7% ~ 15.4% results in a band-gap opening with a maximum energy band gap opening of ~168.0 meV obtained when 14.3% strain is applied. Energy band diagram, electron transmission efficiency, and the charge transport property are calculated. ",
        " The exciton recombination and spin dynamics in (In,Al)As/AlAs quantum dots (QDs) with indirect band gap and type-I band alignment are studied. The negligible (less than 0.2~mueV) value of the anisotropic exchange interaction in these QDs prevents a mixing of the excitonic basis states with pure spin and allows for the foation of spin polarized bright excitons for quasi-resonant circularly polarized excitation. In a longitudinal magnetic field, the recombination and spin dynamics of the excitons are controlled by the hyperfine interaction between the electron and nuclear spins. A QD blockade by dark excitons is observed in magnetic field eliminating the impact of the nuclear spin fluctuations. A kinetic equation model, which accounts for the population dynamics of the bright and dark exciton states as well as for the spin dynamics, has been developed, which allows for a quantitative description of the experimental data. ",
        " Molybdenum disulfide, MoS2, has recently gained considerable attention as a layered material where neighboring layers are only weakly interacting and can easily slide against each other. Therefore, mechanical exfoliation allows the fabrication of single and multi-layers and opens the possibility to generate atomically thin crystals with outstanding properties. In contrast to graphene, it has an optical gap of 1.9 eV. This makes it a prominent candidate for transistor and opto-electronic applications. Single-layer MoS2 exhibits remarkably different physical properties compared to bulk MoS2 due to the absence of interlayer hybridization. For instance, while the band gap of bulk and multi-layer MoS2 is indirect, it becomes direct with decreasing number of layers. In this review, we analyze from a theoretical point of view the electronic, optical, and vibrational properties of single-layer, few-layer and bulk MoS2. In particular, we focus on the effects of spin-orbit interaction, number of layers, and applied tensile strain on the vibrational and optical properties. We examine the results obtained by different methodologies, mainly ab initio approaches. We also discuss which approximations are suitable for MoS2 and layered materials. The effect of external strain on the band gap of single-layer MoS2 and the crossover from indirect to direct band gap is investigated. We analyze the excitonic effects on the absorption spectra. The main features, such as the double peak at the absorption threshold and the high-energy exciton are presented. Furtheore, we report on the phonon dispersion relations of single-layer, few-layer and bulk MoS2. Based on the latter, we explain the behavior of the Raman-active A1g and E^12g modes as a function of the number of layers. ",
        " Accurately predicting the physical and chemical properties of materials remains one of the most challenging tasks in material design, and one effective strategy is to construct a reliable data set and use it for training a machine learning model. In this study, we constructed a large-scale material genome database (Matgen) containing 76,463 materials collected from experimentally-observed database, and computed their bandgap properties through the Density functional theory (DFT) method with Perdew-Burke-Ernzehof (PBE) functional. We verified the computation method by comparing part of our results with those from the open Material Project (MP) and Open Quantum Materials Database (OQMD), all with PBE computations, and found that Matgen achieved the same computation accuracy based on both measured and computed bandgap properties. Based on the computed properties of our comprehensive dataset, we have developed a new graph-based deep learning model, namely CrystalNet, through our recently developed Communicative Message Passing Neural Network (CMPNN) framework. The model was shown to outperfo other state-of-the-art prediction models. A further fine-tuning on 1716 experimental bandgap values (CrystalNet-TL) achieved a superior perfoance with mean absolute error (MAE) of 0.77 eV on independent test, which has outperfoed the pure PBE (1.14~1.45 eV). Moreover, the model was proven applicable to hypothetical materials with MAE of 0.77 eV as referred by computations from HSE, a highly accurate quantum mechanics (QM) method, consist better than PBE (MAE=1.13eV). We also made material structures, computed properties by PBE, and the CrystalNet models publically available at https://matgen.nscc-gz.cn. ",
        " Recently, layered hybrid perovskites have been attracting huge interest due to a wide range of possible chemical compositions and the resulting tunability of the materials properties. In this study, we investigate the effect of the chain length of the organic ligands on the optical properties of stacks of two dimensional perovskite layers consisting of alkylammonium lead iodide (CnH2n+1NH3)2PbI4 with n=4-18. Photoluminescence and absorption spectroscopy reveal a blueshift with increasing chain length n including a jump of 110 meV between the n=10 and n=12 ligands due to a change in octahedral tilting. Using Xray diffraction (XRD) we deteine the crystal structure and find the octahedral tilting to be the main cause of this blueshift. However, for very short chain lengths additional effects further reduce the transition energy. Results of effective mass approximation model calculations show good agreement between the expected reduction of transition energy and measured photoluminescence emission wavelength for these samples. This highlights how octahedral tilting plays a major role in deteining the optical bandgap and suggests that miniband foation plays only a minor role in this material. ",
        " In this work, using a hybrid density functional theory (DFT) based calculation, we propose a new two-dimensional (2D) B-C-N material, g-B3C2N3, with the promising prospect of metal-free photocatalysis. A comprehensive investigation demonstrates that it is a near ultraviolet (UV) absorbing direct band gap (3.69 eV) semiconductor with robust dynamical and mechanical stability. Estimating the band positions with respect to water oxidation and hydrogen reduction potential levels, we observe that g-B3C2N3 monolayer shows the possibility to be used for hydrogen fuel generation through spontaneous solar water splitting, over a broad pH range. Upon biaxial strain application the band gap decreases with increase in tensile strain, leading to a subsequent red shift in absorption spectra, implying enhanced photon harvest under solar irradiation. Furtheore, due to a combined effect of band gap and work function variation, biaxial strain realigns the band positions, allowing one to control the reducing or oxidizing ability as per requirement to attain environmental sustainability. ",
        " In this paper, RF sputtered antimony vanadium oxide (SbVO4) thin films and its characterization are reported. High purity sputtering targets were fabricated by sintering a mixture of Sb2O3 and V2O5 powders. Thin films were deposited by reactive sputtering at various temperature and argon/oxygen partial pressures. Several growth parameters and surface chemistry were studied by applying numerous optical and electrochemical characterization technique. It is found that SbVO4 exhibits an indirect band gap in the range of 1.89 eV to 2.36 eV and has desirable valence band position to drive water oxidation reaction under illumination. The bandgap depends heavily on stoichiometry of the film and can be modulated by incorporating controlled amount of oxygen gas in plasma environment. Optimized SbVO4 photoanodes was designed and tested for photoelectrochemical water oxidation catalysis. Preliminary studies show that these electrodes possess n-type catalytic behavior in alkaline media. The prepared SbVO4 thin films, with typical film thickness was around 400 nm, contain nanoparticles having the sizes of 10-15 nm. ",
        " Cu2O nanorods have been deposited on soda-lime glass (SLG) substrates by the modified SILAR technique by varying the concentration of NaCl electrolyte into the precursor complex solution. The structural, electrical, and optical properties of synthesized Cu2O nanorod films have been studied by a variety of characterization tools. Structural analyses by XRD confied the polycrystalline Cu2O phase with (111) preferential growth. Raman scattering spectroscopic measurements conducted at room temperature also showed characteristic peaks of the pure Cu2O phase. The surface resistivity of the Cu2O nanorod films decreased from 15,142 to 685 Ohm.cm with the addition of NaCl from 0 to 4 mmol, and then exhibited an opposite trend with further addition of NaCl. The optical bandgap of the synthesized Cu2O nanorod films was observed as 1.88 - 2.36 eV, while the temperature-dependent activation energies of the Cu2O films were measured as about 0.14 - 0.21 eV. SEM morphologies demonstrated Cu2O nanorod as well as closely packed spherical grains with the alteration of NaCl concentration. The Cu2O phase of nanorods was found stable up to 230 0C corroborating the optical bandgap results of the same. The film fabricated in presence of 4 mmol of NaCl showed the lowest resistivity and activation energy as well comparatively unifo nanorod morphology. Our studies demonstrate that the nominal presence of NaCl electrolytes in the pre-cursor solutions has a significant impact on the physical properties of Cu2O nanorod films which could be beneficial in optoelectronic research. ",
        " We use density functional theory and the van der Waals density functional (vdW-DF) method to deteine the binding separation in bilayer and bulk graphane and study the changes in electronic band structure that arise with the multilayer foation. The calculated binding separation (distance between center-of-mass planes) and binding energy are 4.5-5.0 AA (4.5-4.8 AA) and 75-102 meV/cell (93-127 meV/cell) in the bilayer (bulk), depending on the choice of vdW-DF version. We obtain the corresponding band diagrams using calculations in the ordinary generalized gradient approximation for the geometries specified by our vdW-DF results, so probing the indirect effect of vdW forces on electron behavior. We find significant band-gap modifications by up to -1.2 eV (+4.0 eV) in various regions of the Brillouin zone, produced by the bilayer (bulk) foation. ",
        " We present a study of the theodynamic and physical properties of Tl5Te3, BiTl9Te6 and SbTl9Te6 compounds by means of density functional theory based calculations. The optimized lattice constants of the compounds are in good agreement with the experimental data. The electronic density of states and band structures are calculated to understand the bonding mechanism in the three compounds. The indirect band gap of BiTl9Te6 and SbTl9Te6 compounds are found to be equal to 0.256 eV and 0.374 eV, respectively. The spin-orbit coupling has important effects on the electronic structure of the two semiconducting compounds and should therefore be included for a good numerical description of these materials. The elastic constants of the three compounds have been calculated, and the bulk modulus, shear modulus, and young's modulus have been deteined. The change from ductile to brittle behavior after Sb or Bi alloying is related to the change of the electronic properties. Finally, the Debye temperature, longitudinal, transverse and average sound velocities have been obtained. ",
        " In this work, we present a systematic first-principles density-functional theory based study of geometry, electronic structure, and optical properties of achair phosphorene nanoribbons (APNRs), with the aim of understanding the influence of edge passivation. Ribbons of width ranging from 0.33 nm to 3.8 nm were considered, with their edges functionalized with the groups H, OH, F, Cl, S, and Se. The geometries of various APNRs were optimized, and the stability was checked by calculating their foation energies. Using the relaxed geometries, calculations of their band structure and optical properties were perfoed. Pristine APNRs, as expected, exhibit significant edge reconstruction, rendering them indirect band gap semiconductors, except for one width noalsize(N=5, where N is the width parameter) for which a direct band gap is observed. The edge passivated APNRs are found to be direct band gap semiconductors, with the band gap at the Gamma-point, for all the functional groups considered in this work. To obtain accurate estimates of band gaps, calculations were also perfoed using HSE06 hybrid functional for several APNRs. Our calculations reveal that functional groups have significant influence on the band gaps and optical properties of narrower APNRs. For wider passivated ribbons, with the increasing ribbon widths, the gaps converge to almost the same value, irrespective of the group. We also perfoed calculations including the spin-orbit coupling (SOC) for hydrogen passivated APNRs with N=5 and 11. We found that SOC has no significant influence on the band structure of the studied APNRs. However, for the broader APNR, a lowering of peak intensities was observed in the optical absorption spectrum beyond 5 eV. ",
        " The semiconducting half Heusler compound YPtSb was predicted theoretically to be capable of changing into topological insulator under proper strain. In this work, p type semiconducting half-Heusler YPtSb thin films were prepared by magnetron co-sputtering method from a specially designed target for the first time. Textured structure with (111) plane paralleling with (001) of MgO substrate was observed when YPtSb thin films were grown on MgO (100) substrate at 600degC.Electrical measurements show that the resistivity of YPtSb films decreases with increasing temperature, indicating a semiconductor-like behavior. The carrier density is as high as 1.15 X 10^21 cm-3 at 300 K. The band gap of YPtSb thin films obtained by infrared spectroscopy is around 0.1 - 0.15 eV, which is well in agreement with the theoretical prediction and the value measured in bulk YPtSb. ",
        " The quasiparticle spectra of atomically thin semiconducting transition metal dichalcogenides (TMDCs) and their response to an ultrafast optical excitation critically depend on interactions with the underlying substrate. Here, we present a comparative time- and angle-resolved photoemission spectroscopy (TR-ARPES) study of the transient electronic structure and ultrafast carrier dynamics in the single- and bilayer TMDCs MoS2 and WS2 on three different substrates: Au(111), Ag(111) and graphene/SiC. The photoexcited quasiparticle bandgaps are observed to vary over the range of 1.9-2.3 eV between our systems. The transient conduction band signals decay on a sub-100 fs timescale on the metals, signifying an efficient removal of photoinduced carriers into the bulk metallic states. On graphene, we instead observe two timescales on the order of 200 fs and 50 ps, respectively, for the conduction band decay in MoS2. These multiple timescales are explained by Auger recombination involving MoS2 and in-gap defect states. In bilayer TMDCs on metals we observe a complex redistribution of excited holes along the valence band that is substantially affected by interactions with the continuum of bulk metallic states. ",
        " Tunneling atomic force microscopy (TUNA) was used at ambient conditions to measure the current-voltage (I-V) characteristics at clean surfaces of highly oriented graphite samples with Bernal and rhombohedral stacking orders. The characteristic curves measured on Bernal-stacked graphite surfaces can be understood with an ordinary self-consistent semiconductor modeling and quantum mechanical tunneling current derivations. We show that the absence of a voltage region without measurable current in the I-V spectra is not a proof of the lack of an energy band gap. It can be induced by a surface band bending due to a finite contact potential between tip and sample surface. Taking this into account in the model, we succeed to obtain a quantitative agreement between simulated and measured tunnel spectra for band gaps (12 ldots 37),meV, in agreement to those extracted from the exponential temperature decrease of the longitudinal resistance measured in graphite samples with Bernal stacking order. In contrast, the surface of relatively thick graphite samples with rhombohedral stacking reveals the existence of a maximum in the first derivative dI/dV, a behavior compatible with the existence of a flat band. The characteristics of this maximum are comparable to those obtained at low temperatures with similar techniques. ",
        " Compared to traditional pn-junction photovoltaics, hot carrier solar cells offer potentially higher efficiency by extracting work from the kinetic energy of photogenerated \"hot carriers\" before they cool to the lattice temperature. Hot carrier solar cells have been demonstrated in high-bandgap ferroelectric insulators and GaAs/AlGaAs heterostructures, but so far not in low-bandgap materials, where the potential efficiency gain is highest. Recently, a high open-circuit voltage was demonstrated in an illuminated wurtzite InAs nanowire with a low bandgap of 0.39 eV, and was interpreted in tes of a phototheoelectric effect. Here, we point out that this device is a hot carrier solar cell and discuss its perfoance in those tes. In the demonstrated devices, InP heterostructures are used as energy filters in order to theoelectrically harvest the energy of hot electrons photogenerated in InAs absorber segments. The obtained photovoltage depends on the heterostructure design of the energy filter and is therefore tunable. By using a high-resistance, theionic barrier an open-circuit voltage is obtained that is in excess of the Shockley-Queisser limit. These results provide generalizable insight into how to realize high voltage hot carrier solar cells in low-bandgap materials, and therefore are a step towards the demonstration of higher efficiency hot carrier solar cells. ",
        " The spinel cobalt oxide Co3O4 is a magnetic semiconductor containing cobalt ions in Co2+ and Co3+ oxidation states. We have studied the electronic, magnetic and bonding properties of Co3O4 using density functional theory (DFT) at the Generalized Gradient Approximation (GGA), GGA+U, and PBE0 hybrid functional levels. The GGA correctly predicts Co3O4 to be a semiconductor, but severely underestimates the band gap. The GGA+U band gap (1.96 eV) agrees well with the available experimental value (~ 1.6 eV), whereas the band gap obtained using the PBE0 hybrid functional (3.42 eV) is strongly overestimated. All the employed exchange-correlation functionals predict 3 unpaired d electrons on the Co2+ ions, in agreement with crystal field theory, but the values of the magnetic moments given by GGA+U and PBE0 are in closer agreement with the experiment than the GGA value, indicating a better description of the cobalt localized d states. Bonding properties are studied by means of Maximally Localized Wannier Functions (MLWFs). We find d-type MLWFs on the cobalt ions, as well as Wannier functions with the character of sp3d bonds between cobalt and oxygen ions. Such hybridized bonding states indicate the presence of a small covalent component in the primarily ionic bonding mechanism of this compound. ",
        " We employed first-principles density-functional theory (DFT) calculations to characterize Dirac electrons in quasi-two-dimensional molecular conductor alpha-(BETS)2I3 [= alpha-(BEDT-TSeF)2I3] at a low temperature of 30K. We provide a tight-binding model with inteolecular transfer energies evaluated from maximally localized Wannier functions, where the number of relevant transfer integrals is relatively large due to the delocalized character of Se p orbitals. The spin-orbit coupling gives rise to an exotic insulating state with an indirect band gap of about 2 meV. We analyzed the energy spectrum with a Dirac cone close to the Fei level to develop an effective Hamiltonian with site-potentials, which reproduces the spectrum obtained by the DFT band structure. ",
        " We report the application of a coordination polymer semiconductor, tin(II) thiocyanate [Sn(SCN)2] as an ultrathin anode interlayer in organic photovoltaics (OPVs). Sub-10 nm layers of Sn(SCN)2 with high smoothness and excellent transparency having an optical band gap of 3.9 eV were deposited from an alcohol-based solution at room temperature without post-deposition annealing. Inserting Sn(SCN)2 as an anode interlayer in polymer:fullerene OPVs drastically reduces the recombination loss due to the exciton-blocking energy levels of Sn(SCN)2. At the optimum thickness of 7 nm, an average power conversion efficiency (PCE) of 7.6% and a maximum of 8.1% were obtained. The simple processability using common solvents gives Sn(SCN)2 a distinct advantage over the more well-known copper(I) thiocyanate (CuSCN). The electronic and optical properties of Sn(SCN)2 make it interesting for applications in large-area electronic devices. ",
        " Due to high binding energy and oscillator strength, excitons in thin flakes of transition metal dichalcogenides constitute a perfect foundation for realizing a strongly coupled light-matter system. In this paper we investigate mono- and few-layer WSe2 flakes encapsulated in hexagonal boron nitride and incorporated into a planar dielectric cavity. We use an open cavity design which provides tunability of the cavity mode energy by as much as 150 meV. We observe a strong coupling regime between the cavity photons and the neutral excitons in direct-bandgap monolayer WSe2, as well as in few-layer WSe2 flakes exhibiting indirect bandgap. We discuss the dependence of the exciton's oscillator strength and resonance linewidth on the number of layers and predict the exciton-photon coupling strength. ",
        " Simulations of defects in paramagnetic materials at high temperature constitute a foidable challenge to solid state theory due to the interaction of magnetic disorder, vibrations, and structural relaxations. CrN is a material where these effects are particularly large due to a strong magneto-lattice coupling and a tendency for deviations from the nominal 1:1 stoichiometry. In this work we present a first-principles study of nitrogen vacancies and nitrogen interstitals in CrN at elevated temperature. We report on foation energetics, the geometry of interstital nitrogen dimers, and impact on the electronic structure caused by the defects. We find a vacancy foation energy of 2.28 eV with a small effect of temperature, a foation energy for N interstitial in the fo of a big<111big> oriented split-bond of 3.77 eV with an increase to 3.97 at 1000 K. Vacancies are found to add three electrons while split bond interstitial adds one electron to the conduction band. The band gap of defect-free CrN is smeared out due to vibrations, though it is difficult to draw conclusion about the exact temperature at which the band gap closes from our calculations. However, it is clear that at 900 K there is a non-zero density of electronic states at the Fei level. At 300 K our results indicate a boarder case were the band-gap is about to close. ",
        " On basis of the first principle calculation we show that a crystalline structure of silicon, as a novel allotrope with nanotubular holes along two perpendicular directions, is stable. The calculations on geometrical and electronic properties reveal that this allotrope possesses a direct band gap wider by 0.5eV than the indirect one of silicon with diamond structure. The crystal belongs to I41/AMD space group, showing anisotropic optical properties and Young modulus. The bulk modulus is 64.4GPa and the density is 1.9g/cm^3, lower than that of the diamond silicon due to the presence of nanotubular holes. It is hopeful that the allotrope may widely expand applications of silicon in many fields due to its direct band gap and specific nanotubular structure. ",
        " Borophene has triggered a surge of interest due to its outstanding properties including mechanical flexibility, polymorphism, and opto-electrical anisotropy. Very recently, a novel semi-hydrogenated borophene, called alpha'-4H, was synthesized in large-scale freestanding samples, which exhibits excellent air-stability and semiconducting nature. Herein, using the density functional theory (DFT) and many-body perturbation theory (MBPT), we investigate the electronic and excitonic optical properties of alpha'-4H borophene. The DFT results reveal that by breaking the mirror symmetry and increasing the buckling height of pure alpha'-borophene, hydrogenation causes an orbital hybridization and opens an indirect band gap of 1.49 eV in alpha'-4H borophene. This value is corrected to be 1.98, 2.23, and 2.52 eV under the G0W0, GW0, and GW levels of theory, respectively. The optical spectrum achieved from solving the Bethe-Salpeter equation shows an optical band gap of 2.40 eV, which corresponds to a strongly bound and stable bright exciton with a binding energy of 1.18 eV. More importantly, the excitonic states are robust against tension up to 10%, where the monolayer is dynamically stable. We also design and study the bilayer alpha'-4H borophene with different stackings. For the weak van der Waals interactions between the layers, the bilayer can preserve most of the structural and electronic properties of the monolayer. Our study exposes the underlying physics behind the structural, electronic, and optical properties of alpha'-4H borophene and suggests it as a very promising candidate for flexible optoelectronic applications. ",
        " The electronic and structural properties of Janus MoSSe/MoX2 (X=S,Se) in-plane heterojunctions, endowed with single-atom vacancies, were studied using density functional theory calculations. The stability of these structures was verified from cohesion energy calculations. Results showed that single-atom vacancies induce the appearance of flat midgap states, and a substantial amount of charge is localized in the vicinity of these defects. As a consequence, these heterojunctions presented an intrinsic dipole moment. No bond reconstructions were noted by removing an atom from the lattice, regardless of its chemical species. Our calculations predicted indirect electronic bandgap values between 1.6-1.7 eV. ",
        " In this letter, we propose the resonant tunneling diode (RTD) based on a double-barrier graphene/boron nitride (BN) heterostructure as device suitable to take advantage of the elaboration of atomic sheets containing different domains of BN and C phases within a hexagonal lattice. The device operation and perfoance are investigated by means of a self- consistent model within the non-equilibrium Green's function foalism on a tight-binding Hamiltonian. This RTD exhibits a negative differential conductance effect which involves the resonant tunneling through both the electron and hole bound states of the graphene quantum well. It is shown that the peak- to-valley ratio can reach the value of 4 at room temperature for gapless graphene and the value of 13 for a bandgap of 50 meV. ",
        " Muscovite mica sheets with a thickness of 25 mum were irradiated by various kinds of swift heavy ions (Sn, Xe and Bi) in HIRFL. The fluences ranged from 1times10^10 ions/cm^2 to 8times10^11 ions/cm^2. The electronic energy loss (dE/dx)e was increased from 14.7 keV/nm to 31.2 keV/nm. The band gap and Urbach energy of pristine and irradiated mica were analyzed by ultraviolet- visible spectroscopy. Periodic fringes in long wave length of the absorption spectra caused by interference phenomenon, were disturbed as the (dE/dx)e increased. It was suggested that the chemical bonds between Tetrahedral-Octohedral-Tetrahedral (TOT) layers of mica were destroyed. Thus the smooth surface was cleaved after irradiation. The band gap was narrowed down with the increasing (dE/dx)e and fluences. The values of Urbach energy were increased as the (dE/dx)e and fluences gradually increased. It was indicated that the amount of defects and the proportion of amorphous structure were increased in mica irradiated under increased (dE/dx)e and fluences. Fluences took a distinctly important role in optical properties of mica. ",
        " In this study, we have delineated the preparation and influence of Fe doping on microstructural and optical properties of the pristine and Fe incorporated TiO2 thin film with different Fe concentrations (0, 2, 4, 6, and 8 at.% ). The samples are prepared by easier and cost-saving way of spray pyrolysis technique (SPT) using Ti(OCH2CH2CH2CH3)4 as a precursor of mother material. The effect of Fe in the microstructure and phase foation of TiO2 thin films is investigated by XRD analysis. XRD investigation depicts that the pristine product corresponds to anatase phase of TiO2 and remains uncontaminated with addition of 2 at.% Fe impurity. It is also observed that Fe introduces a phase transition from anatase to rutile after adulterating more Fe contents (4, 6 and 8 at.%). In order to study optical characteristics, UVvis spectroscopy has been employed which revels that UV absorption for the Fe incorporated TiO2 products are noticed to move to a longer wavelength (red shift) and Fe contents lessen bandgap energy from 3.81eV (0 at.% Fe) to 3.70 eV (8 at.% Fe) of the TiO2 thin films. The impact of Fe on the optical constants such as refractive index, complex dielectric constants, tandelta, VELF and SELF, dispersion parameters of obtained titanium dioxide samples has been studied. The results display that Fe influences the structural and optical characteristics significantly. ",
        " High quality WSe2 films have been grown on bilayer graphene (BLG) with layer-by-layer control of thickness using molecular beam epitaxy (MBE). The combination of angle-resolved photoemission (ARPES), scanning tunneling microscopy/spectroscopy (STM/STS), and optical absorption measurements reveal the atomic and electronic structures evolution and optical response of WSe2/BLG. We observe that a bilayer of WSe2 is a direct bandgap semiconductor, when integrated in a BLG-based heterostructure, thus shifting the direct-indirect band gap crossover to trilayer WSe2. In the monolayer limit, WSe2 shows a spin-splitting of 475 meV in the valence band at the K point, the largest value observed among all the MX2 (M = Mo, W; X = S, Se) materials. The exciton binding energy of monolayer-WSe2/BLG is found to be 0.21 eV, a value that is orders of magnitude larger than that of conventional 3D semiconductors, yet small as compared to other 2D transition metal dichalcogennides (TMDCs) semiconductors. Finally, our finding regarding the overall modification of the electronic structure by an alkali metal surface electron doping opens a route to further control the electronic properties of TMDCs. ",
        " This is a report on the new 122 ternary transition-metal pnictide of BaMn2Bi2, which is crystallized from bismuth flux. BaMn2Bi2 adopts ThCr2Si2-type structure (I4/mmm) with a = 4.4902(3) AA and c = 14.687(1) AA; it is antiferromagnetic with anisotropic magnetic susceptibility and semiconducting with a band gap of Eg = 6 meV. Heat capacity result confis the insulating ground state in BaMn2Bi2 with the electronic residual Sommerfeld coefficient of gamma ~ 0. The high temperature magnetization results show that magnetic ordering temperature is TN ~ 400 K. Hole-doping in BaMn2Bi2 via potassium in Ba1-xKxMn2Bi2 results in metallic behavior for x = 0.10(1), 0.32(1) and 0.36(1). With K-doping, more magnetically anisotropic behavior is observed. Although there is a downturn in electrical resistivity and low-field magnetization data below 4 K in > 30%-doped crystals, there is no sign of zero resistance or diamagnetism. This manuscript is a report on new materials of BaMn2Bi2 and Ba1-xKxMn2Bi2 (0 < x < 0.4). Results from powder X-ray diffraction, anisotropic temperature- and field-dependent magnetization, temperature-and field-dependent electrical resistivity, and heat capacity are presented. ",
        " In order to fully exploit the potential of transition metal dichalcogenide monolayers (TMD-MLs), the well-controlled creation of atomically sharp lateral heterojunctions within these materials is highly desirable. A promising approach to create such heterojunctions is the local modulation of the electronic structure of an intrinsic TMD-ML via dielectric screening induced by its surrounding materials. For the realization of this non-invasive approach, an in-depth understanding of such dielectric effects is required. We report on the modulations of excitonic transitions in TMD-MLs through the effect of dielectric environments including low-k and high-k dielectric materials. We present absolute tuning ranges as large as 37 meV for the optical band gaps of WSe 2 and MoSe 2 MLs and relative tuning ranges on the order of 30% for the binding energies of neutral excitons in WSe 2 MLs. The findings suggest the possibility to reduce the electronic band gap of WSe 2 MLs by 120 meV, paving the way towards dielectrically defined lateral heterojunctions. ",
        " In this work, we have investigated the electronic structure and theoelectric properties of quaternary heusler alloy, FeRuTiSi, using first principle DFT tools implemented in WIEN2k and BoltzTraP code. Electronic structure calculations using TB-mBJ potential shows appearance of flat band at the conduction band edge, thus electron in conduction band have the large effective mass (me*), and therefore mainly contribute for negatively large value of Seebeck coefficient (S). This alloy has indirect band gap of 0.59 eV, and shows the n-type transport behavior. Under the constant relaxation time approximation (tau = 10 -14 s), temperature dependent Seebeck coefficient, electrical conductivity (sigma), and electronic theal conductivity (ke) were also estimated. The maximum figure-of-merit (ZT), for the FeRuTiSi compound is found to be ~0.86 at 840 K, with n-type doping, which suggests that this quaternary alloy can be a good candidate among the n-type material for theoelectric applications in high-temperature reg ",
        " Tin fluoride (SnF2) is an indispensable additive for high-efficiency Pb-Sn perovskite solar cells (PSCs). However, the spatial distribution of SnF2 in the perovskite absorber is seldom investigated while essential for a comprehensive understanding of the exact role of the SnF2 additive. Herein, we revealed the spatial distribution of SnF2 additive and made structure-optoelectronic properties-flexible photovoltaic perfoance correlation. We observed the chemical transfoation of SnF2 to a fluorinated oxy-phase on the Pb-Sn perovskite film surface, due to its rapid oxidation. In addition, at the buried perovskite interface, we detected and visualized the accumulation of F- ions. We found that the photoluminescence quantum yield of Pb-Sn perovskite reached the highest value with 10 mol% SnF2 in the precursor solution. When integrating the optimized absorber in flexible devices, we obtained the flexible Pb-Sn perovskite narrow bandgap (1.24 eV) solar cells with an efficiency of 18.5% and demonstrated 23.1%-efficient flexible 4-teinal all-perovskite tandem cells. ",
        " We report calculations of the electronic structure of CaB6 using the weighted density approximation (WDA) to density functional theory. We find a semiconducting band structure with a sizable gap, in contrast to local density approximation (LDA) results, but in accord with recent experimental data. In particular, we find an X-point band gap of 0.8 eV. The WDA correction of the LDA error in describing the electronic structure of CaB6 is discussed in tes of the orbital character of the bands and the better cancelation of self-interactions within the WDA. ",
        " Hitting hard on the binary halides yields in the foation of Cs2[AgIn]Br6. The lead-free double perovskite marks, although not usable itself, a further step forward in finding sustainable and durable perovskite materials for photovoltaic applications. Cs2[AgIn]Br6 is one of the prominent examples of double perovskites materials that have been suggested to circumvent the use of lead compounds in perovskite solar cells. We herein report the successful synthesis of the material using a mechanochemical approach. It crystallizes in an elpasolite-type structure, an ordered perovskite superstructure, with a cell parameter of a = 11.00 AA. However, the compound exhibits a relatively large optical bandgap of 2.36 eV and is unstable under illumination, which impedes its use as solar absorber material at this early stage. Still, substitution of lead and the potential of this synthesis method are promising as well as the fruitful combination of theoretical considerations with experimental materials discovery. ",
        " The band structure of fully hydrogenated Si nanosheets and nanotubes are elucidated by the use of an empirical tight-binding model. The hydrogenated Si sheet is a semiconductor with indirect band gap of about 2.2 eV. The symmetries of the wave functions allow us to explain the origin of the gap. We predict that, for certain chiralities, hydrogenated Si nanotubes represent a new type of semiconductor, one with co-existing direct and indirect gaps of exactly the same magnitude. This behavior is different from the Hamada rule established for non-hydrogenated carbon and silicon nanotubes. Comparison to an ab initio calculation is made. ",
        " Two-dimensional (2D) topological insulators (TIs) with a large bulk band-gap are promising for experimental studies of the quantum spin Hall effect and for spintronic device applications. Despite considerable theoretical efforts in predicting large-gap 2D TI candidates, only few of them have been experimentally verified. Here, by combining scanning tunneling microscopy/spectroscopy and angle-resolved photoemission spectroscopy, we reveal that the top monolayer of ZrTe5 crystals hosts a large band gap of ~100 meV on the surface and a finite constant density-of-states within the gap at the step edge. Our first-principles calculations confi the topologically nontrivial nature of the edge states. These results demonstrate that the top monolayer of ZrTe5 crystals is a large-gap 2D TI suitable for topotronic applications at high temperature. ",
        " The HAYSTAC experiment utilizes a tunable resonant microwave cavity to search for dark matter axions. We report on the system and the results from Phase I of the experiment. This phase relied on a 9 T magnet, Josephson parametric amplifiers, and a dilution refrigerator for the operation of the experiment. Axion models with two photon coupling gagammagammagtrsim2times 10^-14 mathGeV were excluded in the 23.15<ma<24.0 mathmu eV mass range. Phase II of the experiment will include upgrades to the cryogenics system and a new squeezed-state receiver. Finally, we discuss work on multi-rod cavities and photonic band gap resonators for higher frequency operation. ",
        " Quantifying charge-state transition energy levels of impurities in semiconductors is critical to understanding and engineering their optoelectronic properties for applications ranging from solar photovoltaics to infrared lasers. While these transition levels can be measured and calculated accurately, such efforts are time-consuming and more rapid prediction methods would be beneficial. Here, we significantly reduce the time typically required to predict impurity transition levels using multi-fidelity datasets and a machine learning approach employing features based on elemental properties and impurity positions. We use transition levels obtained from low-fidelity (i.e., local-density approximation or generalized gradient approximation) density functional theory (DFT) calculations, corrected using a recently proposed modified band alignment scheme, which well-approximates transition levels from high-fidelity DFT (i.e., hybrid HSE06). The model fit to the large multi-fidelity database shows improved accuracy compared to the models trained on the more limited high-fidelity values. Crucially, in our approach, when using the multi-fidelity data, high-fidelity values are not required for model training, significantly reducing the computational cost required for training the model. Our machine learning model of transition levels has a root mean squared (mean absolute) error of 0.36 (0.27) eV vs high-fidelity hybrid functional values when averaged over 14 semiconductor systems from the II-VI and III-V families. As a guide for use on other systems, we assessed the model on simulated data to show the expected accuracy level as a function of bandgap for new materials of interest. Finally, we use the model to predict a complete space of impurity charge-state transition levels in all zinc blende III-V and II-VI systems. ",
        " Mechanical control of electronic and magnetic properties of 2D Van-der-Waals heterostructures gives new possibilities for further development of spintronics and infoation-related technologies. Using the density functional theory, we investigate the structural, electronic, and magnetic properties of silicene monolayer with substituted Chromium atoms and under a small biaxial strain (-6%< epsilon < 8%). Our results indicate that the Cr-doped silicene nanosheets without strain have magnetic metallic, half-metallic or semiconducting properties depending on the type of substitution. We also show that the magnetic moments associated with the monomer and vertical dimer substitutions change very weakly with strain. However, the magnetic moment associated with the horizontal dimer substitution decreases when either compressive or tensile strain is applied to the system. Additionally, we show that the largest semiconductor band-gap is approximately 0.13 eV under zero strain for the vertical Cr-doped silicene. Finally, biaxial compressive strain leads to irregular changes in the magnetic moment for Cr vertical dimer substitution. ",
        " This paper investigates some of the successes and failures of density functional theory in the study of high-pressure solid hydrogen at low temperature. We calculate the phase diagram, metallization pressure, phonon spectrum, and proton zero-point energy using three popular exchange-correlation functionals: the local density approximation (LDA), the Perdew-Burke-Ernzerhof (PBE) generalized gradient approximation, and the semi-local Becke-Lee-Yang-Parr (BLYP) functional. We focus on the solid molecular P63/m, C2/c, Cmca-12, and Cmca structures in the pressure range from 100<P<500 GPa over which phases I, II and III are observed experimentally. At the static level of theory, in which proton zero-point energy is ignored, the LDA, PBE and BLYP functionals give very different structural transition and metallization pressures, with the BLYP phase diagram in better agreement with experiment. Nevertheless, all three functionals provide qualitatively the same infoation about the band gaps of the four structures and the phase transitions between them. Going beyond the static level, we find that the frequencies of the vibron modes observed above 3000 cm^-1 depend strongly on the choice of exchange-correlation functional, although the low-frequency part of the phonon spectrum is little affected. The largest and smallest values of the proton zero-point energy, obtained using the BLYP and LDA functionals, respectively, differ by more than 10 meV/proton. Including the proton zero-point energy calculated from the phonon spectrum within the haonic approximation improves the agreement of the BLYP and PBE phase diagrams with experiment. Taken as a whole, our results demonstrate the inadequacy of mean-field-like density functional calculations of solid molecular hydrogen in phases I, II and III and emphasize the need for more sophisticated methods. ",
        " We calculate the electron-phonon scattering and binding in semiconducting carbon nanotubes, within a tight binding model. The mobility is derived using a multi-band Boltzmann treatment. At high fields, the dominant scattering is inter-band scattering by LO phonons corresponding to the corners K of the graphene Brillouin zone. The drift velocity saturates at approximately half the graphene Fei velocity. The calculated mobility as a function of temperature, electric field, and nanotube chirality are well reproduced by a simple interpolation foula. Polaronic binding give a band-gap renoalization of ~70 meV, an order of magnitude larger than expected. Coherence lengths can be quite long but are strongly energy dependent. ",
        " Based on the relativistic spin-polarized density functional theory calculations we investigate the crystal structure, electronic and magnetic properties of a family MnPn2Ch4 compounds, where pnictogen metal atoms (Pn) are Sb and Bi; chalcogens (Ch) are Se, Te. We show that in the series the compounds of this family with heavier elements prefer to adopt rhombohedral crystal structure composed of weakly bonded septuple monoatomic layers while those with lighter elements tend to be in the monoclinic structure. Irrespective of the crystal structure all compounds of the MnPn2Ch4 series demonstrate a weak energy gain (of a few meV per foula unit or even smaller than meV) for antiferromagnetic (AFM) coupling for magnetic moments on Mn atoms with respect to their ferromagnetic (FM) state. For rhombohedral structures the interlayer AFM coupling is preferable while in monoclinic phases intralayer AFM configuration with ferromagnetic ordering along the Mn chain and antiferromagnetic ordering between the chains has a minimum energy. Over the series the monoclinic compounds are characterized by substantially wider bandgap than compounds with rhombohedral structure. ",
        " By means of first-principles calculations, we predict a new 2D QSH insulator in the porous allotrope of Bismuth monolayer, bismuthylene, its dynamics stability being confied by phonon spectrum and molecular dynamics simulations. The analyses of electronic structures reveal that it is a native QSH state with a gap much as large as 0.29 eV at the Gamma point, which is larger than the buckled (0.2 eV) and flattened (0.2 eV) bismuth, Bi4Br4 (0.18 eV), as well as stanene (0.1 eV), also more stable energetically than these systems. Interestingly, the bismuthylene has tunable band gaps and nontrivial band topology under strains within -6 - 5 % and electric fields up to 0.8 eV/AA. Furtheore, a tight-binding model is constructed to explain the low-energy physics behind band topology induced by spin-orbit coupling. We also propose a quantum well by sandwiching bismuthylene between two BN sheets and reveals that this structure remains topologically nontrivial with a sizeable band gap. This findings on QSH effect of bismuthylene provide a viable platfo in new generation of dissipationless electronics and spintronics devices. ",
        " We study the charge state of the diffusing O2 molecule during silicon oxidation through hybrid functional calculations. We calculate charge transition levels of O2 in bulk SiO2 and use theoretical band offsets to align these levels with respect to the Si band edges. To overcome the band-gap problem of semilocal density fuctionals, we employ hybrid functionals with both predefined and empirically adjusted mixing coefficients. We find that the charge transition level epsilon^0/- in bulk SiO2 occurs at sim1.1 eV above the silicon conduction band edge, implying that the O2 molecule diffuses through the oxide in the neutral charge state. While interfacial effects concur to lower the charge transition level, our estimates suggest that the neutral charge state persists until silicon oxidation. ",
        " Current nonlinear optical materials face a conventional limitation on the tradeoff between band gap and birefringence, especially in the deep UV spectral region. To circumvent such a dilemma, we propose a general principle, a pi-conjugated confinement, to partially decouple the inter group pi-conjugated interactions with the separation of a non-pi-conjugated group so as to maximize the band gap in comparison with those of simple pi-conjugated salts, such as borates, carbonates. Meanwhile, to maintain a large optical anisotropy. We uncover that the pi-conjugated confinement is a shared structural feature for all the known DUV NLO materials with favorable properties (45 compounds), and thus, it provides an essential design criterion. Guided by this principle, the carbonophosphate is predicted theoretically for the first time as a promising DUV candidate system, Sr3Y[PO4][CO3]3 and Na3X[PO4][CO3] (X = Ba, Sr, Ca, Mg) exhibit an enhanced birefringence that is 3-24 times larger than that of the simple phosphate, as well as an increased band gap that is 0.2-1.7 eV wider than that of the simple carbonate. Especially, the shortest SHG output of Sr3Y[PO4][CO3]3 is at lambdaPM = 181 nm, being the shortest one among phosphates to date. ",
        " Ga2O3 and (AlxGa1-x)2O3 alloys are promising materials for solar-blind UV photodetectors and high-power transistors. Basic key parameters in the device design, such as band gap variation with alloy composition and band offset between Ga2O3 and (AlxGa1-x)2O3, are yet to be established. Using density functional theory with the HSE hybrid functional, we compute foation enthalpies, band gaps, and band edge positions of (AlxGa1-x)2O3 alloys in the monoclinic (beta) and corundum (alpha) phases. We find the foation enthlapies of (AlxGa1-x)2O3 alloys are significantly lower than of (InxGa1-x)2O3, and that (AlxGa1-x)2O3 with x=0.5 can be considered as an ordered compound AlGaO3 in the monoclinic phase, with Al occupying the octahedral sites and Ga occupying the tetrahedral sites. The direct band gaps of the alloys range from 4.69 to 7.03 eV for beta-(AlxGa1-x)2O3 and from 5.26 to 8.56 eV for alpha-(AlxGa1-x)2O3. Most of the band offset of the (AlxGa1-x)2O3 alloy arises from the discontinuity in the conduction band. Our results are used to explain the available experimental data, and consequences for designing modulation-doped field effect transistors (MODFETs) based on (AlxGa1-x)2O3/Ga2O3 are discussed. ",
        " Two-dimensional (2D) platinum diselenide (PtSe2) has received significant attention for 2D transistor applications due to its high mobility. Here, using molecular beam epitaxy, we investigate the growth of 2D PtSe2 on highly oriented pyrolytic graphite (HOPG) and unveil their electronic properties via X-ray photoelectron spectroscopy, Raman spectra, and scanning tunnelling microscopy/spectroscopy as well as density functional theory (DFT) calculations. PtSe2 adopts a layer-by-layer growth mode on HOPG and shows a decreasing band gap with increasing layer number. For the layer numbers from one to four, PtSe2 has band gaps of 2.0 pm 0.1, 1.1 pm 0.1, 0.6 pm 0.1 and 0.20 pm 0.1 eV, respectively, and becomes semimetal from the fifth layer. DFT calculations reproduce the layer-dependent evolution of both the band gap and band edges, suggest an indirect band-gap structure, and elucidate the underlying physics at the atomic level. ",
        " We have perfoed a systematic magneto-optical Kerr spectroscopy study of GaMnAs with varying Mn densities as a function of temperature, magnetic field, and photon energy. Unlike previous studies, the magnetization easy axis was perpendicular to the sample surface, allowing us to take remanent polar Kerr spectra in the absence of an external magnetic field. The remanent Kerr angle strongly depended on the photon energy, exhibiting a large positive peak at sim1.7 eV. This peak increased in intensity and blue-shifted with Mn doping and further blue-shifted with annealing. Using a 30-band bf kcdot p model with antiferromagnetic s,p-d exchange interaction, we calculated the dielectric tensor of GaMnAs in the interband transition region, assuming that our samples are in the metallic regime and the impurity band has merged with the valence band. We successfully reproduced the observed spectra without emphad hoc introduction of the optical transitions originated from impurity states in the band gap. These results lead us to conclude that above-bandgap magneto-optical Kerr rotation in ferromagnetic GaMnAs is predominantly deteined by interband transitions between the conduction and valence bands. ",
        " In this study, we use DFT calculations to investigate the electronic and structural properties of MoX2 (X = S, Se, Te) monolayers doped with substitutional Sb atoms, with a central focus on the Sb(Mo) substitution. In MoS2, we observe that this substitution is energetically favored under S rich conditions, where the S2 gaseous phase is likely to be present. This result is compatible with a recent experimental observation in Sb-doped MoS2 nanosheets grown by CVD. A similar behavior is found in MoSe2, but in MoTe2 the Sb(Mo) substitution is less likely to occur due to the possible absence of gaseous Te phases in experimental setups. In all cases, several impurity-induced states are found inside the band gap, with energies that span the entire gap. The Fei energy is pinned a few tenths of eV above the top of the valence band, suggesting a predominant p-type behavior. The orbital nature of these states is investigated with projected and local density of states calculations, which reveal similarities to defect states induced by single Mo vacancies as well as their rehybridization with the 5s orbital from Sb. Additionally, we find that the band gap of the doped systems is increased in comparison with the pristine materials, in contrast with a previous calculation in Sb-doped MoS2 that predicts a gap reduction with a different assignment of valence band and impurity levels. We discuss the similarities, discrepancies, and the limitations of both calculations. We also speculate possible reasons for the experimentally observed redshifts of the A and B excitons in the presence of the Sb dopants in MoS2. We hope that these results spark future investigations on other aspects of the problem, particularly those concerning the effects of disorder and electron-hole interaction, and continue to reveal the potential of doped TMDCs for applications in optoelectronic devices. ",
        " Heusler-type Fe2VAl compound is a promising theoelectric candidate with non-magnetic ground state. The present work investigates the Seebeck coefficient (S) of Fe2VAl in the temperature region 300 to 620 K with the help of experimental and theoretical tools. The experimental value of S is observed -130 muV/K at 300 K. Afterthat, the magnitude of S decreases gradually as the temperature increases. At T = 620 K, the value of S is found to be -26 muV/K. In order to understand the behaviour of the experimentally observed S value, the band-structure and density of states calculations are perfoed by using LDA, PBE, PBEsol, mBJ and SCAN within density functional theory. All the above mentioned exchange-correlation (XC) functionals (except mBJ) predict the semi-metal like behaviour of the compound, whereas the mBJ gives the indirect band gap of 0.22 eV having the well agreement with experimentally observed value. The temperature dependence of S for Fe2VAl is also calculated with the help of all the five mentioned functionals individually. The best XC functional is investigated for searching the new theoelectric materials by taking Fe2VAl as a case example through this study. The best matching between experimental and calculated values of S as a function of temperature is observed by setting the mBJ band gap with the band-structure of PBEsol or SCAN. Therefore, the present study suggests that the band-structure of PBEsol or SCAN with mBJ band gap can be used for searching the new theoelectric materials. ",
        " Dirac materials, because of their small cal O(mboxmeV) band gap, are a promising target for dark photon-mediated scattering and absorption of light dark matter. In this paper, we characterize the daily modulation rate of dark matter interacting with a Dirac material due to anisotropies in their crystal structure. We show that daily modulation is an cal O(1) fraction of the total rate for dark matter scattering in the Dirac material ZrTe5. When present, the modulation is dominated by the orientation of the material's dielectric tensor with respect to the dark matter wind, and is maximized when the crystal is oriented such that the dark matter wind is completely aligned with the largest and smallest components of the dielectric tensor at two different times of the day. Because of the large modulation, any putative dark matter scattering signal could be rapidly verified or ruled out by changing the orientation of the crystal with respect to the wind and observing how the daily modulation pattern changes. ",
        " The band structure of beta-LiGaO2 is calculated using the quasiparticle self-consistent QSGhat W method where the screened Coulomb interaction hat W is evaluated including electron-hole interaction ladder diagrams and G is the one-electron Green's function. Improved convergence compared to previous calculations leads to a significantly larger band gap of about 7.0 eV. However, exciton binding energies are found to be large and lead to an exciton gap of about 6.0 eV if also a zero-point-motion correction of about -0.4 eV is included. These results are in excellent agreement with recent experimental results on the onset of absorption. Besides the excitons observed thus far, the calculations indicate the existence of a Rydberg-like series of exciton excited states, which is however modified from the classical Wannier exciton model by the anisotropies of the material and the more complex mixing of Bloch states in the excitons resulting from the Bethe-Salpeter equation. The exciton fine structure and the exciton wave functions are visualized and analyzed in various ways. ",
        " We deposit intrinsic hydrogenated amorphous silicon (a-Si:H) thin films by reactive pulsed laser deposition, for various hydrogen pressures in the 0-20 Pa range, at a low deposition temperature of 120C, and investigate the hydrogen incorporation, structural, optical, and electrical properties of the films, as a function of the ambient hydrogen pressure. The film thickness decreases linearly as the hydrogen pressure increases. The hydrogen content of the films is deteined by infrared spectroscopy and the optical bandgap from UV-Vis-NIR transmittance and reflectance measurements. Electric measurements yield the dark conductivity of the films. The hydrogen concentration of the films lies in the 10^21-10^22 cm^(-3) range and increases with the hydrogen pressure until the latter reaches 15 Pa, beyond which the hydrogen concentration decreases. The optical bandgap and dark conductivity follow the hydrogen concentration variation of the films. The dark conductivity lies in the 10^(-9)-10^(-10) S/cm range. An unusually wide optical bandgap of 2.2-2.6 eV is observed. ",
        " The Shockley-Queisser (SQ) limit, introduced by W. Shockley and H. J. Queisser in 1961, is the most well-established fundamental efficiency limit for single-junction photovoltaic solar cells. For widely-studied semiconductors such as Si, GaAs and lead-halide perovskite, the SQ limits under standard solar illumination (1-sun) are 32.7%, 32.5% and 31% for bandgaps of 1.12 eV, 1.43 eV and 1.55 eV, respectively. Here, we propose that the fundamental efficiency limits for single-junction solar cells may be surpassed via photon confinement, substantially raising the theoretical limits to 49%, 45.2% and 42.1% for Si, GaAs and methylammonium lead iodide (MAPbI3) perovskite cells under 1-sun. Such enhancement is possible through the containment of luminescent photons within the solar cell, allowing the suppression of both non-radiative and radiative recombination losses, which were considered inevitable in the classical SQ model. Importantly, restricting photon emission from the solar cells raises the open-circuit voltage (VOC) to values approaching the semiconductor bandgaps, surpassing the theoretical VOC values predicted by the SQ model. The fill factors of the cells are expected to increase substantially, resulting in current-voltage characteristics with very-high squareness for ideal diode operation. Our work introduces a new framework for improving solar cell perfoance beyond the conventional limits. ",
        " Hybrid superconductor-semiconductor heterostructures are a promising platfo for quantum devices based on mesoscopic and topological superconductivity. In these structures, a semiconductor must be in close proximity to a superconductor and fo an ohmic contact. This can be accommodated in narrow band gap semiconductors such as InAs, where the surface Fei level is positioned close to the conduction band. In this work, we study the structural properties of near-surface InAs quantum wells and find that surface morphology is closely connected to low-temperature transport, where electron mobility is highly sensitive to the growth temperature of the underlying graded buffer layer. By introducing an In0.81Al0.19As capping layer, we show that we can modify the surface Fei level pinning within the first nanometer of the In0.81Al0.19As thin film. Experimental measurements show a strong agreement with Schr\"odinger-Poisson calculations of the electron density, suggesting the conduction band energy of the In0.81Ga0.19As and In0.81Al0.19As surface is pinned to SI40milli eV and SI309milli eV above the Fei level respectively. ",
        " Mechanical stability of the ZnIn2X4 monolayers. The ZnIn2S4 and ZnIn2Se4 are semiconductors with direct band gaps of 3.94 and 2.77 eV, respectively whereas the ZnIn2Te4 shows an indirect band gap of 1.84 eV at the G0W0 level. The optical properties achieved from the solution of the Bethe-Salpeter equation predict the exciton binding energy of the ZnIn2S4, ZnIn2Se4, and ZnIn2Te4 monolayers to be 0.51, 0.41, and 0.34 eV, respectively, suggesting the high stability of the excitonic states against theal dissociation. Using the iterative solutions of the Boltzmann transport equation accelerated by machine learning interatomic potentials, the room-temperature lattice theal conductivity of the ZnIn2S4, ZnIn2Se4, and ZnIn2Te4 monolayers is predicted to be remarkably low as 5.8, 2.0, and 0.4 W/mK, respectively. Due to the low lattice theal conductivity, high theopower, and large figure of merit, we propose the ZnIn2Se4 and ZnIn2Te4 monolayers as promising candidates for theoelectric energy conversion systems. This study provides an extensive vision concerning the intrinsic physical properties of the ZnIn2X4 nanosheets and highlights their characteristics for energy conversion and optoelectronics applications. ",
        " Magnesium nickel hydride films have earlier been suggested for several optoelectronic applications, but the optical properties and band gap have not been fily established. In this work, the dielectric functions and the optical band gaps of thin films of Mg2NiH4 have been deteined experimentally from optical modeling using spectroscopic ellipsometry and spectrophotometry in the photon energy range between 0.7 and 4.2 eV. Samples were prepared by reactive sputtering, resulting in a single-layer geometry that could easily be studied by ellipsometry. Crystalline samples were prepared by annealing the amorphous films ex-situ. The resulting films remained in the high temperature cubic Mg2NiH4 structure even after cooling to room temperature. Tauc analysis of the dielectric function shows that Mg2NiH4 exhibits a band gap of 1.6 eV for amorphous structure films and 2.1 eV for its cubic crystalline structure. ",
        " First principles study of structural, elastic, and electronic properties of the cubic perovskitetype BaHfO3 has been perfoed using the plane wave ultrasoft pseudo-potential method based on density functional theory with revised Perdew-Burke-Ernzerhof exchange-correlation functional of the generalized gradient approximation (GGA-RPBE). The calculated equilibrium lattice constant of this compound is in good agreement with the available experimental and theoretical data reported in the literatures. The independent elastic constants (emphC11, emphC12, and emphC44), bulk modules emphB and its pressure derivatives B^prime, compressibility beta, shear modulus emphG, Young's modulus emphY, Poisson's ratio nu, and Lam'e constants (mu, lambda) are obtained and analyzed in comparison with the available theoretical and experimental data for both the singlecrystalline and polycrystalline BaHfO3. The band structure calculations show that BaHfO3 is a indirect bandgap material (R-Gamma = 3.11 eV) derived basically from the occupied O 2emphp and unoccupied Hf 5emphd states, and it still awaits experimental confiation. The density of states (total, site-projected, and emphl-decomposed) and the bonding charge density calculations make it clear that the covalent bonds exist between the Hf and O atoms and the ionic bonds exist between the Ba atoms and HfO3 ionic groups in BaHfO3. From our calculations, it is shown that BaHfO3 should be promising as a candidate for synthesis and design of superhard materials due to the covalent bonding between the transition metal Hf 5emphd and O 2emphp states. ",
        " We synthesize and study the structural and optical properties of nanocrystalline graphene monofluoride and graphite monofluoride, which are carbon-based wide bandgap materials. Using laser excitations 2.41 - 5.08 eV, we identify six emission modes of graphite monofluoride, spanning the visible spectrum from red to violet. The energy and linewidth of the modes point to defect-induced midgap states as the source of the photoemission. We discuss possible candidates. Our findings open the window to electro-optical applications of graphene fluoride. ",
        " In electronic structure calculations the optimized effective potential (OEP) is a method that treats exchange interactions exactly using a local potential within density-functional theory (DFT). We present a method using density functional perturbation theory combined with the Hylleraas variational method for finding the OEP by direct minimization which avoids any sum over unoccupied states. The method has been implemented within the plane-wave, pseudopotential foalism. Band structures for zinc blende semiconductors Si, Ge C, GaAs, CdTe and ZnSe, wurtzite semiconductors InN, GaN and ZnO and the rocksalt insulators CaO and NaCl have been calculated using the OEP and compared to calculations using the local density approximation (LDA), a selection of generalized gradient approximations (GGAs) and Hartree-Fock (HF) functionals. The band gaps found with the OEP improve on the calculated results for the LDA, GGAs or HF, with calculated values of 1.16eV for Si, 3.32eV for GaN and 3.48eV for ZnO. The OEP energies of semi-core d-states are also greatly improved compared to LDA. ",
        " Recent advances in two-dimensional (2D) magnetism have heightened interest in layered magnetic materials due to their potential for spintronics. In particular, layered semiconducting antiferromagnets exhibit intriguing low-dimensional semiconducting behavior with both charge and spin as carrier controls. However, synthesis of these compounds is challenging and remains rare. Here, we conducted firstprinciples based high-throughput search to screen potentially stable mixed metal phosphorous trichalcogenides (MM'P2X6, where M and M' are transition metals and X is a chalcogenide) that have a wide range of tunable bandgaps and interesting magnetic properties. Among the potential candidates, we successfully synthesized a stable semiconducting layered magnetic material, CdFeP2Se6, that exhibits a short-range antiferromagnetic order at TN = 21 K with an indirect band gap of 2.23 eV. Our work suggests that highthroughput screening assisted synthesis be an effective method for layered magnetic materials discovery. ",
        " Several theoretical predictions have claimed that the neutral exciton of TMDCs splits into a transversal and longitudinal exciton branch, with the longitudinal one, which is the upper branch, exhibiting an extraordinary strong dispersion in the meV range within the light cone. Historically, this was linked for semiconductor quantum wells to strong far-field optical dipole coupling, or strong electronic long-range exchange interactions, describing two sides of the same coin. Recently, experiments utilizing Fourier-space spectroscopy have shown that the exciton (exciton-polariton) dispersion can indeed be measured for high-quality hexagonal-BN-encapsulated WSe2 monolayer samples and can confi the energy scale. Here, the exciton fine-structure's pseudo-spin and the valley polarization are investigated as a function of the centre-of-mass-momentum and excitation-laser detuning. For quasi-resonant excitation, a strong dispersion featuring a pronounced momentum-dependent helicity is observed. By increasing the excitation energy step-wise towards and then above the electronic band gap, the dispersion and the helicity systematically decrease due to contributions of incoherent excitons and emission from plasma. The decline of the helicity with centre-of-mass momentum can be phenomenologically modelled by the Maialle-Silva-Sham mechanism using the exciton splitting as the source of an effective magnetic field. ",
        " Resistivity measurements are reported for single crystals of Mn12-Acetate and Fe8Br8. Both materials exhibit a semiconductor-like, theally activated behavior over the 200-300 K range. The activation energy, Ea, obtained for Mn12-Acetate was 0.37 +/- 0.05 eV, which is to be contrasted with the value of 0.55 eV deduced from the earlier reported absorption edge measurements and the range of 0.3-1 eV from intramolecular density of states calculations, assuming 2Ea = Eg, the optical band gap. For Fe8Br8, Ea was measured as 0.73 +/- 0.1 eV, and is discussed in light of the available approximate band structure calculations. Some plausible pathways are indicated based on the crystal structures of both lattices. For Mn12-Acetate, we also measured photoconductivity in the visible range; the conductivity increased by a factor of about eight on increasing the photon energy from 632.8 nm (red) to 488 nm (blue). X-ray irradiation increased the resistivity, but Ea was insensitive to exposure. ",
        " Solar cells based on a light absorbing layer of the organometal halide perovskite CH3NH3PbI3 have recently reached 15% conversion efficiency, though how these materials work remains largely unknown. We analyse the electronic structure and optical properties within the quasiparticle self-consistent GW approximation. While this compound bears some similarity to conventional sp semiconductors, it also displays unique features. Quasiparticle self-consistency is essential for an accurate description of the band structure: bandgaps are much larger than what is predicted by the local density approximation (LDA) or GW based on the LDA. Valence band dispersions are modified in a very unusual manner. In addition, spin orbit coupling strongly modifies the band structure and gives rise to unconventional dispersion relations and a Dresselhaus splitting at the band edges. The average hole mass is small, which accounts for the long diffusion lengths recently observed. The surface ionisation potential (workfunction) is calculated to be 5.7 eV with respect to the vacuum level, explaining efficient carrier transfer to TiO2 and Au electrical contacts. ",
        " Ternary semiconductor CuYS2 is studied by using the first-principles methods in the density functional theory (DFT) framework. The structural, electronic, optical and elastic properties were calculated at the ambient and elevated hydrostatic pressures. The compound was shown to have an indirect band gap of about 1.342/1.389 eV (in the generalized gradient and local density approximations). The anisotropy of the optical properties was studied by calculating the absorption spectra, dielectric function and index of refraction for different polarizations. The anisotropy of the elastic properties was visualized by plotting the three-dimensional dependence of the Young's moduli on the direction in the crystal lattice. The obtained results, which are reported for the first time to the best of the author's knowledge, can facilitate assessment of possible applications of the title material. ",
        " Two novel three-dimensional (3D) crystal structures of carbon (C) and geanium carbide (GeC2) were predicted using first-principles density-functional theory (DFT) calculations. These newly discovered 3D carbon allotrope and GeC2 are in the space group of Fmmm (space group number 69). Their crystal structures have unique tetragonal/hexagonal rings foed by either C or Ge/C atoms. Both structures were proven to be theodynamically stable through the phonon spectrum calculations. The C allotrope is a semiconductor with a wide band gap of 3.65 eV predicted by the hybrid density functional HSE06 method, while GeC2 is metallic. The new C allotrope has a low mass density of 2.84 g/cm3. More importantly, it is proven to be energetically stable with cohesive energy less than -7.5 eV/atom which is lower than many other carbon allotropes implying the possibility to be fabricated in lab. Such a carbon crystal structure with a low mass density and wide band gap once synthesized would have wide applications in gas adsorption sensors and photo-electronic devices. ",
        " While the properties of wurtzite GaAs have been extensively studied during the past decade, little is known about the influence of the crystal polytype on ternary (In,Ga)As quantum well structures. We address this question with a unique combination of correlated, spatially-resolved measurement techniques on core-shell nanowires that contain extended segments of both the zincblende and wurtzite polytypes. Cathodoluminescence hyperspectral imaging reveals a blueshift of the quantum well emission energy by 75pm15 meV in the wurtzite polytype segment. Nanoprobe x-ray diffraction and atom probe tomography enable mathbfkcdotmathbfp calculations for the specific sample geometry to reveal two comparable contributions to this shift. First, there is a 30% drop in In mole fraction going from the zincblende to the wurtzite segment. Second, the quantum well is under compressive strain, which has a much stronger impact on the hole ground state in the wurtzite than in the zincblende segment. Our results highlight the role of the crystal structure in tuning the emission of (In,Ga)As quantum wells and pave the way to exploit the possibilities of three-dimensional bandgap engineering in core-shell nanowire heterostructures. At the same time, we have demonstrated an advanced characterization toolkit for the investigation of semiconductor nanostructures. ",
        " Reduced dielectric screening in two-dimensional materials enables bound excitons, which modifies their optical absorption and optoelectronic response even at room temperature. Here, we demonstrate the existence of excitons in the bandgap of the monolayer family of the newly discovered synthetic MoSi2Z4 (Z = N, P, and As) series of materials. All three monolayers support several bright and strongly bound excitons with binding energies varying from 1 eV to 1.35 eV for the lowest energy exciton resonances. On increasing the pump fluence, the exciton binding energies get renoalized, leading to a redshift-blueshift crossover. Our study shows that the MoSi2Z4 series of monolayers offer an exciting test-bed for exploring the physics of strongly bound excitons and their non-equilibrium dynamics. ",
        " Within the subgap of amorphous oxide semiconductors like amorphous indium gallium zinc oxide (a-IGZO) are donor-like and acceptor-like states that control the operational physics of optically transparent thin-film transistors (TFTs). Hydrogen incorporation into the channel layer of a top-gate a-IGZO TFT exists as an electron donor that causes an observed negative shift in the drain current-gate voltage (mathID - VG) transfer curve turn-on voltage. Noally, hydrogen is thought to create shallow electronic states just below the conduction band mobility edge, with the donor ionization state controlled by equilibrium theodynamics involving the position of the Fei level with respect to the donor ionization energy. However, hydrogen does not behave as a noal donor as revealed by the subgap density of states (DoS) measured by the photoconduction response of top-gate a-IGZO TFTs to within 0.3 eV of the CBM edge. Specifically, the DoS shows a subgap peak above the valence band mobility edge growing at the same rate that mathID - VG transfer curve measurements suggest that hydrogen was incorporated into the channel layer. Such hydrogen donor behavior in a-IGZO is anomalous and can be understood as follows: Non-bonded hydrogen ionization precedes its incorporation into the a-IGZO network as a bonded species. Ionized hydrogen bonds to a charged oxygen-on-an-oxygen-site anion, resulting in the foation of a defect complex denoted herein as, math[OO^2-H^+]^1-. Foation of an math[OO^2-H^+]^1- defect complex creates a spectrally-broad (sim0.3 eV FWHM) distribution of electronic states observed in the bandgap centered at 0.4 eV above the valence band mobility edge. ",
        " Methylammonium lead iodide perovskites are considered direct bandgap semiconductors. Here we show that in fact they present a weakly indirect bandgap 60 meV below the direct bandgap transition. This is a consequence of spin-orbit coupling resulting in Rashba-splitting of the conduction band. The indirect nature of the bandgap explains the apparent contradiction of strong absorption and long charge carrier lifetime. Under hydrostatic pressure from ambient to 325 MPa, Rashba splitting is reduced due to a pressure induced ordering of the crystal structure. The nature of the bandgap becomes increasingly more direct, resulting in five times faster charge carrier recombination, and a doubling of the radiative efficiency. At hydrostatic pressures above 325 MPa, MAPI undergoes a reversible phase transition resulting in a purely direct bandgap semiconductor. The pressure-induced changes suggest epitaxial and synthetic routes to higher efficiency optoelectronic devices. ",
        " The recently synthesized two-dimensional electride Gd2C was proposed to be a ferromagnetic metal that possesses multiple pairs of Weyl points and may display a large anomalous Hall conductivity [Liu textitet al., Phys. Rev. Lett. textbf125, 187203 (2020)]. In view of its layered structure, here we carry out first-principles studies on the magnetic and electronic properties of Gd2C in the ultrathin monolayer limit. We find that monolayer Gd2C remains ferromagnetic like the bulk fo and the hydrogenation can effectively tune its magnetism and electronic structure. With one-sided coverage of hydrogen atoms, monolayer Gd2C becomes a half-metal with one spin channel around the Fei level. For two-sided hydrogenation, monolayer Gd2C transfos to an antiferromagnetic insulator with a band gap of 0.8 eV. Our studies show that monolayer electride Gd2C can perfo multiple magnetic and electronic transitions with different levels of hydrogenation and may be also adopted to construct a planar heterojunction with selective area adsorption of hydrogen atoms, which has promising applications in future electronic and spintronic devices. ",
        " We present the first study of parametric amplification in hydrogenated amorphous silicon waveguides. Broadband on/off amplification up to 26.5~dB at telecom wavelength is reported. Measured nonlinear parameter is 770~textW^-1 textm^-1, nonlinear absorption 28~textW^-1 textm^-1, bandgap 1.61~eV. ",
        " Using a combination of X-ray absorption spectroscopy experiments with first principle calculations, we demonstrate that insulating KCuO2 contains Cu in an unusually-high foal-3+ valence state, the ligand-to-metal (O to Cu) charge transfer energy is intriguingly negative (Delta~ -1.5 eV) and has a dominant (~60%) ligand-hole character in the ground state akin to the high Tc cuprate Zhang-Rice state. Unlike most other foal Cu^3+ compounds, the Cu 2p XAS spectra of KCuO2 exhibits pronounced 3d^8 (Cu^3+) multiplet structures, which accounts for ~40% of its ground state wave-function. Ab-initio calculations elucidate the origin of the band-gap in KCuO2 as arising primarily from strong intra-cluster Cu 3d - O 2p hybridizations (tpd); the value of the band-gap decreases with reduced value of tpd. Further, unlike conventional negative charge-transfer insulators, the band-gap in KCuO2 persists even for vanishing values of Coulomb repulsion U, underscoring the importance of single-particle band-structure effects connected to the one-dimensional nature of the compound. ",
        " Trap-assisted nonradiative recombination is known to limit the efficiency of optoelectronic devices, but the conventional multi-phonon emission (MPE) process fails to explain the observed loss in wide-band-gap materials. Here we highlight the role of trap-assisted Auger-Meitner (TAAM) recombination, and present a first-principles methodology to deteine TAAM rates due to defects or impurities in semiconductors or insulators. We assess the impact on efficiency of light emitters in a recombination cycle that may include both TAAM and carrier capture via MPE. We apply the foalism to the technologically relevant case study of a calcium impurity in InGaN, where a Shockley-Read-Hall recombination cycle involving MPE alone cannot explain the experimentally observed nonradiative loss. We find that, for band gaps larger than 2.5 eV, the inclusion of TAAM results in recombination rates that are orders of magnitude larger than recombination rates based on MPE alone, demonstrating that TAAM can be a dominant nonradiative process in wide-band-gap materials. Our computational foalism is general and can be applied to the calculation of TAAM rates in any semiconducting or insulating material. ",
        " We predict the existence of new two dimensional silicon carbide nanostructure employing ab initio density-functional theory calculations. These structures are composed of tetragonal and hexagonal rings with C-C and Si-C bonds arranged in a buckling plane. They are proven to be theodynamically and mechanically stable with relatively low foation energy, implying potential fabrication in lab. They exhibit strong ductility and anisotropicity from their strain-stress relation and directional dependence of mechanical moduli. The materials maintain phonon stability upon the application of mechanical strain up to 27% with fantastic ductile property. The SiC2 structure possesses a tiny direct band gap of 0.02 eV predicted using HSE06 functional and the band gap can be opened up through multiple approaches such as hydrogenation and strain application. The gap values can be strategically tuned in the range of 0.02 ~ 1.72 eV and the direct/indirect gap nature can be further manipulated. In contrast, a closely related structure of SiC shows an indirect HSE band gap of 1.80 eV and strain engineering its value between 0.0 ~ 1.95 eV. The unique properties in these newly proposed structures might have potential applications in future nanomechanics and electronics. ",
        " Topological defects in ultrathin layers are often foed during synthesis and processing, thereby, strongly influencing their electronic properties . In this paper, we investigate the role of Stone-Wales (SW) defects in modifying the electronic properties of the monolayers of Sn and group-V elements. The calculated results find the electronic properties of stanene (monolayer of Sn atoms) to be strongly dependent on the concentration of SW-defects e.g., defective stanene has nearly zero band gap (~ 0.03 eV) for the defect concentration of 2.2 x 10^13 cm^-2 which opens up to 0.2 eV for the defect concentration of 3.7 x 10^13 cm^-2. In contrast, SW-defects appear to induce conduction states in the semiconducting monolayers of group-V elements. These conduction states act as channels for electron tunnelling, and the calculated tunnelling characteristics show the highest differential conductance for the negative bias with the asymmetric current-voltage characteristics. On the other hand, the highest differential conductance was found for the positive bias in stanene. Simulated STM topographical images of stanene and group-V monolayers show distinctly different features in tes of their cross-sectional views and distance-height profiles which can serve as fingerprints to identify the topological defects in the monolayers of group-IV and group-V elements in experiments. ",
        " We investigate two dimensional monolayer structures of arsenic phosphorus ( AsP) by means of first principles plane wave method within density functional theory using the generalized gradient approximation. Two structures of arsenic phosphorus are taken into account which are called buckled (B-AsP) and puckered (Pu-AsP). From our numerical calculations we predicted the optimized states of a single-layer buckled and puckered honeycomb like allotropes of AsP. We demonstrate that buckled and puckered arsenic phosphorus are semiconducting single layers with band gap energies 1.858 eV and 0.924 eV, respectively. Especially, we have found that the puckered monolayer has a direct band gap. Furheore, we examined the electronic and magnetic properties of various kind of point defects including single and double vacancies, antisite and substitutions on both buckled and puckered arsenic phosphorus. We conclude that AsP monolayers can attain magnetic state with vacancies and the semiconductor nature can turn into metal with diverse defect types. In considered system also the band gap of B-AsP can be tuned from metal character to 1.858 eV and for Pu-AsP from metal to 0.924 eV which these ranges are especially important for radar and atmosferic applications. ",
        " Graphene holds great promise for post-silicon electronics, however, it faces two main challenges: opening up a bandgap and finding a suitable substrate material. In principle, graphene on hexagonal boron nitride (hBN) substrate provides potential system to overcome these challenges. Recent theoretical and experimental studies have provided conflicting results: while theoretical studies suggested a possibility of a finite bandgap of graphene on hBN, recent experimental studies find no bandgap. Using the first-principles density functional method and the many-body perturbation theory, we have studied graphene on hBN substrate. A Bernal stacked graphene on hBN has a bandgap on the order of 0.1 eV, which disappears when graphene is misaligned with respect to hBN. The latter is the likely scenario in realistic devices. In contrast, if graphene supported on hBN is hydrogenated, the resulting system (graphone) exhibits bandgaps larger than 2.5 eV. While the bandgap opening in graphene/hBN is due to symmetry breaking and is vulnerable to slight perturbation such as misalignment, the graphone bandgap is due to chemical functionalization and is robust in the presence of misalignment. The bandgap of graphone reduces by about 1 eV when it is supported on hBN due to the polarization effects at the graphone/hBN interface. The band offsets at graphone/hBN interface indicate that hBN can be used not only as a substrate but also as a dielectric in the field effect devices employing graphone as a channel material. Our study could open up new way of bandgap engineering in graphene based nanostructures. ",
        " Magnetic order emerging in otherwise non-magnetic materials as carbon is a paradigmatic example of a novel type of s-p electron magnetism predicted to be of exceptional high-temperature stability. It has been demonstrated that atomic scale structural defects of graphene can host unpaired spins. However, it is still unclear under which conditions long-range magnetic order can emerge from such defect-bound magnetic moments. Here we propose that in contrast to random defect distributions, atomic scale engineering of graphene edges with specific crystallographic orientation, comprising edge atoms only from one sub-lattice of the bipartite graphene lattice, can give rise to a robust magnetic order. We employ a nanofabrication technique based on Scanning Tunneling Microscopy to define graphene nanoribbons with nanometer precision and well-defined crystallographic edge orientations. While achair ribbons display quantum confinement gap, zigzag ribbons narrower than 7 nm reveal a bandgap of about 0.2 - 0.3 eV, which can be identified as a signature of interaction induced spin ordering along their edges. Moreover, a semiconductor to metal transition is revealed upon increasing the ribbon width, indicating the switching of the magnetic coupling between opposite ribbon edges from antiferromagnetic to ferromagnetic configuration. We found that the magnetic order on graphene edges of controlled zigzag orientation can be stable even at room temperature, raising hope for graphene-based spintronic devices operating under ambient conditions. ",
        " Structural stability and electronic properties of alkaline-earth metals (Ca, Sr, Ba) induced Si(111)-3x2 surfaces have been comprehensively studied by means of ab initio calculations. Adsorption energy and charge density difference calculations show the high structural stability due to the strong chemical bonding. Analysis of electronic band structures and band-decomposed charge density distributions indicates that the third valence band is deriving from top Si and metal atoms, while the top most two valence bands are deriving from the bulk silicon. These results suggest a larger surface band gap of 1.65-1.68 eV, which is good consistent with the recent experimental finding for Sr/Si(111)-3x2 surface. These results reveal a natural explanation for the relevant experimental observation and stimulate further experimental and theoretical exploration on the surface science. ",
        " Alloying/doping in two-dimensional material has been important due to wide range band gap tunability. Increasing the number of components would increase the degree of freedom which can provide more flexibility in tuning the band gap and also reduced the growth temperature. Here, we report synthesis of quaternary alloys MoxW1-xS2ySe2(1-y) using chemical vapour deposition. The composition of alloys has been tuned by changing the growth temperatures. As a result, we can tune the bandgap which varies from 1.73 eV to 1.84 eV. The detailed theoretical calculation supports the experimental observation and shows a possibility of wide tunability of bandgap. ",
        " We show that it is possible to reach one of the ultimate goals of organic electronics: producing organic field-effect transistors with trap densities as low as in the bulk of single crystals. We studied the spectral density of localized states in the band gap (trap DOS) of small molecule organic semiconductors as derived from electrical characteristics of organic field-effect transistors or from space-charge-limited-current measurements. This was done by comparing data from a large number of samples including thin-film transistors (TFT's), single crystal field-effect transistors (SC-FET's) and bulk samples. The compilation of all data strongly suggests that structural defects associated with grain boundaries are the main cause of \"fast\" hole traps in TFT's made with vacuum-evaporated pentacene. For high-perfoance transistors made with small molecule semiconductors such as rubrene it is essential to reduce the dipolar disorder caused by water adsorbed on the gate dielectric surface. In samples with very low trap densities, we sometimes observe a steep increase of the trap DOS very close (<0.15 eV) to the mobility edge with a characteristic slope of 10-20 meV. It is discussed to what degree band broadening due to the theal fluctuation of the inteolecular transfer integral is reflected in this steep increase of the trap DOS. Moreover, we show that the trap DOS in TFT's with small molecule semiconductors is very similar to the trap DOS in hydrogenated amorphous silicon even though polycrystalline films of small molecules with van der Waals-type interaction on the one hand are compared with covalently bound amorphous silicon on the other hand. ",
        " High-power infrared laser systems with broadband tunability are of great importance due to their wide range of applications in spectroscopy and free-space communications. These systems require nonlinear optical (NLO) crystals for wavelength up/down conversion using sum/difference frequency generation, respectively. NLO crystals need to satisfy many competing criteria, including large nonlinear optical susceptibility, large laser induced damage threshold (LIDT), wide transparency range and phase-matchability. Here, we report bulk single crystals of SnP2S6 with a large non-resonant SHG coefficient of d33= 53 pm/V at 1550nm and a large LIDT of 350 GW/cm^2 for femtosecond laser pulses. It also exhibits a broad transparency range from 0.54 mum to 8.5mum (bandgap of ~2.3 eV) and can be both Type I and Type II phase-matched. The complete linear and SHG tensors are measured as well as predicted by first principles calculations, and they are in excellent agreement. A proximate double-resonance condition in the electronic band structure for both the fundamental and the SHG light is shown to enhance the non-resonant SHG response. Therefore, SnP2S6 is an outstanding candidate for infrared laser applications. ",
        " We report that an external electric field applied noal to bilayers of transition-metal dichalcogenides TX2, M = Mo, W, X = S, Se, creates significant spin-orbit splittings and reduces the electronic band gap linearly with the field strength. Contrary to the TX2 monolayers, spin-orbit splittings and valley polarization are absent in bilayers due to the presence of inversion symmetry. This symmetry can be broken by an electric field, and the spin-orbit splittings in the valence band quickly reach similar values as in the monolayers (145 meV for MoS2... 418 meV for WSe2) at saturation fields less than 500 mV A-1. The band gap closure results in a semiconductor-metal transition at field strength between 1.25 (WX2) and 1.50 (MoX2) V A-1. Thus, by using a gate voltage, the spin polarization can be switched on and off in TX2 bilayers, thus activating them for spintronic and valleytronic applications. ",
        " A comprehensive ellipsometric study was perfoed on Fe1-xCoxSi single crystals in the spectral range from 0.01 eV to 6.2 eV. Direct and indirect band gaps of 73 meV and 10 meV, respectively, were observed in FeSi at 7 K. One of four infrared-active phonons that is energetically close to the direct absorption edge is coupled both to the electrons and to the low-energy phonon. This is evident from asymmetry in the phonon line shape and a reduction of its frequency when the absorption edge shifts across the phonon energy due to the temperature dependence of the direct band gap. As the temperature increases, the indirect gap changes sign, which manifests as a transition from a semiconductor to a semimetal. The corresponding gain of the spectral weight at low energies was recovered within an energy range of several eV. The present findings strongly support the model indicating that Fe1-xCoxSi can be well described in an itinerant picture, taking into account self-energy corrections. ",
        " Toroidal carbon nanotubes can serve as hosts for encapsulated loops of atomic metal wires. Such composite structures have been analyzed using density functional theory for a semiconducting C120 torus encapsulating chains of Fe, Au and Cu atoms. The sheathed metal necklaces fo a zigzag structure and drops the HOMO/LUMO bandgap to less than 0.1 eV. The iron composite is ferromagnetic with a magnetic moment essentially the same as that of bcc iron. The azimuthal symmetry of these toroidal composites suggests that they may offer novel elecromagnetic properties not associated with straight, metal-encapsulated carbon nanotubes. ",
        " Based on ab initio calculations, we predict that a monolayer of Cr-doped (Bi,Sb)2Te3 and GdI2 heterostructure is a quantum anomalous Hall insulator with a non-trivial band gap up to 38 meV. The principle behind our prediction is that the band inversion between two topologically trivial ferromagnetic insulators can result in a non-zero Chern number, which offers a better way to realize the quantum anomalous Hall state without random magnetic doping. In addition, a simple effective model is presented to describe the basic mechanism of spin polarized band inversion in this system. Moreover, we predict that 3D quantum anomalous Hall insulator could be realized in (Bi2/3Cr1/3)2Te3/GdI2 superlattice. ",
        " NiO layers were grown on MgO(100), MgO(110), and MgO(111) substrates by plasma-assisted molecular beam epitaxy under Ni-flux limited growth conditions. Single crystalline growth with a cube-on-cube epitaxial relationship was confied by X-ray diffraction measurements for all used growth conditions and substrates except MgO(111). A detailed growth series on MgO(100) was prepared using substrate temperatures ranging from 20 degC to 900 degC to investigate the influence on the layer characteristics. Energy-dispersive X-ray spectroscopy indicated close-to-stoichiometric layers with an oxygen content of ~47 at. % and ~50 at. % grown under low and high O-flux, respectively. All NiO layers had a root-mean-square surface roughness below 1 nm, measured by atomic force microscopy, except for rougher layers grown at 900 degC or using molecular oxygen. Growth at 900 degC led to a significant diffusion of Mg from the substrate into the film. The relative intensity of the quasi-forbidden one-phonon Raman peak is introduced as a gauge of the crystal quality, indicating the highest layer quality for growth at low oxygen flux and high growth temperature, likely due to the resulting high adatom diffusion length during growth. The optical and electrical properties were investigated by spectroscopic ellipsometry and resistance measurements, respectively. All NiO layers were transparent with an optical bandgap around 3.6 eV and semi-insulating at room temperature. However, changes upon exposure to reducing or oxidizing gases of the resistance of a representative layer at elevated temperature were able to confi p-type conductivity, highlighting their suitability as a model system for research on oxide-based gas sensing. ",
        " Diamond offers unique material advantages for the realization of micro- and nanomechanical resonators due to its high Young's modulus, compatibility with harsh environments and superior theal properties. At the same time, the wide electronic bandgap of 5.45eV makes diamond a suitable material for integrated optics because of broadband transparency and the absence of free-carrier absorption commonly encountered in silicon photonics. Here we take advantage of both to engineer full-scale optomechanical circuits in diamond thin films. We show that polycrystalline diamond films fabricated by chemical vapour deposition provide a convenient waferscale substrate for the realization of high quality nanophotonic devices. Using free-standing nanomechanical resonators embedded in on-chip Mach-Zehnder interferometers, we demonstrate efficient optomechanical transduction via gradient optical forces. Fabricated diamond resonators reproducibly show high mechanical quality factors up to 11,200. Our low cost, wideband, carrier-free photonic circuits hold promise for all-optical sensing and optomechanical signal processing at ultra-high frequencies. ",
        " Although C60 is a molecular crystal with a bandgap Eg of ~2.5 eV, we show that Eg is strongly affected by injected charge. In sharp contrast to the Coulomb blockade typical of quantum dots, Eg is it reduced by the Coulomb effects. The conductance of a thin C60 layer sandwiched between metal (Al, Ag, Au, Mg and Pt) contacts is investigated. Excellent Ohmic conductance is observed for Al electrodes protected with ultra-thin LiF layers. First-principles calculations, Hubbard models etc., show that the energy gap of C60 is dramatically reduced when electrons hop from C60^- to C60. ",
        " The transition metal nitride BaHfN2, which consists of weakly bonded neutral slabs of closed shell ions, has structural and chemical similarities to other layered nitrides which have impressive superconducting Tc when electron doped: AxHfNCl, AxZrNCl, AxTiNCl, with Tc= 25.5, 15.2 and 16.5 K, respectively for appropriate donor (A) concentrations x. These similarities suggest the possibility of BaHfN2 being another relatively high Tc nitride upon doping, with effects of structure and the role of specific transition metal ions yet to be understood. We report first-principles electronic structure calculations for stoichiometric BaHfN2 using density functional theory with plane-wave basis sets and separable dual-space Gaussian pseudopotentials. An indirect band gap of 0.8 eV was obtained and the lowest conduction band is primarily of Hf 5dxy character, similar to beta-ZrNCl and alpha-TiNCl. The two N sites, one in the Hf layer and another one in the Ba layer, were found to have very anisotropic Born effective charges (BEC):deviations from the foal charge (-3) are opposite for the two sites, and opposite for the two orientations (in-plane, out of plane). LO-TO splittings and comparison of BECs and dielectric constant tensors to those of related compounds are discussed, and the effect of electron doping on the zone-center phonons is reported. ",
        " We investigate the effects of external electric fields on the electronic properties of bilayer achair graphene nano-ribbons. Using atomistic simulations with Tight Binding calculations and the Non-equilibrium Green function foalism, we demonstrate that (i) in semi-metallic structures, vertical fields impact more effectively than transverse fields in tes of opening larger bandgap, showing a contrary phenomenon compared to that demonstrated in previous studies in bilayer zigzag graphene nano-ribbons; (ii) in some semiconducting structures, if transverse fields just show usual effects as in single layer achair graphene nano-ribbons where the bandgap is suppressed when varying the applied potential, vertical fields exhibit an anomalous phenomenon that the bandgap can be enlarged, i.e., for a structure of width of 16 dimer lines, the bandgap increases from 0.255 eV to the maximum value of 0.40 eV when a vertical bias equates 0.96 V applied. Although the combined effect of two fields does not enlarge the bandgap as found in bilayer zigzag graphene nano-ribbons, it shows that the mutual effect can be useful to reduce faster the bandgap in semiconducting bilayer achair graphene nano-ribbons. These results are important to fully understand the effects of electric fields on bilayer graphene nano-ribbons (AB stacking) and also suggest appropriate uses of electric gates with different edge orientations. ",
        " Here we report the optical and x-ray absorption (XAS) spectra of the wide-band-gap oxide MgO using density functional theory (DFT) and many-body perturbation theory (MBPT). Our comprehensive study of the electronic structure shows that while the band gap is underestimated with the exchange-correlation functional PBEsol (4.58 eV) and the hybrid functional HSE06 (6.58 eV) compared to the experimental value (7.7 eV), it is significantly improved (7.52 eV) and even overcompensated (8.53 eV) when quasiparticle corrections are considered. Inclusion of excitonic effects by solving the Bethe-Salpeter equation (BSE) yields the optical spectrum in excellent agreement with experiment. Excellent agreement is observed also for the O and Mg K-edge absorption spectra, demonstrating the importance of the electron-hole interaction within MBPT. Projection of the electron-hole coupling coefficients from the BSE eigenvectors on the band structure allows us to deteine the origin of prominent peaks and identify the orbital character of the relevant contributions. The real space projection of the lowest energy exciton wavefunction of the optical spectrum indicates a Wannier-Mott type, whereas the first exciton in the O K-edge is more localized. ",
        " Single crystals of CrSbSe3, a structurally pseudo-one-dimensional ferromagnetic semiconductor, were grown using a high-temperature solution growth technique and were characterized by x-ray diffraction, anisotropic, temperature- and field-dependent magnetization, temperature-dependent resistivity and optical absorption measurements. A band gap of 0.7 eV was deteined from both resistivity and optical measurements. At high temperatures, CrSbSe3 is paramagnetic and isotropic with a Curie-Weiss temperature of sim145 K and an effective moment of sim4.1 muB/Cr. A ferromagnetic transition occurs at Tc = 71 K. The a-axis, perpendicular to the chains in the structure, is the magnetic easy axis, while the chain axis direction, along b, is the hard axis. Magnetic isothes measured around Tc do not follow the behavior predicted by simple mean field critical exponents for a second order phase transition. A tentative set of critical exponents is estimated based on a modified Arrott plot analysis, giving betasim0.25, gammasim1.38 and deltasim6.6. ",
        " The electronic and atomic structure of a bulk 2D layered van-der-Waals compound CdPS3 was studied in the low (R3) and room (C2/m) temperature phases using first-principles calculations within the periodic linear combination of atomic orbitals method with hybrid meta exchange-correlation M06 functional. The calculation results reproduce well the experimental crystallographic parameters. The value of the indirect band gap Eg=3.4 eV for the room-temperature monoclinic C2/m phase is close to the experimental one, while the indirect band gap Eg=3.3 eV was predicted for the low-temperature trigonal R3 phase. The effect of hydrostatic pressure on the band gap in both phases was studied in the pressure range from 0 to 40 GPa. In both cases, the pressure dependence of the band gap passes through a maximum, but at different pressures. In the R3 phase, the band gap reaches its maximum value of ~4 eV at ~30 GPa, whereas in the C2/m phase, the maximum value of ~3.6 eV is reached already at ~8 GPa. ",
        " From the first-principles calculations, we have studied the electronic and magnetic structures of compound Na2Ti2Pn2O (Pn = As or Sb). We find that in the ground state Na2Ti2As2O is a blocked checkerboard antiferromagnetic semiconductor with a small band gap of about 0.15 eV, in contrast, Na2Ti2Sb2O is a bi-collinear antiferromagnetic semimetal, both with a small moment of about 0.5muB around each Ti atom. We show that there is a strong Fei surface nesting in Na2Ti2Pn2O. And we verify that the blocked checkerboard and bi-collinear antiferromagnetic states both are the spin density waves induced by the Fei surface nesting. A tetramer structural distortion is found in company with the foation of a blocked checkerboard antiferromagnetic order, in good agreement with the experimentally observed commensurate structural distortion but with space group symmetry retained after the anomaly happening. Further analysis and discussion in connection with experimental observations are given as well. ",
        " Based on first-principles calculations and tight-binding model analysis, we propose that black phosphorus (BP) can host a three-dimensional topological node-line semimetal state under pressure when spin-orbit coupling (SOC) is ignored. A closed topological node line exists in the first Brillouin zone (BZ) near the Fei energy, which is protected by the coexistence of time-reversal and spatial inversion symmetry with band inversion driven by pressure. Drumhead-like surface states have been obtained on the beard (100) surface. Due to the weak intrinsic SOC of phosphorus atom, a band gap less than 10 meV is opened along the node line in the presence of SOC and the surface states are almost unaffected by SOC. ",
        " Bismuth vanadate (BiVO4) has recently been under focus for its potential use in photocatalysis thanks to its well-suited absorption edge in the visible light range. Here, we characterize the optical absorption of a BiVO4 single crystal as a function of temperature and polarization direction by reflectance and transmittance spectroscopy. The optical band gap is found to be very sensitive to temperature, and to the monoclinic-to-tetragonal ferroelastic transition at 523K. The anisotropy, as measured by the difference in absorption edge for light polarized parallel and perpendicular to the principal axis, is reduced from 0.2 eV in the high-temperature tetragonal phase to 0.1 eV at ambient temperature. We show that this evolution is dominantly controlled by the ferroelastic shear strain. These findings provide a route for further optimization of bismuth-vanadate-based light absorbers in photocatalytic devices. ",
        " In this work, we report the effects of calcination temperature on structural, dielectric, semiconducting and optical properties of YFeO3 nanoparticles prepared by a high energy ball milling process. The structural analysis of the X-ray diffraction data shows that YFeO3 exists in orthorhombic as well as in hexagonal mixed-phase states. The Rietveld analysis confis that orthorhombic YFeO3 crystallizes into Pnma space group. The optical band gap of YFeO3 reduces from 1.96 eV to 1.68 eV with increasing the calcination temperature of the YFeO3 sample. The bandgap reducing effect might be attributed to the increased crystallite size and decreased lattice strain which is confied by the Williamson-Hall plot method. The obtained low bandgap YFeO3 ceramic may provide a new possibility to develop eco-friendly Ferroelectric photovoltaic devices. ",
        " A structurally stable crystalline carbon allotrope is predicted by means of the first-principles calculations. This allotrope can be derived by substituting each atom in diamond with a carbon tetrahedron, and possesses the same space group Fd^1 3m as diamond, which is thus coined as T- carbon. The calculations on geometrical, vibrational and electronic properties reveal that T-carbon, with a considerable structural stability and a much lower density 1.50 g/cm3, is a semiconductor with a direct band gap about 3.0 eV, and has a Vickers hardness 61.1 GPa lower than diamond but comparable with cubic boron nitride. Such a fo of carbon, once obtained, would have wide applications in photocatalysis, adsoption, hydrogen storage and aerospace materials. ",
        " We have investigated the solvation dynamics and the genuine binding energy and photoemission anisotropy of the solvated electron in neutral water clusters with a combination of time-resolved photoelectron velocity map imaging and electron scattering simulations. The dynamics was probed with a UV probe pulse following above-band-gap excitation with a EUV pump pulse. The solvation dynamics is completed within about 2 ps. Only a single band is observed in the spectra, with no indication for isomers with distinct binding energies. Data analysis with an electron scattering model reveals a genuine binding energy in the range of 3.55-3.85 eV and a genuine anisotropy parameter in the range of 0.51-0.66 for the ground-state hydrated electron. All these observations coincide with those for liquid bulk, which is rather unexpected for an average cluster size of 300 molecules. ",
        " Since the early 1960s, alloys are commonly grouped into two classes, featuring bound states in the bandgap (I) or additional, non-discrete band states (II). Microscopic material parameters for class I alloys can directly be extracted from photoluminescence (PL) spectra, whereas any conclusions drawn for class II alloys usually remain indirect and limited to macroscopic assertions. Nonetheless, here, we present a spectroscopic study on exciton localization in a so-called mixed crystal alloy (class II) that allows us to access microscopic alloy parameters. We study bulk InxGa1-xN epilayers at the onset of alloy foation (0 leq x leq 2.4%) in order to understand the material's particular robustness to defects. Based on an in-depth PL analysis it is demonstrated how different excitonic complexes (free, bound, and complex bound excitons) can serve as a probe to monitor the dilute limit of class II alloys. From an x-dependent linewidth analysis we extract the length scales at which excitons become increasingly localized, meaning that they convert from a free to a bound particle upon alloy foation. Already at x = 2.4% the average exciton diffusion length is reduced to 5.7 pm 1.3 nm at a temperature of 12 K, thus, detrimental exciton transfer mechanisms towards non-radiative defects are suppressed. In addition, the associated low temperature PL data suggests that a single indium atom does not suffice in order to peanently capture an exciton. Micro-PL spectra even give access to a forthright probing of silicon bound excitons embedded in a particular environment of indium atoms, thanks to the emergence of a hierarchy of individual, energetically sharp emission lines (full width at half maximum approx 300 mueV). Consequently, the present study allows us to extract first microscopic alloy properties foerly only accessible for class I alloys. ",
        " The novel carbon allotrope with particular and unique 2D arrangement of carbon atoms similar to a Cairo pentagonal tiling, with interplay of sp^3 and sp^2 hybridized carbon atoms is called of Penta-graphene (PG). Previous theoretical investigations have shown that PG monolayer is mechanically and theodynamically stable, possessing also a large band gap of 3.25eV. This new carbon allotrope with unique carbon atom arrangement in a network (non-coplanar pentagons) is the focus of the theoretical investigations in this work. Using the non-equilibrium molecular dynamics simulations with reactive modern force field ReaxFF, we perfoed computational modeling of the nanostructural, dynamics e mechanical properties of penta-graphene monolayer under high temperature conditions. We obtained in our results the effect of the temperature in mechanical properties of penta-graphene monolayer up to 2000K, where our results show that strain rate was strong effect on the mechanical properties with reduction of the 67%, reduction in the Ultimate Tensile Streght (UTS) 35.88 - 11.83GPa.nm and Young's Modulus (YMod) of the 227.15 - 154.76GPa.nm . In this work we also calculated the reactive degradation of monolayer of penta-graphene at temperatures changes of 10K up to 2000K. Thus, our averages show that penta-graphene monolayer loss atomic configurations with temperature effect up to 600K, where the monolayer show nanostructural transition with several islands of graphene, large regions of porosity, small 1D carbon chains, and also negative curved layer. ",
        " Two-dimensional (2D) transition metal dichalcogenides (TMDs) exhibit novel electrical and optical properties and are emerging as a new platfo for exploring 2D semiconductor physics. Reduced screening in 2D results in dramatically enhanced electron-electron interactions, which have been predicted to generate giant bandgap renoalization and excitonic effects. Currently, however, there is little direct experimental confiation of such many-body effects in these materials. Here we present an experimental observation of extraordinarily large exciton binding energy in a 2D semiconducting TMD. We accomplished this by deteining the single-particle electronic bandgap of single-layer MoSe2 via scanning tunneling spectroscopy (STS), as well as the two-particle exciton transition energy via photoluminescence spectroscopy (PL). These quantities yield an exciton binding energy of 0.55 eV for monolayer MoSe2, a value that is orders of magnitude larger than what is seen in conventional 3D semiconductors. This finding is corroborated by our ab initio GW and Bethe Salpeter equation calculations, which include electron correlation effects. The renoalized bandgap and large exciton binding observed here will have a profound impact on electronic and optoelectronic device technologies based on single-layer semiconducting TMDs. ",
        " Most recently, boron-graphdiyne, a pi-conjugated two-dimensional (2D) structure made from merely sp carbon skeleton connected with boron atoms was successfully experimentally realized through a bottom-to-up synthetic strategy. Motivated by this exciting experimental advance, we conducted density functional theory (DFT) and classical molecular dynamics simulations to study the mechanical, theal conductivity and stability, electronic and optical properties of single-layer B-graphdiyne. We particularly analyzed the application of this novel 2D material as an anode for Li, Na, Mg and Ca ions storage. Uniaxial tensile simulation results reveal that B-graphdiyne owing to its porous structure and flexibility can yield superstretchability. The single-layer B-graphdiyne was found to exhibit semiconducting electronic character, with a narrow band-gap of 1.15 eV based on the HSE06 prediction. It was confied that the mechanical straining can be employed to further tune the optical absorbance and electronic band-gap of B-graphdiyne. Ab initio molecular dynamics results reveal that B-graphdiyne can withstand at high temperatures, like 2500 K. The theal conductivity of suspended single-layer B-graphdiyne was predicted to be very low, ~2.5 W/mK at the room temperature. Our first-principles results reveal the outstanding prospect of B-graphdiyne as an anode material with ultrahigh charge capacities of 808 mAh/g, 5174 mAh/g and 3557 mAh/g for Na, Ca and Li ions storage, respectively. The comprehensive insight provided by this investigation highlights the outstanding physics of B-graphdiyne nanomembranes, and suggest them as highly promising candidates for the design of novel stretchable nanoelectronics and energy storage devices. ",
        " In this work, we report the effects of calcination temperature on structural, dielectric, semiconducting and optical properties of YFeO3 nanoparticles prepared by a high energy ball milling process. The structural analysis of the X-ray diffraction data shows that YFeO3 exists in orthorhombic as well as in hexagonal mixed-phase states. The Rietveld analysis confis that orthorhombic YFeO3 crystallizes into Pnma space group. The optical band gap of YFeO3 reduces from 1.96 eV to 1.68 eV with increasing the calcination temperature of the YFeO3 sample. The bandgap reducing effect might be attributed to the increased crystallite size and decreased lattice strain which is confied by the Williamson-Hall plot method. The obtained low bandgap YFeO3 ceramic may provide a new possibility to develop eco-friendly Ferroelectric photovoltaic devices. ",
        " Computing the GW quasiparticle bandstructure and Bethe-Salpeter Equation (BSE) absorption spectra for materials with spin-orbit coupling has commonly been done by treating GW corrections and spin-orbit coupling as separate perturbations to density-functional theory. However, accurate treatment of materials with strong spin-orbit coupling often requires a fully relativistic approach using spinor wavefunctions in the Kohn-Sham equation and GW/BSE. Such calculations have only recently become available, in particular for the BSE. We have implemented this approach in the plane-wave pseudopotential GW/BSE code BerkeleyGW, which is highly parallelized and widely used in the electronic-structure community. We present reference results for quasiparticle bandstructures and optical absorption spectra of solids with different strengths of spin-orbit coupling, including Si, Ge, GaAs, GaSb, CdSe, Au, and Bi2Se3. The calculated quasiparticle band gaps of these systems are found to agree with experiment to within a few tens of meV. The absorption spectrum of GaSb calculated with the fully-relativistic GW-BSE captures the large spin-orbit splitting of peaks in the spectrum. For Bi2Se3, we find a drastic change in the low-energy bandstructure compared to that of DFT, with the fully-relativistic treatment of the GW approximation correctly capturing the parabolic nature of the valence and conduction bands after including off-diagonal self-energy matrix elements. We present the detailed methodology, approach to spatial symmetries for spinors, comparison against other codes, and perfoance compared to spinless GW/BSE calculations and perturbative approaches to SOC. This work aims to spur further development of spinor GW/BSE methodology in excited-state research software. ",
        " In two-dimensional materials research, oxidation is usually considered as a common source for the degradation of electronic and optoelectronic devices or even device failure. However, in some cases a controlled oxidation can open the possibility to widely tune the band structure of 2D materials. In particular, we demonstrate the controlled oxidation of titanium trisulfide (TiS3), a layered semiconductor that has attracted much attention recently thanks to its quasi-1D electronic and optoelectronic properties and its direct bandgap of 1.1 eV. Heating TiS3 in air above 300 degC gradually converts it into TiO2, a semiconductor with a wide bandgap of 3.2 eV with ap-plications in photo-electrochemistry and catalysis. In this work, we investigate the controlled theal oxidation of individual TiS3 nanoribbons and its influence on the optoelectronic properties of TiS3-based photodetectors. We observe a step-wise change in the cut-off wavelength from its pristine value ~1000 nm to 450 nm after subjecting the TiS3 devices to subsequent theal treatment cycles. Ab-initio and many-body calculations confi an increase in the bandgap of titanium oxysulfide (TiO2-xSx) when increasing the amount of oxygen and reducing the amount of sulfur. ",
        " Multiferroic bismuth ferrite Bi2Fe4O9 (BFO) ceramic was synthesized by conventional solid state reaction route. X-ray diffraction and Rietveld refinement show foation of single phase ceramic with orthorhombic crystal structure (space group Pbam). The morphological study depicted a well-defined grain of size simeq2mum. The optical studies were carried out by using UV-Vis spectrophotometer which shows a band gap of 1.53 eV and a green emission spectrum at 537 is observed in the Photoluminescence study. The frequency dependent dielectric study at various temperature revealed that the dielectric constant decreases with increase in frequency. A noticeable peak shift towards higher frequency with increasing temperature is observed in the frequency dependent dielectric loss plot. The impedance spectroscopy shows a substantial shift in imaginary impedance (Z\") peaks toward the high frequency side described that the conduction in material favoring the long range motion of mobile charge carriers. The presence of non-Debye type multiple relaxations has been confied by complex modulus analysis. The frequency dependent ac conductivity at different temperatures indicates that the conduction process is theally activated. The variation of dc conductivity exhibited a negative temperature coefficient of resistance behavior. The activation energy calculated from impedance, modulus and conductivity data confied that the oxygen vacancies play a vital role in the conduction mechanism. ",
        " We propose a new 2D semiconductor material (TTA-2D) based on the molecular structure of Thiophene-Tetrathia-Annulene (TTA). The TTA-2D structural, electronic, and optical properties were investigated using textitab initio methods. Our results show that TTA-2D is a small indirect bandgap semiconductor (0.6 eV). A semiconductor-metal transition can be induced by applying a uniaxial strain. Our results also show that TTA-2D is theally stable up to T=1000 K. TTA-2D absorbs in a large spectral range, from infrared to ultraviolet regions. Values of refractive index and reflectivity show that TTA-2D reflects only 10% of the incident light in the visible region. These results suggest that TTA-2D is a promising material for solar cell applications. ",
        " Resonance Raman scattering, which probes electrons, phonons and their interplay in crystals, is extensively used in two-dimensional materials. Here we investigate Raman modes in MoSe2 at different laser excitation energies from 2.33 eV down to the near infrared 1.16 eV. The Raman spectrum at 1.16 eV excitation energy shows that the intensity of high-order modes is strongly enhanced if compared to the first-order phonon modes intensity due to resonance effects with the MoSe2 indirect band gap. By comparing the experimental results with the two-phonon density of states calculated with density functional theory, we show that the high-order modes originate mostly from two-phonon modes with opposite momenta. In particular, we identify the momenta of the phonon modes that couple strongly with the electrons to produce the resonance process at 1.16 eV, while we verify that at 2.33 eV the two-phonon modes lineshape compares well with the two-phonon density of state calculated over the entire Brillouin Zone. We also show that, by lowering the crystal temperature, we actively suppress the intensity of the resonant two-phonon modes and we interpret this as the result of the increase of the indirect band gap at low temperature that moves our excitation energy out of the resonance condition. ",
        " Here, we isolate thin TiS3 ribbons, a layered direct band gap semiconductor (1.1 eV, well suited for detection all across the visible spectrum), thus far almost unexplored. We fabricate field effect transistors and study their electrical characteristics and optoelectronic properties. The measured FET characteristics show mobilities up to 2.6 cm^2/Vs and ON/OFF ratios up to 10^4. Under illumination, the TiS3 NR-FETs present an ultrahigh photoresponse of 2910 A/W and fast rise/fall times of ~4 ms. In addition, we measure cutoff frequencies (f3dB) up to 1000 Hz. The strong combination of ultrahigh sensitivity all along the visible spectrum and fast time response of TiS3 nanoribbon transistors put them among the best nanoscale photodetectors to date. ",
        " In this study, a complete study of the effect of hydrotheal reaction temperatures on the synthesis and physical properties of V2O5 using the green facile mild hydrotheal method has been perfoed with six different temperatures 100 degC to 200 degC, in the step of 20 degC. . The XRD pattern confi the stable orthorhombic crystal structure of the synthesized samples at all reaction temperatures. The SEM and TEM images demonstrate the particle-like morphology, and these characterizations affied that the particles size became larger with the increase of reaction temperatures. The FTIR analysis is employed to study the functional groups, and the obtained results are consistent with the XRD analysis. The bandgap has been estimated at various reaction temperatures using UV-vis diffuse reflectance spectra (UV-DRS) and was found to be varied 2.09 eV to 2.15 eV that are suitable range to absorb a significant amount of visible light. The photocatalysis of methylene blue (MB) with synthesized samples has been accomplished to investigate photocatalytic efficiency. The pure V2O5 synthesized at lower reaction temperature (100 degC) possess a lower bandgap and, accordingly, higher photocatalytic efficiency. ",
        " Copper indium disulfide (CuInS2) grown under Cu-rich conditions exhibits high optical quality but suffers predominantly from charge carrier interface recombination resulting in poor solar cell perfoance. An unfavorable cliff like conduction band alignment at the buffer/CuInS2 interface could be a possible cause of enhanced interface recombination in the device. In this work, we exploit direct and inverse photoelectron spectroscopy together with electrical characterization to investigate the cause of interface recombination in Zn(O,S)/CuInS2 devices. Temperature-dependent current-voltage analysis indeed reveal an activation energy of the dominant charge carrier recombination path, considerably smaller than the absorber bandgap, confiing the dominant recombination channel to be present at the Zn(O,S)/CuInS2 interface. However, photoelectron spectroscopy measurements indicate a small spike like conduction band offset of 0.1 eV at the Zn(O,S) CuInS2 interface, excluding an unfavorable energy level alignment to be the prominent cause for strong interface recombination. The observed band bending upon interface foation also rules out Fei level pinning as the main reason, leaving near-interface defects (as recently observed in Cu-rich CuInSe2)1 as the likely reason for the perfoance limiting interface recombination. ",
        " Semiconductors with wide band gap (3.0 eV), high dielectric constant (> 10), good theal dissipation, and capable of n- and p-type doping are highly desirable for high-energy power electronic devices. Recent studies indicate that ZnGa2O4 may be suitable for these applications, standing out as an alternative to Ga2O3. The simple face centered cubic spinel structure of ZnGa2O4 results in isotropic electronic and optical properties, in contrast to the large anisotropic properties of the beta-monoclinic Ga2O3. In addition, ZnGa2O4 has shown, on average, better theal dissipation and potential for n- and p-type conductivity. Here we use density functional theory and hybrid functional calculations to investigate the electronic, optical, and point defect properties of ZnGa2O4, focusing on the possibility for n- and p-type conductivity. We find that the cation antisite GaZn is the lowest energy donor defect that can lead to unintentional n-type conductivity. The stability of self-trapped holes (small hole polarons) and the high foation energy of acceptor defects make it difficult to achieve p-type conductivity. However, with excess of Zn, foing Zn(1+2x)Ga2(1-x)O4 alloys display an inteediate valence band, facilitating p-type conductivity. Due to the localized nature of this inteediate valence band, p-type conductivity by polaron hopping is expected, explaining the low mobility and low hole density observed in recent experiments. ",
        " Electrical field control of the carrier density of topological insulators (TI) has greatly expanded the possible practical use of these materials. However, the combination of low temperature local probe studies and a gate tunable TI device remains challenging. We have overcome this limitation by scanning tunneling microscopy and spectroscopy measurements on in-situ molecular beam epitaxy growth of Bi2Se3 films on SrTiO3 substrates with pre-patterned electrodes. Using this gating method, we are able to shift the Fei level of the top surface states by 250 meV on a 3 nm thick Bi2Se3 device. We report field effect studies of the surface state dispersion, band gap, and electronic structure at the Fei level. ",
        " We present a new approach to ubiquitous sensing for indoor applications, using high-efficiency and low-cost indoor perovksite photovoltaic cells as external power sources for backscatter sensors. We demonstrate wide-bandgap perovskite photovoltaic cells for indoor light energy harvesting with the 1.63eV and 1.84 eV devices demonstrate efficiencies of 21% and 18.5% respectively under indoor compact fluorescent lighting, with a champion open-circuit voltage of 0.95 V in a 1.84 eV cell under a light intensity of 0.16 mW/cm2. Subsequently, we demonstrate a wireless temperature sensor self-powered by a perovskite indoor light-harvesting module. We connect three perovskite photovoltaic cells in series to create a module that produces 14.5 uW output power under 0.16 mW/cm2 of compact fluorescent illumination with an efficiency of 13.2%. We use this module as an external power source for a battery-assisted RFID temperature sensor and demonstrate a read range by of 5.1 meters while maintaining very high frequency measurements every 1.24 seconds. Our combined indoor perovskite photovoltaic modules and backscatter radio-frequency sensors are further discussed as a route to ubiquitous sensing in buildings given their potential to be manufactured in an integrated manner at very low-cost, their lack of a need for battery replacement and the high frequency data collection possible. ",
        " Magnetic properties and band characteristics of graphene-nano-ribbon (GNR) modified by Fe, Co, and Ni were analyzed by the first principles DFT calculation. Typical unit cell is [C32H2Fe1], [C32H2Co1] and [C32H2Ni1] respectively. The most stable spin state was Sz=4/2 for Fe-modified GNR, whereas Sz=3/2 for Co-case and Sz=2/2 for Ni-case. Atomic magnetic moment of Fe, Co and Ni were 3.63, 2.49 and 1.26 muB, which were reduced values than that of atomic Hund-rule due to magnetic coupling with graphene network. There is a possibility for a ferromagnetic Fe, Co and Ni spin array through an interaction with carbon pi-conjugated spin system. By expanding a unit cell of Co-modified case as [C96H6Co3], ferromagnetic like spin state and ferrimagnetic like one were compared. It was concluded that ferromagnetic state was more stable magnetic state. Band calculations of Co-modified case show half-metal like structure with relatively large band gap (0.55eV) for up-spin, whereas small gap (0.05eV) for down-spin. This suggested a capability of spintronics application like a spin fiter. ",
        " Phase change alloys are used for non-volatile random access memories exploiting the conductivity contrast between amorphous and metastable, crystalline phase. However, this contrast has never been directly related to the electronic band structure. Here, we employ photoelectron spectroscopy to map the relevant bands for metastable, epitaxial GeSbTe films. The constant energy surfaces of the valence band close to the Fei level are hexagonal tubes with little dispersion perpendicular to the (111) surface. The electron density responsible for transport belongs to the tails of this bulk valence band, which is broadened by disorder, i.e., the Fei level is 100 meV above the valence band maximum. This result is consistent with transport data of such films in tes of charge carrier density and scattering time. In addition, we find a state in the bulk band gap with linear dispersion, which might be of topological origin. ",
        " Nonlinear optics of semiconductors is an important field of fundamental and applied research, but surprisingly the role of excitons in the coherent processes leading to haonics generation has remained essentially unexplored. Here we report results of a comprehensive experimental and theoretical study of the three-photon process of optical second haonic generation (SHG) involving the exciton resonances of the noncentrosymmetric hexagonal wide-band-gap semiconductor ZnO in the photon energy range of 3.2-3.5 eV. Resonant crystallographic SHG is observed for the 1s(A,B), 2s(A,B), 2p(A,B), and 1s(C) excitons. We show that strong SHG signals at these exciton resonances are induced by the application of a magnetic field when the incident and the SHG light wave vectors are along the crystal z-axis where the crystallographic SHG response vanishes. A microscopic theory of SHG generation through excitons is developed, which shows that the nonlinear interaction of coherent light with excitons has to be considered beyond the electric-dipole approximation. Depending on the particular symmetry of the exciton states SHG can originate from the electric- and magnetic-field-induced perturbations of the excitons due to the Stark effect, the spin as well as orbital Zeeman effects, or the magneto-Stark effect. The importance of each mechanism is analyzed and discussed by confronting experimental data and theoretical results for the dependencies of the SHG signals on photon energy, magnetic field, electric field, crystal temperature, and light polarization. Good agreement is obtained between experiment and theory proving the validity of our approach to the complex problem of nonlinear interaction of light with ZnO excitons. This general approach can be applied also to other semiconductors. ",
        " A nonlocal energy-balance equation is derived for the optical absorption, photoluminescence and inelastic electron-phonon scattering, which deteines the electron and hole temperatures for any given lattice temperature. The evolution of the lattice temperature is found to be deteined by the difference between the power-loss density due to photoluminescence and the power-gain density due to optical absorption, as well as by the initial lattice temperature. We find that in addition to the expected decrease in the lattice temperature, the electron temperature also decreases with time. A laser-cooling power as high as 380 eV/s is predicted for the wide bandgap semiconductor AlN initially at room temperature when the pump-laser field is only 10 V/cm. Laser cooling is found to be more efficient for a large bandgap material, a weaker laser field, and a high initial lattice temperature. The laser-cooling rate then decreases as the lattice cools. The theory presented here provides quantitative predictions that can guide future experiments. ",
        " Based on density functional theory (DFT) calculations, we predict that a monolayer of OsCl3---a layered material whose interlayer coupling is weaker than in graphite---possesses a quantum anomalous Hall (QAH) insulating phase generated by the combination of honeycomb lattice of osmium atoms, their strong spin-orbit coupling (SOC) and ferromagnetic ground state with em in-plane easy-axis. The band gap opened by SOC is mboxEg simeq 67 meV (or mboxsimeq 191 meV if the easy-axis can be tilted out of the plane by an external electric field), and the estimated Curie temperature of such em anisotropic planar rotator ferromagnet is TmathC lesssim 350 K. The Chern number mathcalC=-1, generated by the manifold of Os t2g bands crossing the Fei energy, signifies the presence of a single chiral edge state in nanoribbons of finite width, where we further show that edge states are spatially narrower for zigzag than achair edges and investigate edge-state transport in the presence of vacancies at Os sites. Since 5d electrons of Os exhibit em both strong SOC and moderate correlation effects, we employ DFT+U calculations to show how increasing on-site Coulomb repulsion U: gradually reduces Eg while maintaining mathcalC = -1 for 0 < U < Uc; leads to metallic phase with Eg = 0 at Uc; and opens the gap of topologically trivial Mott insulating phase with mathcalC=0 for U > Uc. ",
        " The detection of low-energy deposition in the range of sub-eV through ionization using geanium (Ge) with a bandgap of sim0.7 eV requires internal amplification of charge signal. This can be achieved through high electric field which accelerates charge carriers to generate more charge carriers. The minimum electric field required to generate internal charge amplification is derived for different temperatures. A point contact Ge detector provides extremely high electric field in proximity to the point contact. We show the development of a planar point contact detector and its perfoance. The field distribution is calculated for this planar point contact detector. We demonstrate the required electric field can be achieved with a point contact detector. ",
        " We show how an accurate first-principles treatment of the canted-antiferromagnetic ground state of Sr2IrO4, a prototypical 5d correlated spin-orbit coupled material, can be obtained without invoking any free parameters such as the Hubbard U or tuning the spin-orbit coupling strength. Our theoretically predicted iridium magnetic moment of 0.250 muB, canted by 12.6^circ off the a-axis, is in accord with experimental results. By resolving the magnetic moments into their spin and orbital components, we show that our theoretically obtained variation of the magnetic scattering amplitude <Mm> as a function of the polarization angle is consistent with recent non-resonant magnetic x-ray scattering measurements. The computed value of the band gap (55 meV) is also in line with the corresponding experimental values. A comparison of the band structure to that of the cuprates suggests the presence of incommensurate charge-density wave phases in Sr2IrO4. ",
        " We study optical properties of two dimensional silicene using density functional theory based calculations. Our results on optical response property calculations show that they strongly depend on direction of polarization of light, hence the optical absorption spectra are different for light polarized parallel and perpendicular to plane of silicence. The optical absorption spectra of silicene possess two major peaks: (i) a sharp peak at 1.74 eV due to transition from pi to pi* states and (ii) a broad peak in range of 4-10 eV due to excitation of sigma states to conduction bands. We also investigate the effect of external influences such as (a) transverse static electric field and (b) doping of hydrogen atoms (hydrogenation) on optical properties of silicene. Firstly, with electric field, it is observed that band gap can be opened up in silicene at Fei level by breaking the inversion symmetry. We see appreciable changes in optical absorption due to band gap opening. Secondly, hydrogenation in silicene strongly modifies the hybridization and our geometry analysis indicates that the hybridization in silicene goes from mixture of sp^2 + sp^3 to purely sp^3. Therefore, there is no pi electron present in the system. Consequently, the electronic structure and optical absorption spectra of silicene get modified and it undergoes a transition from semi-metal to semiconductor due to hydrogenation. ",
        " Structural, electronic, and transport properties of ScNiSb, ScPdSb, and ScPtSb were investigated from first principles. Electronic band structures derived within the fully relativistic MBJLDA approach were compared with those obtained from the standard GGA calculations. All the compounds studied exhibit indirect narrow band gaps (0.24-0.63 eV). The effective masses of hole-like carriers are relatively small (0.27-0.36), and decrease with an increasing atomic number of the transition metal component. The carrier relaxation time, required for realistic calculations of the electrical conductivity, was approximated within the defoation potential theory. The GGA approach yielded overestimated transport characteristics with respect to those derived within the MBJLDA analysis. The largest power factor of 4-6 mWK^-2m^-1 ) at high temperatures was obtained for ScPtSb. This value is comparable with those observed experimentally for Fe-Nb-Sb half-Heusler alloys, and hence makes ScPtSb a very good candidate material for theoelectric applications. ",
        " We have investigated the band structure at the Gamma point of the three-dimensional (3D) topological insulator Bi2Se3 using magneto-spectroscopy over a wide range of energies (0.55-2.2,eV) and in ultrahigh magnetic fields up to 150,T. At such high energies (E>0.6,eV) the parabolic approximation for the massive Dirac feions breaks down and the Landau level dispersion becomes nonlinear. At even higher energies around 0.99 and 1.6 eV, new additional strong absorptions are observed with a temperature and magnetic-field dependence which suggest that they originate from higher band gaps. Spin orbit splittings for the further lying conduction and valence bands are found to be 0.196 and 0.264 eV. ",
        " New experimental results supported by theoretical analyses are proposed for aluminum silicon carbide (Al4SiC4). A state of the art implementation of the Density Functional Theory is used to analyze the experimental crystal structure, the Born charges, the elastic and piezoelectric properties. The Born charge tensor is correlated to the local bonding environment for each atom. The electronic band structure is computed including self-consistent many-body corrections. Al4SiC4 material properties are compared to other wide band gap W\"urtzite materials. From a comparison between an ellipsometry study of the optical properties and theoretical results, we conclude that the Al4SiC4 material has indirect and direct band gap energies of about 2.5eV and 3.2 eV respectively. ",
        " The functional fo of Coulomb interactions in the transition metal dichalcogenides and other van der Waals solids is critical to many of their unique properties, e.g. strongly-correlated electron states, superconductivity and emergent ferromagnetism. This paper presents measurements of key excitonic energy levels in MoSe2/WSe2 heterostructures. These measurements are obtained from resonance Raman experiments on specific Raman peaks only observed at excited states of the excitons. This data is used to validate a model of the Coulomb potential in these structures which predicts the exciton energies to within ~5 meV / 2.5%. This model is used to deteine the effect of heterostructure foation on the single-particle band gaps of the layers and will have a wide applicability in designing the next generation of more complex transition metal dichalcogenide structures. ",
        " Spatially resolved EELS has been perfoed at diffuse interfaces between MoS2 and MoSe2 single layers. With a monochromated electron source (20 meV) we have successfully probed excitons near the interface by obtaining the low loss spectra at the nanometer scale. The exciton maps clearly show variations even with a 10 nm separation between measurements; consequently the optical bandgap can be measured with nanometer-scale resolution, which is 50 times smaller than the wavelength of the emitted photons. By perfoing core-loss EELS at the same regions, we observe that variations in the excitonic signature follow the chemical composition. The exciton peaks are observed to be broader at interfaces and heterogeneous regions, possibly due to interface roughness and alloying effects. Moreover, we do not observe shifts of the exciton peak across the interface, possibly because the interface width is not much larger than the exciton Bohr radius. ",
        " The nanocrystalline Ni0.7Cu0.3AlxFe2-xO4 (x=0.00: 0.02: 0.10) is prepared through the sol-gel autocombustion route.Both XRD and Rietveld confi the single-phase cubic spinel structure of the investigated materials.Other structural parameters refined by the Rietveld refinement analysis are corroborated to single-phase cubic spinel foation of the NPs.Leveraging a vibrating sample magnetometer (VSM) the consequence of Al3+ substitution on the magnetic parameters is studied.The saturation magnetization (MS) and Bohr magneton are found to decrease with Al3+ substitution.The Remanence ratio and coercivity (HC) are observed to be very low suggesting the materials are soft ferromagnetic.First-principle calculations were carried out using the density functional theory (DFT) to demonstrate the optoelectronic behavior of the materials.The electronic bandgap is found low as Eg=2.99eV for the explored materials with observing defect states at 0.62eV.The optoelectronic properties of Al3+ substituted Ni-Cu ferrite NPs have been characterized through the DFT simulation for the first time, demonstrating their potentiality for optoelectronic device applications.The materials' optical anisotropy is observed along the x-axis, which manifests their tunability through light-matter interaction. ",
        " We report on the energy level alignment evolution of valence and conduction bands of achair-oriented graphene nanoribbons (aGNR) as their band gap shrinks with increasing width. We use 4,4-dibromo-para-terphenyl as molecular precursor on Au(111) to fo extended poly-para-phenylene nanowires, which can be fused sideways to fo atomically precise aGNRs of varying widths. We measure the frontier bands by means of scanning tunneling spectroscopy, corroborating that the nanoribbons band gap is inversely proportional to their width. Interestingly, valence bands are found to show Fei level pinning as the band gap decreases below a threshold value around 1.7 eV. Such behavior is of critical importance to understand the properties of potential contacts in graphene nanoribbon-based devices. Our measurements further reveal a particularly interesting system for studying Fei level pinning by modifying an adsorbates band gap while maintaining an almost unchanged interface chemistry defined by substrate and adsorbate. ",
        " 2D transition metal dichalcogenides (TMDs) have attracted a lot of attention recently for energy-efficient tunneling-field-effect transistor (TFET) applications due to their excellent gate control resulting from their atomically thin dimensions. However, most TMDs have bandgaps (Eg) and effective masses (m*) outside the optimum range needed for high perfoance. It is shown here that the newly discovered 2D material, few-layer phosphorene, has several properties ideally suited for TFET applications: 1) direct Eg in the optimum range ~1.0-0.4 eV, 2) light transport m* (0.15m0), 3) anisotropic m* which increases the density of states near the band edges, and 4) a high mobility. These properties combine to provide phosphorene TFET outstanding ION 1 mA/um, ON/OFF ratio~1e6, scalability to 6 nm channel length and 0.2 V supply voltage, thereby significantly outperfoing the best TMD-TFETs in energy-delay products. Full-band atomistic quantum transport simulations establish phosphorene TFETs as serious candidates for energy-eficient and scalable replacements of MOSFETs. ",
        " Two-dimensional (2D) niobium oxydihalide NbOI2 has been recently demonstrated as an excellent in-plane piezoelectric and nonlinear optical materials. Here we show that Janus niobium oxydihalide, NbOXY (X, Y = Cl, Br, I and XneqY), is a multifunctional anisotropic semiconductor family with exceptional piezoelectric, electronic, photocatalytic and optical properties. NbOXY are stable and mechancially flexible monolayers with band gap around the visible light regime of sim 1.9 eV. The anisotropic carrier mobility of NbOXY lies in the range of 10^3 sim 10^4 cm^2V^-1s^-1, which represents some of the highest among 2D semiconductors of bandgap gtrsim 2 eV. Inversion symmetry breaking in Janus NbOXY generates sizable out-of-plane d31 piezoelectric response while still retaining a strong in-plane piezoelectricity. Remarkably, NbOXY exhibits an additional out-of-plane piezoelectric response, d32 as large as 0.55 pm/V. G0W0-BSE calculation further reveals the strong linear optical dichroism of NbOXY in the visible-to-ultraviolet regime. The optical absorption peaks with 14sim18 % in the deep UV regime (5sim6 eV), outperfoing the vast majority of other 2D materials. The high carrier mobility, strong optical absorption, sizable built-in electric field and band alignment compatible with overall water splitting further suggest the strengths of NbOXY in energy conversion application. We further propose a directional stress sensing device to demonstrate how the out-of-plane piezoelectricity can be harnessed for functional device applications. Our findings unveil NbOXY as an exceptional multifunctional 2D semiconductor for flexible electronics, optoelectronics, UV photonics, piezoelectric and sustainable energy applications. ",
        " Emergent quantum phenomena in two-dimensional van der Waal (vdW) magnets are largely governed by the interplay between the exchange and Coulomb interactions. The ability to tune the Coulomb interaction in such strongly correlated materials enables the precise control of spin-correlated flat-band states, bandgap (Eg) and unconventional magnetism, all of which are crucial for next-generation spintronics and magnonics applications. Here, we demonstrate a giant gate-tunable renoalization of spin-correlated flat-band states and bandgap in magnetic chromium tribromide (CrBr3) monolayers grown on graphene. Our gate-dependent scanning tunneling spectroscopy (STS) studies reveal that the inter-flat-band spacing and bandgap of CrBr3 can be continuously tuned by 120 meV and 240 meV respectively via electrostatic injection of carriers into the hybrid CrBr3/graphene system, equivalent to the modulation of the Cr on-site Coulomb repulsion energy by 500 meV. This can be attributed to the self-screening of CrBr3 arising from the gate-induced carriers injected into CrBr3, which dominates over the opposite trend from the remote screening of the graphene substrate. Precise tuning of the spin-correlated flat-band states and bandgap in 2D magnets via electrostatic modulation of Coulomb interactions not only provides new strategies for optimizing the spin transport channels but also may exert a crucial influence on the exchange energy and spin-wave gap, which could raise the critical temperature for magnetic order. ",
        " Organohalide perovskite with a variety of surface structures and morphologies have shown promising potential owing to the choice of the type of heterostructure dependent stability. We systematically investigate and discuss the impact of 2-dimensional molybdenum-disulphide (MoS2), molybdenum-diselenide (MoSe2), tungsten-disulphide (WS2), tungsten-diselenide (WSe2), boron- nitiride (BN) and graphene monolayers on band-gap and energy stability of organic-inorganic halide perovskites. We found that MAPbI3ML deposited on BN-ML shows room temperature stability (-25 meV~300K) with an optimal bandgap of ~1.6 eV. The calculated absorption coefficient also lies in the visible-light range with a maximum of 4.9 x 104 cm-1 achieved at 2.8 eV photon energy. On the basis of our calculations, we suggest that the encapsulation of an organic-inorganic halide perovskite monolayers by semiconducting monolayers potentially provides greater flexibility for tuning the energy stability and the bandgap. ",
        " Photoluminescence study using the 325 nm He-Cd excitation is reported for the Au nanoclusters embedded in SiO2 matrix. Au clusters are grown by ion beam mixing with 100 KeV Ar+ irradiation on Au [40 nm]/SiO2 at various fluences and subsequent annealing at high temperature. The blue bands above ~3 eV match closely with reported values for colloidal Au nanoclusters and supported Au nanoislands. Radiative recombination of sp electrons above Fei level to occupied d-band holes are assigned for observed luminescence peaks. Peaks at 3.1 eV and 3.4 eV are correlated to energy gaps at the X- and L-symmetry points, respectively, with possible involvement of relaxation mechanism. The blue shift of peak positions at 3.4 eV with decreasing cluster size is reported to be due to the compressive strain in small clusters. A first principle calculation based on density functional theory using the full potential linear augmented plane wave plus local orbitals (FP-LAPW+LO) foalism with generalized gradient approximation (GGA) for the exchange correlation energy is used to estimate the band gaps at the X- and L-symmetry points by calculating the band structures and joint density of states (JDOS) for different strain values in order to explain the blueshift of ~0.1 eV with decreasing cluster size around L-symmetry point. ",
        " The large family of layered transition-metal dichalcogenides is widely believed to constitute a second family of two-dimensional (2D) semiconducting materials that can be used to create novel devices that complement those based on graphene. In many cases these materials have shown a transition from an indirect bandgap in the bulk to a direct bandgap in monolayer systems. In this work we experimentally show that folding a 1H molybdenum disulphide (MoS2) layer results in a turbostratic stack with enhanced photoluminescence quantum yield and a significant shift to the blue by 90 meV. This is in contrast to the expected 2H-MoS2 band structure characteristics, which include an indirect gap and quenched photoluminescence. We present a theoretical explanation to the origin of this behavior in tes of exciton screening. ",
        " Thin films of amorphous (a)-TiO2 are ubiquitous as photocatalysts, protective coatings, photoanodes and in memory application, where they are exposed to excess electrons and holes. We investigate trapping of excess electrons and holes in the bulk of pure amorphous titanium dioxide, a-TiO2, using hybrid density functional theory (h-DFT) calculations. Fifty 270-atom a-TiO2 structures were produced using classical molecular dynamics and their geometries fully optimised using h-DFT simulations. They have the density, distribution of atomic coordination numbers and radial pair-distribution functions in agreement with experiment. The calculated average a-TiO2 band gap is 3.25 eV with no states splitting into the band gap. Trapping of excess electrons and holes in a-TiO2 is predicted at precursor sites, such as elongated Ti-O bonds. Single electron and hole polarons have average trapping energies (ET) of -0.4 eV and -0.8 eV, respectively. We also identify several types of electron and hole bipolaron states and discuss their stability. These results can be used for understanding the mechanisms of photo-catalysis and improving the perfoance of electronic devices employing a-TiO2 films. ",
        " Using first-principles calculations, we study the electronic properties of few-layer phosphorene focusing on layer-dependent behavior of band gap, work function and band alignment and carrier effective mass. It is found that few-layer phosphorene shows a robust direct band gap character, and its band gap decreases with the number of layers following a power law. The work function decreases rapidly from monolayer (5.16 eV) to trilayer (4.56 eV), and then slowly upon further increasing the layer number. Compared to monolayer phosphorene, there is a drastic decrease of hole effective mass along the ridge (zigzag) direction for bilayer phosphorene, indicating a strong interlayer coupling and screening effect. Our study suggests that 1). Few-layer phosphorene with a layer-dependent band gap and a robust direct band gap character is promising for efficient solar energy harvest. 2). Few-layer phosphorene outperfos monolayer counterpart in tes of a lighter carrier effective mass, a higher carrier density and a weaker scattering due to enhanced screening. 3). The layer-dependent band edges and work functions of few-layer phosphorene allow for modification of Schottky barrier with enhanced carrier injection efficiency. It is expected that few-layer phosphorene will present abundant opportunities for a plethora of new electronic applications. ",
        " Halide double perovskites with alternating silver and pnictogen cations are an emerging family of photoabsorber materials with robust stability and band gaps in the visible range. However, the nature of optical excitations in these systems is not yet well understood, limiting their utility. Here, we use ab initio many-body perturbation theory within the GW approximation and the Bethe-Salpeter equation approach to calculate the electronic structure and optical excitations of the double perovskite series Cs2AgBX6, with B=Bi^3+, Sb^3+, X = Br^-, Cl^-. We find that these materials exhibit strongly localized resonant excitons with energies from 170 to 434 meV below the direct band gap. In contrast to lead-based perovskites, the Cs2AgBX6 excitons are computed to be non-hydrogenic, with anisotropic effective masses and sensitive to local field effects, a consequence of their chemical heterogeneity. Our calculations demonstrate the limitations of the Wannier-Mott and Elliott models for this class of double perovskites and contribute to a detailed atomistic understanding of their light-matter interactions. ",
        " The discovery of graphene triggered a rapid rise of unexplored two-dimensional materials and heterostructures having optoelectronic and photonics properties that can be tailored on the nanoscale. Among these materials, black phosphorus (BP) has attracted a remarkable interest thanks to many favorable properties, such as high carrier mobility, in-plane anisotropy, the possibility to alter its transport via electrical gating and direct band-gap, that can be tuned by thickness from 0.3 eV (bulk crystalline) to 1.7 eV (single atomic layer). When integrated in a microscopic field effect transistor (FET), a few-layer BP flake can detect Terahertz (THz) frequency radiation. Remarkably, the in-plane crystalline anisotropy can be exploited to tailor the mechanisms that dominate the photoresponse; a BP-based field effect transistor can be engineered to act as a plasma-wave rectifier, a theoelectric sensor or a theal bolometer. Here we present a review on recent research on BP detectors operating from 0.26 THz to 3.4 THz with particular emphasis on the underlying physical mechanisms and the future challenges that are yet to be addressed for making BP the active core of stable and reliable optical and electronic technologies. ",
        " Ba2CoWO6 (BCoW) has been synthesized in polycrystalline fo by solid state reaction at 1200C. Structural characterization of the compound was done through X-ray diffraction (XRD) followed by Rietveld analysis of the XRD pattern. The crystal structure is cubic, space group Fm-3m (No 225) with the lattice parameter, a=8.210A. Optical band-gap of the present system has been calculated using the UV-Vis Spectroscopy and Kubelka-Munk function, its value being 2.45 eV. A detailed study of the electronic properties has also been carried out using the density functional theory (DFT) techniques implemented on WIEN2k. Importance of electron-electron interaction between the Co ions leading to half-metallic behavior, crystal and exchange splitting together with the hybridization between O and Co, W has been investigated using the total and partial density of states. ",
        " The great obstacle for practical applications of the quantum anomalous Hall (QAH) effect is the lack of suitable QAH materials (Chern insulators) with large non-trivial band gap, room-temperature magnetic order and high carrier mobility. The Nickle chloride (NiCl3) monolayer characteristics are investigated herein using first-principles calculations. It is reported that NiCl3 monolayers constitute a new class of Dirac materials with Dirac spin-gapless semiconducting and high-temperature ferromagnetism (~400K). Taking into account the spin-orbit coupling, the NiCl3 monolayer becomes an intrinsic insulator with a large non-trivial band gap of ~24 meV, corresponding to an operating temperature as high as ~280K at which the quantum anomalous Hall effect could be observed. The calculated large non-trivial gap, high Curie temperature and single-spin Dirac states reported herein for the NiCl3 monolayer lead us to propose that this material give a great promise for potential realization of a near-room temperature QAH effect and potential applications in spintronics. Last but not least the calculated Fei velocities of Dirac feion of about 4x105 m/s indicate very high mobility in NiCl3 monolayers. ",
        " Janus transition-metal dichalcogenide monolayers are fully artificial materials, where one plane of chalcogen atoms is replaced by chalcogen atoms of a different type. Theory predicts an in-built out-of-plane electric field, giving rise to long-lived, dipolar excitons, while preserving direct-bandgap optical transitions in a unifo potential landscape. Previous Janus studies had broad photoluminescence (>15 meV) spectra obfuscating their excitonic origin. Here, we identify the neutral, and negatively charged inter- and intravalley exciton transitions in Janus WSeS monolayer with sim 6 meV optical linewidth. We combine a recently developed synthesis technique, with the integration of Janus monolayers into vertical heterostructures, allowing doping control. Further, magneto-optic measurements indicate that monolayer WSeS has a direct bandgap at the K points. This work provides the foundation for applications such as nanoscale sensing, which relies on resolving excitonic energy shifts, and photo-voltaic energy harvesting, which requires efficient creation of long-lived excitons and integration into vertical heterostructures. ",
        " The first two-dimensional (2D) polymorphs of antimony dioxide, namely, gamma-Sb2O4 and delta-Sb2O4, are predicted using the evolutionary algorithm combined with first-principles density functional theory (DFT) calculations. Out-of-plane ferroelectricity is found in gamma-Sb2O4, while in-plane ferroelectricity is found in delta-Sb2O4. The predicted dipole moments of gamma-Sb2O4 and delta-Sb2O4 phases are 36.63 and 14.96 erA, respectively, implying that they can be good candidates for making ferroelectric devices. The calculations show that doping with other group V elements or applying strain can lower the switching energy barriers and thus facilitate switching. Results from GW calculations show indirect band gaps of 5.51 and 3.39 eV for gamma-Sb2O4 and delta-Sb2O4 in their monolayers, respectively. Raman spectra are calculated to facilitate the experimental investigation of the predicted structures. The existence of both in-plane and out-of-plane 2D ferroelectricity and the large band gaps make this material system particularly interesting for potential applications. ",
        " A three-teinal spectroscopy that probes both subsurface energy barriers and interband optical transitions in a semiconductor heterostructure is demonstrated. A metal-base transistor with a unipolar p-type semiconductor collector embedding InAs/GaAs quantum dots (QDs) is studied. Using minority/majority carrier injection, ballistic electron emission spectroscopy and its related hot-carrier scattering spectroscopy measures barrier heights of a buried AlxGa1-xAs layer in conduction band and valence band respectively, the band gap of Al0.4Ga0.6As is therefore deteined as 2.037 +/- 0.009 eV at 9 K. Under forward collector bias, interband electroluminescence is induced by the injection of minority carriers with sub-bandgap kinetic energies. Three emission peaks from InAs QDs, InAs wetting layer, and GaAs are observed in concert with minority carrier injection. ",
        " SiAlON is a prominent example of systems suitable as hosts for creating materials for light-emitting diodes (LEDs). In this work, the electronic structure of a series of semiordered and disordered SiAlON systems is investigated by means of ab initio calculations, using the FLAPW and Green function KKR methods. Finite temperature effects are included by averaging over theodynamic configurations within the alloy analogy model. We found that the dependence of the electronic structure on the (Al,O) concentration z is similar for semiordered and disordered structures. The electronic band gap decreases with increasing z by about 1.5 eV when going from z=0 to z=2. States at the top of the valence band are mostly associated with N atoms whereas the states at the bottom of the conduction band are mostly derived from O~atoms. Increasing the temperature leads to a shift of the bottom of the conduction band to lower energies. The amount of this shift increases with increasing z. ",
        " Renewable energy resources have emerged as the best alternatives to fossil fuel energy which are rapidly declining with time. Here, eight valence-electron count Half-Heusler(HH) alloys have been studied using reliable first principles calculations in the search of potential candidates for renewable energy applications like theoelectric (TE), solar harvesting, topological insulator (TI) and transparent conductor (TC) applications. The initial screening parameters used for our study are chemical and theal stability, band gap, nature of bandgap and band inversion strength. We have perfoed quasistatic G0W0 calculation starting from HSE groundstate wavefunction to predict the most accurate estimation of bandgap for these class of compounds. A total of 960 compounds were simulated. 121 out of 960 compounds were found to be theally and chemically stable. 31 compounds with bandgap less than 1.5 eV were studied for theoelectric application out of which 13 compounds were found to show theoelectric figure of merit ZT > 0.7 for both p-type and n-type conduction. 30 compounds with band gap 1-1.8 eV were studied for optoelectronic application out of which 13 compounds were found to show Spectroscopic Limited Maximum Efficiency (SLME) more than 20%, comparable to existing state of the art materials. 21 compounds were found to show band inversion at ambient conditions which is a necessary condition for topological insulators. The surface band structure calculations for one of the promising candidate was done to check robustness of the topological behaviour. 29 compounds were found to have bandgap more than 2 eV which are promoted for transparent conductor applications with further band engineering. We strongly believe that our calculations will give useful insights to experimentalists for synthesizing and investigating proposed compounds for different energy applications. ",
        " The scientific community has witnessed tremendous expansion of research on layered (i.e. two-dimensional, 2D) materials, with increasing recent focus on applications to photonics. Layered materials are particularly exciting for manipulating light in the confined geometry of photonic integrated circuits, where key material properties include strong and controllable light-matter interaction, and limited optical loss. Layered materials feature tunable optical properties, phases that are promising for electro-optics, and a panoply of polymorphs that suggest a rich design space for highly-nonperturbative photonic integrated devices based on phase-change functionality. All of these features are manifest in materials with band gap above the photonics-relevant near-infrared (NIR) spectral band (sim 0.5 - 1 eV), meaning that they can be harnessed in refractive (i.e. non-absorptive) applications. ",
        " We report the realization of novel symmetry-protected Dirac feions in a surface-doped two-dimensional (2D) semiconductor, black phosphorus. The widely tunable band gap of black phosphorus by the surface Stark effect is employed to achieve a surprisingly large band inversion up to ~0.6 eV. High-resolution angle-resolved photoemission spectra directly reveal the pair creation of Dirac points and their moving along the axis of the glide-mirror symmetry. Unlike graphene, the Dirac point of black phosphorus is stable, as protected by spacetime inversion symmetry, even in the presence of spin-orbit coupling. Our results establish black phosphorus in the inverted regime as a simple model system of 2D symmetry-protected (topological) Dirac semimetals, offering an unprecedented opportunity for the discovery of 2D Weyl semimetals. ",
        " We use first-principles calculations based on many-body perturbation theory to investigate the near-edge electronic and optical properties of beta-Ga2O3. The fundamental band gap is indirect, but the minimum direct gap is only 29 meV higher in energy, which explains the strong near-edge absorption. Our calculations verify the anisotropy of the absorption onset and explain the range (4.4-5.0 eV) of experimentally reported band-gap values. Our results for the radiative recombination rate indicate that intrinsic light emission in the deep-UV range is possible in this indirect-gap semiconductor at high excitation. Our work demonstrates the applicability of beta-Ga2O3 for deep-UV detection and emission. ",
        " We have investigated electronic energy band structures and partial density of states of inteetallic compounds textitviz. CrSi, MnSi, FeSi and CoSi, by using density functional theory (DFT). CrSi & MnSi, FeSi and CoSi have metallic, indirect band gap semiconducting (band gap sim 90 meV) and semi-metallic ground state, respectively. On studying the band structures while going across the series Cr-Co, the occupied bands around the Fei level are getting narrower while the unoccupied bands are getting wider. Similarly, band edge in partial density of states is shifting away from the Fei level due to increased hybridizations. The effective mass of holes for FeSi is found to be much larger than that of electrons, giving rise to positive Seebeck coefficient and negative Hall coefficient, which is consistent with experimental results. For different ionic states of 3textitd-metal, the values of textitUeff and textitJ are evaluated by using constrained DFT method. textitUeff (textitJ) for 2^+ ionic state across the series are sim 3.3 eV (sim 0.65 eV), sim 3.7 eV (sim 0.72 eV), sim 4.4 eV (sim 0.82 eV) and sim 4.5 eV (sim 0.87 eV). lambda and textitJ are also calculated by considering Yukawa fo of Coulomb interaction. lambda values for 2^+ ionic state along the series are sim 1.97 a.u^-1, sim 2.07 a.u^-1, sim 2.07 a.u^-1 and sim 2.34 a.u^-1. 4textits electrons are found to be contributing more in screening the 3textitd electrons as compared to 4textitp electrons of 3textitd metals. ",
        " We investigate the effects of Na adsorption on the electronic structure of bare and Ir cluster superlattice covered epitaxial graphene on Ir(111) using angle-resolved photoemission spectroscopy and scanning tunneling microscopy. At Na saturation coverage a massive charge migration from sodium atoms to graphene raises the graphene Fei level by about 1.4 eV relative to its neutrality point. We find that Na is adsorbed on top of the graphene layer and when coadsorbed onto an Ir cluster superlattice it results in the opening of a large bandgap of Delta = 740 meV comparable to the one of Ge and with preserved high group velocity of the charge carriers. ",
        " Two-dimensional (2D) lattices composed exclusively of pentagons represent an exceptional structure of materials correlated to the famous pentagonal tiling problem in mathematics, but their pi-conjugation and the related electronic properties have never been reported. Here, we propose a tight-binding (TB) model for a 2D Cairo pentagonal lattice and demonstrate that p-d pi-conjugation in the unique framework leads to intriguing properties, such as an intrinsic direct band gap, ultra-high carrier mobility and even slant Dirac cones. On the basis of first-principles calculations, we predict a candidate material, 2D penta-NiP2 monolayer, derivated from bulk NiP2 crystal, to realize the predictions of the TB model. It has ultra-high carrier mobility (sim10^5-10^6 cm^2V^-1s^-1) comparable to that of graphene and an intrinsic direct band gap of 0.818 eV, which are long desired for high-speed electronic devices. The stability and possible synthetic routes of penta-NiP2 monolayer are also discussed. ",
        " Here we report the optical and x-ray absorption (XAS) spectra of the wide-band-gap oxide MgO using density functional theory (DFT) and many-body perturbation theory (MBPT). Our comprehensive study of the electronic structure shows that while the band gap is underestimated with the exchange-correlation functional PBEsol (4.58 eV) and the hybrid functional HSE06 (6.58 eV) compared to the experimental value (7.7 eV), it is significantly improved (7.52 eV) and even overcompensated (8.53 eV) when quasiparticle corrections are considered. Inclusion of excitonic effects by solving the Bethe-Salpeter equation (BSE) yields the optical spectrum in excellent agreement with experiment. Excellent agreement is observed also for the O and Mg K-edge absorption spectra, demonstrating the importance of the electron-hole interaction within MBPT. Projection of the electron-hole coupling coefficients from the BSE eigenvectors on the band structure allows us to deteine the origin of prominent peaks and identify the orbital character of the relevant contributions. The real space projection of the lowest energy exciton wavefunction of the optical spectrum indicates a Wannier-Mott type, whereas the first exciton in the O K-edge is more localized. ",
        " Opening up a band gap of the graphene and finding a suitable substrate are two challenges for constituting the nano-electronic equipment. A new two-dimensional layered crystal g-C2N (Nat. Commun. 2015, 6, 1--7) with novel electronic and optical properties can be effectively synthesized via a wet-chemical reaction. And g-C2N can be used as a suitable substrate to open the band gap of graphene as much as 0.239 eV, which is large enough for the band gap opening at room temperature. The physics behind the band gap opening is that g-C2N substrate can produce the inhomogeneous electrostatic potential over the graphene layer. The imposition of external electrical field can tune the band gap of the hybrid of graphene/g-C2N effectively from the semiconductors to the metal. The hybrid graphene/g-C2N displays an enhanced optical activity compared with the pure g-C2N monolayer. ",
        " We demonstrate theoretically the coexistence of Dirac semimetal and topological insulator phases in InSb/alpha-Sn conventional semiconductor superlattices, based on advanced first-principles calculations combined with low-energy kcdot p theory. By proper interfaces designing, a large interface polarization emerges when the growth direction is chosen along [111]. Such an intrinsic polarized electrostatic field reduces band gap largely and invert the band structure finally, leading to emerge of the topological Dirac semimetal phase with a pair of Dirac nodes appearing along the (111) crystallographic direction near the Gamma point. The surface states and Fei arc are clearly observed in (100) projected surface. In addition, we also find a two-dimensional topological insulator phase with large nontrivial band gap approaching 70 meV, which make it possible to observe the quantum spin Hall effect at room temperature. Our proposal paves a way to realize topological nontrivial phases coexisted in conventional semiconductor superlattices by proper interface designing. "
    ],
    "sources": [
        "1602.01663",
        "1709.03024",
        "1804.07168",
        "2011.14819",
        "2102.07292",
        "1905.04563",
        "cond-mat/0404304",
        "2005.12205",
        "cond-mat/9612201",
        "2301.07983",
        "2203.02122",
        "1603.01791",
        "1906.05444",
        "1011.1315",
        "1710.08995",
        "1111.0534",
        "1311.2779",
        "1307.5451",
        "2006.03384",
        "1602.03071",
        "1709.00738",
        "1509.09118",
        "1912.03893",
        "1402.4255",
        "1904.07301",
        "1903.09856",
        "1304.1389",
        "2211.14863",
        "2203.15949",
        "1312.1275",
        "2211.06443",
        "2012.09032",
        "1508.03919",
        "1511.02601",
        "1803.00289",
        "2209.00129",
        "2011.01389",
        "2201.08590",
        "1810.09924",
        "2001.06161",
        "1909.08455",
        "1311.6970",
        "1706.01261",
        "1509.00516",
        "2301.11138",
        "1606.03017",
        "2112.14429",
        "2010.14403",
        "2207.06232",
        "1911.12171",
        "2203.05760",
        "1010.2925",
        "1111.0793",
        "1910.06863",
        "1209.6288",
        "2103.16975",
        "2104.02142",
        "1708.04848",
        "1104.4383",
        "2006.11455",
        "2105.01024",
        "1908.05300",
        "1410.5346",
        "1106.2802",
        "2107.01409",
        "2012.05953",
        "1201.4258",
        "1404.6328",
        "2103.03521",
        "1603.06308",
        "1303.2695",
        "1705.10429",
        "1912.03708",
        "2210.13000",
        "cond-mat/0401246",
        "1810.11330",
        "1101.4212",
        "1601.07056",
        "1809.05913",
        "2203.10349",
        "2202.10929",
        "1307.1351",
        "cond-mat/0411021",
        "1809.10343",
        "1607.03568",
        "0809.4905",
        "2104.11859",
        "1806.03360",
        "2105.03334",
        "0907.1546",
        "2110.00191",
        "1809.07015",
        "1909.09170",
        "2302.03150",
        "1704.04276",
        "2106.04391",
        "2206.01057",
        "2202.13218",
        "1209.1231",
        "0809.3506",
        "1007.5222",
        "1205.2477",
        "2212.06289",
        "2005.13900",
        "cond-mat/0301515",
        "1401.6993",
        "1306.2063",
        "2012.07220",
        "1903.07372",
        "2207.04409",
        "2111.08588",
        "1609.07036",
        "2203.15294",
        "1102.1026",
        "1504.06268",
        "2211.08642",
        "2012.07841",
        "1707.02706",
        "1609.09484",
        "1110.5702",
        "1411.1196",
        "1803.03412",
        "1705.01245",
        "1002.1611",
        "2204.04298",
        "1406.5012",
        "0901.1014",
        "1009.0442",
        "1411.2016",
        "2001.01601",
        "1312.4371",
        "cond-mat/0411067",
        "1007.4574",
        "1611.07405",
        "2012.08960",
        "1711.06342",
        "2010.11109",
        "1210.3481",
        "1511.05704",
        "2004.10183",
        "1910.02784",
        "1105.0977",
        "1906.08767",
        "1811.02348",
        "2105.08797",
        "1404.2331",
        "1805.04464",
        "1910.02784",
        "2206.00808",
        "2006.06842",
        "1605.01574",
        "2005.00609",
        "2208.02505",
        "1406.5003",
        "2205.04046",
        "2110.06555",
        "2202.04698",
        "1301.3935",
        "1909.05558",
        "1401.4504",
        "1708.08787",
        "1308.6219",
        "cond-mat/0404367",
        "1610.02719",
        "2105.02109",
        "2004.04759",
        "1205.5099",
        "1804.08423",
        "1706.00781",
        "1507.06735",
        "2103.09004",
        "1906.09409",
        "2301.11373",
        "1712.06665",
        "1512.05021",
        "2211.00560",
        "2212.02772",
        "1810.07297",
        "cond-mat/0409732",
        "1307.1720",
        "2007.09165",
        "1409.8418",
        "2102.05699",
        "1903.06198",
        "1309.6785",
        "1610.00407",
        "2210.06930",
        "2208.03601",
        "cond-mat/0612597",
        "2210.17397",
        "1910.02984",
        "2006.16639",
        "1711.11228",
        "1902.02681",
        "1801.03496",
        "1112.2532",
        "1808.00619",
        "2012.08960",
        "1510.09022",
        "1607.04391"
    ]
}